package classes.scenes.places.farm
{
   import classes.CoC;
   import classes.DynStat;
   import classes.Player;
   import classes.StatusEffects;
   import classes.Time;
   import classes.Vagina;
   import classes._FlagDict.FlagDict_Impl_;
   import classes.display.SpriteDb;
   import classes.globalFlags.KFLAGS;
   import classes.internals.Utils;
   import classes.items.Consumable;
   import classes.items.ConsumableLib;
   import classes.items.Weapon;
   import classes.scenes.Camp;
   import classes.scenes.Inventory;
   import classes.scenes.npcs.SophieBimbo;
   import classes.scenes.npcs.Vapula;
   import classes.scenes.places.Farm;
   import coc.view.CoCButton;
   import flash.Boot;
   import haxe.IMap;
   import haxe.ds.IntMap;
   import haxe.ds.StringMap;
   
   public class FarmCorruption extends AbstractFarmContent
   {
      
      public static var init__:Boolean;
      
      public static var tattooFlagMap:IMap;
      
      public var slotNames:Array;
      
      public function FarmCorruption()
      {
         if(Boot.skip_constructor)
         {
            return;
         }
         slotNames = ["锁骨","肩膀","后腰","屁股"];
         super();
      }
      
      public function whitneyVagCapacity() : Number
      {
         return 44;
      }
      
      public function whitneySubPleasure() : void
      {
         clearOutput();
         whitneySprite();
         var _loc1_:Function = null;
         var _loc2_:Boolean = false;
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1136) == 0)
         {
            _loc2_ = true;
            firstOralTraining();
         }
         if(get_player().hasCock())
         {
            _loc1_ = cockOralTraining();
         }
         else
         {
            _loc1_ = vaginaOralTraining();
         }
         var _loc3_:IMap = KFLAGS.flags;
         FlagDict_Impl_.arrayWriteInt(_loc3_,1136,FlagDict_Impl_.arrayReadInt(_loc3_,1136) + 1);
         if(_loc2_)
         {
            doNext(_loc1_);
         }
         else
         {
            _loc1_();
         }
      }
      
      public function whitneySprite() : void
      {
         get_farm().whitneySprite();
      }
      
      public function whitneyMaxedOralTraining() : Boolean
      {
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1136) == 100)
         {
            return true;
         }
         return false;
      }
      
      public function whitneyHasTattoo() : Boolean
      {
         if(!(1129 in KFLAGS.flags.h || 1130 in KFLAGS.flags.h || 1131 in KFLAGS.flags.h))
         {
            return 1132 in KFLAGS.flags.h;
         }
         return true;
      }
      
      public function whitneyFullTribalTats() : Boolean
      {
         if(numWhitneyTribalTats() == 4)
         {
            return true;
         }
         return false;
      }
      
      public function whitneyDomStraponDoggy() : void
      {
         clearOutput();
         whitneySprite();
         outputText("惠特尼脱下衣服后，爬上床来到你身边。她花了几秒打量你，而你也忍不住同样打量起她来；把她纤细而柔韧的身形尽收眼底，她窄窄的大腿和手臂上绷着紧实的肌肉，又被各处些微的柔软感中和。尤其是她那对小巧挺翘的乳房，以及坚硬的棕色乳头。你的目光抬起，对上她的眼睛，那眼神心照不宣，又坏得很。");
         outputText("[pg][say:看来你挺喜欢这景色嘛，]她说道，嘴角抽动出一丝笑意。[say:现在该你回报我了。转过去。跪下。]你慢慢地以" + (!get_player().isBiped() ? "尽可能接近" : "") + "她要求的方式照做，挪动下半身让自己转向另一边。一只手用力压在你的后脑勺上，迫使你的鼻子埋进散发着洁净气味的床单里，屁股则高高翘起。惠特尼的另一只手落在你的[butt]上，以一种试探、欣赏而充满占有欲的动作在上面抚过，热意顿时涌上你的脸。");
         outputText("[pg][say:你知道你在外头到处走、让这玩意儿在身后晃来晃去的时候，我忍得有多辛苦吗？]她嗓音沙哑地说道。压在你头上的那只手已经消失了；身后传来一阵反复的湿滑声，你不用猜也知道它去了哪儿。[say:你老是弯腰，是不是就是为了逗我？我发誓你就是。我发誓，你这个暗地里发骚的小婊子。]她突然用力抓住你的臀肉，让你倒抽一口气。[say:其他奴隶都只能看，可只有我能这样摸它。我可不会浪费这个机会。你敢把这么漂亮的、" + (get_player().butt.rating <= 4 ? "紧致屁股" : "大屁股") + "拿出来招摇，我非得让你付出代价不可，我发誓……别动。]");
         outputText("[pg]她的手抽了回去，你听着她在你身后的房间里走动，随后又回到床边，把几样东西放到床上，然后带着办正事般的热切回到你身后。你的双手被抓住，用摸起来像丝绳的东西牢牢绑在背后。");
         if(get_player().isBiped() || get_player().isTaur())
         {
            outputText("接着，她把你的脚踝推开，在每只脚踝上绕上一条皮带，然后猛地一拽收紧；你小心地试探了一下，带着一阵冰冷的战栗发现两者之间连着一根金属杆，强迫你维持这个姿势。");
         }
         else if(get_player().isDrider())
         {
            outputText("随后她把你细瘦的双腿压到床下，将一条连在床架上的皮带绕过它们，把它们全都困在那里，而你没有挣扎。");
         }
         else if(get_player().hasTailInsteadOfLegs())
         {
            outputText("她接着把你的[if (isNaga) {爬行类的}]盘蜷身躯绕在床柱上，用专门配好的皮带固定住。");
         }
         else
         {
            outputText("<b>有东西出错了！</b>");
         }
         outputText("[pg]你彻底摆出臣服的姿势，脸和[chest]都被压进床里；当你那技艺可怕地娴熟的女奴调教师挪到你面前时，你惴惴不安地抬头看去。她正露出带着尖牙的笑容俯视着你，手里晃着刚从梳妆台拿来的最后两样东西。");
         if(get_player().hasVagina() && !get_player().hasCock() && get_game().vapula.vapulaSlave())
         {
            outputText("[pg]她一只手里的木拍或许并不算多意外，但另一只手里的东西……那是一根双头穿戴式假阳具，一端相对较小，看起来很柔软；另一端则是个紫色怪物，凸起上画着刺眼的豹纹斑点。你立刻认出了它，带着几分惊恐抬头看向惠特尼，而她的笑容只咧得更大了。");
            outputText("[pg][say:没错。你的魅魔一听说我要借这个来在床上对付你，可是高兴得不得了。你知道吗，她好像还天真得很，以为你会把它用在我身上？可见她根本不了解情况。噢，别这样嘛，[name]，]她柔声哄着，一边把那根恶魔假阳具在你面前挑逗地晃来晃去。[say:说得好像你从来没幻想过从另一端被干似的。再说了，都到这地步了，你还以为自己有得选吗？]");
         }
         else
         {
            outputText("[pg]她一只手里的木拍并不算多意外，另一只手里的东西……那是一根带绑带的双头假阳具，显然是设计成让佩戴者在干别人的同时，自己也被干。一端相对较小，看起来很柔软；另一端则是个又粗又长、足有九英寸的怪物，亮黑色的器具末端布满光滑的凸粒。你慢慢看清它时，惠特尼的笑容也越咧越大。");
            outputText("[pg][say:猜得出来我要把哪一端给你吗，[name]？猜得出来吗？嗯……虽然我挺想让你多悬着一会儿……]");
         }
         outputText("[pg]你看着惠特尼慢慢把较小的那一端抵在自己的小穴上；经过刚才疯狂的自慰，那里已经肿胀而湿润。她闭上眼，梦呓般叹了口气，让它滑入体内，光滑的塑料一点点填满她紧窄的甬道，直到抵住绑带。她给自己扣好带子时，眼帘低垂地回望着你；当她把粗大的那一端甩到你面前时，她低声笑了起来，随即又因那根牢牢卡在她小穴里的假阳具在体内弯折而化作一阵娇吟。");
         outputText("[pg]等她弄完，你发现她还给你准备了最后一个惊喜。她跪下来，几乎与你的脸齐平，一只手伸到你的[hips]之间，另一只手则在地板上摸索。你闭上眼睛，就算想阻止，也阻止不了她轻轻抚摸" + (get_player().hasCock() ? "你半勃起的[cock]" : "你[vagina]内侧的阴唇") + "，你张开嘴叹息，任由她把一阵阵快感的颤栗送进你的体内。");
         outputText("[pg]你猛地瞪大眼睛，光滑而潮湿的棉布突然被塞进你的嘴里。你微微干呕了一下，可后面的那只手却不肯松劲，很快，你的嘴里就被那件白色衣物和它浓重的麝香味塞得满满当当。[say:你这样闷着声音会可爱多了，]惠特尼低声说着，欣赏着你的嘴被她的内裤塞满的模样。[say:而且我想让你明白你把我折腾成了什么样。明白为什么我非得像接下来这样狠狠干你的屁股。]说完，她扭着身子走到你被捆住、跪伏乞怜的身后。");
         outputText("[pg]当你感觉到假阳具粗大的那一端啪地拍在你的臀缝之间时，一阵寒意顺着你的脊背窜过。你激起了这个女人的狂乱，而现在你实在没有任何办法阻止她；你的双手被绑在身后，[vagOrAss]又被迫像发情母狗一样挺出来，你只能跪在那里承受。");
         outputText("[pg]惠特尼把她粗大的假阳具抵在你的[asshole]口，");
         if(get_player().hasVagina())
         {
            outputText("慢慢向下引导，直到它碰到你的阴唇，再用缓慢内推的动作轻轻挑逗着你。她轻轻分开你的唇瓣，让顶端的凸钉擦过你的[clit]和柔软的肉穴，随后又抽回去，在你[vagina]的入口周围转动头部，让她那一端也顶进自己体内，直到她舒服地叹息起来。在这持续不断的动作下，你的小穴逐渐变软、变湿，你也忍不住隔着潮湿的内裤发出同样的呻吟。这似乎正是惠特尼一直在等待的信号。她用一个果断的动作贯入了你，粗大的假阳具将你撑开，带着凸节的头部深深刺入你的深处。");
         }
         else
         {
            outputText("用缓慢内推的动作轻轻挑逗着你。她执拗地把仿制肉棒顶在你的菊穴上，让你感受每一颗凸钉进入时的触感，随后又抽回去，在你的屁股上转动头部，让她那一端也顶进自己的性器，直到她舒服地叹息起来。在这持续不断的动作下，你也忍不住隔着潮湿的内裤发出同样的呻吟。这似乎正是惠特尼一直在等待的信号。她用一个果断的动作贯入了你，粗大的假阳具将你撑开，带着凸节的头部深深刺入你的深处。");
         }
         var _loc1_:Number = get_player().hasVagina() ? get_player().vaginalCapacity() : get_player().analCapacity();
         if(_loc1_ >= 36)
         {
            outputText("[pg]犬女惊讶地喘了一声，她的假阳具竟轻易滑了进去，你的");
            if(get_player().hasVagina())
            {
               outputText("又深又饥渴的小穴");
            }
            else
            {
               outputText("油滑、久经使用的通道");
            }
            outputText("迫不及待地将它吞没，直到她坚硬的臀胯抵上你的[butt]。");
            if(get_player().hasVagina())
            {
               get_player().cuntChange(36,true,true,false);
            }
            else
            {
               get_player().buttChange(36,true,true,false);
            }
            outputText("[pg][say:你对肉棒可不陌生吧，[boy]？]她喘息着。拍板啪的一声脆响落在你的屁股上，你吓得猛地一颤。[saystart]你没在这儿耀武扬威的时候，我猜你");
            if(get_player().hasVagina())
            {
               outputText("随便谁来都能坐下张开腿，对吧？");
            }
            else
            {
               outputText("会跪下来伺候任何一根又漂亮又淫滑的肉棒，对吧？");
            }
            outputText("你的其他奴隶会怎么想？我秘密里的小荡妇。[sayend]");
            outputText("[pg]你很想反驳几句，大意就是做爱并不等于屈服，可你现在实在没法开口说话，而且除了攫住你身体的欲望，以及惠特尼强加给你的那种强烈而复杂的快感，你已经很难再集中精神想别的了。");
         }
         else
         {
            outputText("[pg]犬女缓缓挺进你的体内，感受着你那");
            if(get_player().hasVagina())
            {
               outputText("紧窄小穴的吞纳");
            }
            else
            {
               outputText("紧窄后穴被撑开的感觉");
            }
            outputText("，满足地呻吟着，同时也把假阳具的另一端推进自己体内。你的通道被肉棒彻底塞满，尽管那只是仿制品，这强烈的感觉还是逼得你喉咙里发出更响的呻吟。");
            if(get_player().hasVagina())
            {
               get_player().cuntChange(36,true,true,false);
            }
            else
            {
               get_player().buttChange(36,true,true,false);
            }
            outputText("[pg][say:就是这样，]惠特尼得意地喘息着，她坚硬的臀胯终于抵上你的[butt]，整根都埋进了你体内。[saystart]为我叫出来，[boy]！这正是你需要的东西，对吧？等你对你的");
            if(get_player().hasVagina())
            {
               outputText("仆人面前作威作福的时候想想，你这又紧又爱摆架子的小贱人");
            }
            else
            {
               outputText("牲口面前作威作福的时候想想，你这又紧又爱摆架子的小贱公狗");
            }
            outputText("。[sayend]");
            outputText("[pg]板子啪的一声脆响抽在你的屁股上，让你惊得猛地一颤。你试着回想自己什么时候同意过这种对待，可除了席卷全身的欲望，以及惠特尼施加在你身上那种鲜明而交错的感觉，你已经很难再把注意力集中到别的事情上了。");
         }
         outputText("[pg]她几乎完全抽了出去，带节的头部扯着你的" + (get_player().hasVagina() ? "入口，然后又挺回你的[vagina]" : "括约肌，然后又挺回你的[ass]") + "，同时把板子落在你发红的臀后。进入，啪，抽出；进入，啪，抽出；先是一边屁股，再换另一边……");
         outputText("[pg]你嘴里的内裤浸满了狗女人情动时的味道和气息；那浓郁的麝香堵在你的鼻腔和喉咙深处，让你兴奋得无以复加，而且根本无处可逃。你本来打算以符合自己身份的坚忍沉默来承受这场“放松”，可你还是忍不住隔着那团脏棉布呜咽呻吟。每一次重重抽在你[butt]上的拍打，都预示着那根粗得令人愉悦、表面凹凸不平的肉棒又要稳稳顶进来" + (get_player().hasCock() ? "，还愉快地撞上你的前列腺，让[eachCock]在快感中急切地鼓胀震颤" : "") + "。");
         outputText("[pg]你在束缚中徒劳地抽搐着，被她无情地推向高潮，" + (get_player().hasVagina() ? "你的小穴颤抖着，随即热切地夹紧了那根假阳具" : "你的[cockplural]跳动着，口端大张，随后被迫倾泻而出；后庭急切地收紧，裹住那根粗大的假阳具，让你神志恍惚地喷出精液") + "，血液涌上你的臀部表面——却正迎上板子重重的一击。惠特尼对你的高潮毫不在意，仍继续挺进你体内；你对着充满麝香味的口塞呻吟，那根温热的假肉棒" + (get_player().hasVagina() ? "毫不留情地" : "") + "压弯进你敏感的内壁" + (get_player().hasCock() ? "，继续无情地榨取你，让你的肉棒疼胀地硬挺着" : "") + "。");
         outputText("[pg]这一切持续了很久很久，床架的吱呀声、她大腿与板子拍打在你柔嫩[butt]上的肉响，成了这场激烈性爱的伴奏。感觉就像你圈养的情妇只是为了取悦自己而玩弄你，享受着你的模样和声音；每当她成功逼你发出尖叫，就会愉快地哼出声来。不过随着她的大腿一次次拍上你的，她的动作也越来越急切，为了把假阳具的另一端更深地顶进自己体内，她更加用力地操进你，喘息着缓解自己的欲火。");
         var _loc2_:Boolean = whitneyDefurred() || get_noFur();
         var _loc3_:String = get_player().hasVagina() ? "湿淋淋的小穴" : "屁眼";
         var _loc4_:String = get_player().hasVagina() ? "这一次甚至被那打桩般的力道弄湿了床" : "";
         var _loc5_:String = get_player().hasVagina() ? "[vagina]" : "屁股";
         outputText("[pg]一只" + (_loc2_ ? "手" : "爪子") + "绕到前面抓住你的[chest]借力，她终于开始使出全力，狠命撞进你被抽打得发嫩的穴里。她用手指夹住一颗[nipple]，你发现自己又被迫朝高潮逼近，耳边全是她粗重的呼吸，鼻腔里满是她浓烈的气味。可她已经不是为了取悦你才挺进了——如果她曾经是的话；那根绑带阳具野蛮而强硬地捅进你的" + _loc3_ + "，全都是为了她自己，为了尽可能用力地让那较小、挑逗人的一端在她自己的小穴里摩擦。你只是承载她欲望的工具；当你又一次咬着她的内裤，颤抖着哭喊着高潮时，" + _loc4_ + "她仍不停下，继续锤打你可怜的" + _loc5_ + "。");
         outputText("[pg]无休止的撞击逼得你翻起白眼，双手只能徒劳地抓向空气。终于，伴随着一声喘不过气般、狂喜的犬吠，以及板子最后一次重重抽在你的[butt]上，她也抵达了自己的顶点。她神魂颠倒地撞进你体内，沉溺在自己丰沛的高潮里好几秒，而你感觉自己几乎彻底融化了；你甚至发现自己在想，或许应该试着把自己的高潮时机调整得更合女主人的心意。");
         if(get_player().hasVagina() && !get_player().hasCock() && get_game().vapula.vapulaSlave())
         {
            outputText("你感觉假阳具的末端在你体内深处绷紧，随后释放出来，用温热的恶魔精液把你灌得满满当当，直到它溢到床上。那感觉糟糕透顶、恶心得要命，却又令人满足；有那么一瞬间，你完全明白了瓦普拉是如何看待这个世界的。");
         }
         outputText("[pg]她终于停了下来。她趴在你身上回气，仍然插在你体内；她小巧、桃色的乳房压着你的肩膀，柔软的小腹贴着你的手，呼吸拂过你的后颈。像这样相拥侧躺着短暂休息后，她翻身起来，慢慢替你解开束缚。等她解完，你翻身仰躺，盯着天花板，而她占有欲十足地偎进你怀里；你清楚地感觉自己像是被碾过一遍。你说不准自己为什么会答应这种事，但毫无疑问，让惠特尼随心所欲地对待你，是一种奇怪而强烈的释放，是你在别处找不到的——至少在那些最后还会放你走的地方找不到。");
         outputText("[pg]你还想多休息一会儿，但你不能。你费了些力气才让狗女人放开你，穿回衣服走向门口，步伐明显有些并膝发软。她看着你离开，轻轻笑了起来。");
         outputText("[pg][say:希望你确实放松下来了，[master]，]她说道。[say:准备好面对整个世界，把它压到你脚下了吗？当你需要接触真正的自己时，俺和这间屋子永远都会在这儿。]");
         get_player().orgasm("VaginalAnal");
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function whitneyDomRide() : void
      {
         clearOutput();
         whitneySprite();
         outputText("惠特尼甩掉内裤，爬上床，又爬到你身上，温热的双手和大腿把你压进床垫里。她坐到你身上后低头看向[eachCock]；她强健而纤细的大腿夹在你腰腹两侧的感觉，以及她小巧挺翘的乳房随着动作轻快晃动的景象，让它半硬了起来。她眼中有一种强烈、近乎残酷的欲望；按理说那眼神该让你萎缩下去，可它反而只让你在她身下变得更热、更柔顺。");
         outputText("[pg][say: 躺好别动，]她平静地命令道。你照她的话去做，望着天花板，感觉灵巧的手指抓住你的手腕，把固定在床架四角的皮革束带缠了上去，然后利落而有力地一拽，猛地拉紧。");
         if(get_player().isBiped())
         {
            outputText("她又对你的脚踝做了同样的事，让你无助地大字摊开在床上。");
         }
         else if(get_player().isDrider())
         {
            outputText("床底下连着几条长长的皮带；这些皮带缠住你纤细腿肢与沉重腹部相接的地方，让你几丁质的脚无助地指向天花板。");
         }
         else if(get_player().isGoo())
         {
            outputText("[say: 我没法把你牢牢固定住，]她低声说道，一边捏着你黏软的身体，手指陷了进去。[say: 都怪你这副也配叫身体的玩意儿。所以我再说一遍。躺。好。别。动。]");
         }
         else if(get_player().hasTailInsteadOfLegs())
         {
            outputText("你又长又沉的尾巴被绕在床脚的床架上，再用更多皮带固定住，让你无助地大字摊开在床上。");
         }
         outputText("[pg]等她把你绑好后，犬女一个弹身下了床，从你受限的视野里消失了。她在卧室里翻找着，动静听起来不怀好意。她是在故意搬动特别沉的东西来折磨你吗？她回到你身边时，你伸长脖子想看清她手里拿着什么——然后一片黑幕突然落下，遮住了整个世界，你惊得叫出声来。");
         outputText("[pg][say: 别再乱动了，甜心，]惠特尼柔声哄着，调整那条黑色弹性眼罩，把它牢牢蒙在你的眼睛上。" + (get_player().eyes.type == 1 || get_player().eyes.count > 2 ? " 等她弄好之后，又给你额外的眼睛也蒙上一条眼罩。看着这犬女居然能准备到这种地步，你只能又是呻吟又是发笑。" : "") + "[say: 可不能让你看见接下来会发生什么，对吧？那样乐趣可就少了一半。]");
         outputText("[pg]她爬到你下半身边，这次不紧不慢，让双手滑过你的腹部和[hips]，然后在[eachCock]前坐下" + (get_player().balls > 0 ? "，还短暂地捧住你的[balls]，让你不由得抽搐了一下" : "") + "。她用光滑的手指缓慢而刻意地挑逗着你，心里完全清楚：如今你身处一片漆黑，只能躺在那里，感受并聆听她对你所做的一切。");
         outputText("[pg]她温热的手环住你的[cock biggest]，用力攥紧，紧到几乎让你疼痛，然后又退回到若有若无的轻触，接着再次加重力道。紧……松。紧……松。你的呼吸渐渐急促，肉棒在这种近乎折磨的对待下无可避免地硬了起来。你听见一阵湿滑而有节奏的声音，过了一会儿才意识到，那并不是她正在对你做的事发出来的。");
         outputText("[pg][say: 对，]惠特尼嘶声说道，一边同时套弄你和她自己，一边陶醉于自己对眼前这具仰躺身体的掌控。[say: 这么强壮——却全都是我的。我的！]她开始用力撸动你时，你弓起背，[cock biggest]在她掌中胀大——随后有什么东西箍住了你肉棒根部，你顿时倒抽一口气。");
         outputText("[pg][say: 这样就好了，]你的奴隶女主人叹息着，继续轻柔地抚弄你那无助胀大的肉棒，手指勾到她套在上面的阴茎环。[say: 可不能让你从我手里逃掉，对吧？那可就把</i>全部<i>乐趣都毁了。]她低低地、长久而邪恶地笑了起来，接着你感到一片湿软——她把自己的小穴贴上了你被囚住的肉棒。");
         var _loc1_:int = get_player().cockThatFits(whitneyVagCapacity() * 1.33) + 1;
         var _loc2_:Boolean = false;
         if(_loc1_ == 0)
         {
            _loc2_ = true;
            _loc1_ = get_player().smallestCockIndex() + 1;
         }
         if(_loc2_)
         {
            outputText("[pg]她开始转动柔韧的腰胯，湿润的穴口沿着你的[cock biggest]上下滑动，你的嘴不由得张开。你的肉棒被强行维持着坚硬，又敏感到极点，以至于你能清楚感觉到她的穴唇分开包着你巨大的粗度，她小小的阴蒂沿途顶过每一道血管和凸起。她得站起来才能蹭到你的龟头，而你也忍不住想挺进那诱人、温热又湿滑的洞里。");
            outputText("[pg]她笑着从你的龟头上退开，换了个姿势，改去摩擦你肉棒上侧时，你忍不住呻吟出声。她似乎打定主意要用你肉棒的每一寸来自慰，用她的淫液裹满每一寸……而她要覆盖的范围可大得很。");
            outputText("[pg][say: 你为什么会有这么大的鸡巴？]她一边贴着你的根部滑动，一边自言自语，手指按在上侧附近那处敏感点上。哪怕你知道该怎么回答，此刻也只能喘息以对，被困在这仿佛永无止境的灼热时刻里。");
            outputText("[pg][say: 我的意思是，这东西大多数人都塞不进去吧。我肯定不会试。听说不管肢体有多大，里面的神经末梢数量都一样，所以这也不是为了你好——见鬼，我都能想象光是拖着这玩意儿走来走去就够累的了。难道只是用来吓人？在男厕所里把那些家伙吓得屁滚尿流？]她一边挺身蹭着你，一边自顾自地笑。她已经用自己的淫液把你的肉棒润得足够湿滑，以至于能快速地朝你身上顶去，把你那根图腾柱般鼓胀的肉棒向你的头部方向压弯。[say: 要我说，这就是个战利品。大块没用的肉，让你不用真的鼓起勇气去使用它，就能把大多数人震住。好笑的是……]");
            outputText("[pg]有什么东西突然抵住了你胀大的尿道口。那股强烈的感觉让你全身绷紧，你叫出声来，几乎是在求她停下。惠特尼温柔地嘘声安抚你，一边平静地揉着你鼓胀的长度，一边仍坚持把那根细细的东西顶在入口处。她耐心等到你的背重新落回床垫上，才将它推进去，撑开你敏感得惊人的尿道。");
            outputText("[pg]你咬紧牙关；那是一串硬挺的珠子，每一个圆鼓鼓的凸起滑进你的肉棒里，都会让汗珠从你额头冒出来。随着它在你的[cock biggest]里越推越深，你根本无法把注意力放在那压倒性的感觉以外的任何事物上。[say: 你有这么大的鸡巴，也就等于给了我一个能玩弄的、世上最紧的洞。]终于，谢天谢地，她停止继续往深处推珠串，第一颗珠子几乎已经抵达你被困住的肉棒根部。");
            outputText("[pg]你感到饱胀，被完全不受自己控制的力量撑大并变得敏感。惠特尼带着挑逗的轻哼抚过它时，你忍不住弓起背。你阳具的内外都清晰感受到她柔软的触碰，肉壁在那凹凸不平的侵入物周围收缩，皮肤也因拂过其上的快感而阵阵悸动。[say: 不光如此，现在你身上终于有样东西，对我来说是真的有用了！]");
            outputText("[pg]说着，她又开始在你被润滑得湿亮的肉棒上磨蹭自己，让你呻吟出声；她把紧致的小穴压上你的柱身，一路滑了上去。她湿热的温度沿途压过每一颗珠子，阴蒂蹭过你那凸凹不平的肉棒时，她发出深深愉悦的叹息。");
            outputText("[pg]她很快加快了节奏，大腿夹紧你的肉棒根部，她的" + (whitneyDefurred() || get_noFur() ? "脚" : "后爪") + "不耐烦地抵着你的[chest]和肩膀，把你的[cock biggest]当成她亲手改造成的自慰柱来用。那感觉几乎让人无法承受；你的肉棒像是两头都被堵住，肉体被困在一副快感的夹钳中，而每当她压到一颗卡在你尿道里的珠子，那快感就会难以忍受地拔高。你忍不住呻吟，继而发出犬吠般的叫声，在束缚中无力地绷紧，臀部随着惠特尼贪婪的挺动而痉挛。失明似乎让这令人销魂的折磨变得更加强烈，让你的整个世界都收束到你那橡木般的肉棒上——你引以为傲的宝贝被困住，被你的奴隶女主人拿来达成她自己的目的。");
            outputText("[pg]她越来越用力地朝你压来，随着你无助的抽搐顶进她敏感的阴道和鼓胀的阴蒂，她发出闷哼，把你的肉棒向后压弯；她开始因欲望而喘息，毫不留情地带着你一起逼近高潮，强迫你感受她自己不断攀升的需求。自从阴茎环扣上你的[cock biggest]以来，你就隐约感到一种绝望——绝不能射出来。谁知道那会对你这根可怜又饱受折磨的肉棒造成什么后果？");
            outputText("[pg]惠特尼湿透的性器一次又一次滑过你的长度，摩擦着里面的珠子，让你整根肉棒都像烧得通红。你感觉精液正不可抗拒地冲破你的意志往外推。惠特尼在达到自己的高潮时嚎叫起来，尽可能用她坚实娇小的身体缠住你的肉棒；她的小穴夹紧你的肉缝，而你也和她一起发出不成声的吠叫，弓起背，无助地向她顶回去，整个身体被高潮攫住。那股力道足以冲过根部紧箍的圆环……可当你的精液撞上另一处侵入物时，却找不到通过的路。你的肉棒徒劳地鼓胀、抽动，让你叫喊出声，而惠特尼狂乱的挺动仍围绕着它持续；但你能感觉到，出口处真正流出来的，只有最微小的一滴渗液。");
            outputText("[pg]终于，你的宠物女施虐者停了下来，释放了自己压抑已久的欲望后，兴奋得又喘又呼；那证明正温热地沿着你的[hips]淌下。你感觉到自己的大部分汁液正慢慢回沉到肉棒深处，不由得呻吟；惠特尼在你身上短暂休息后，缓慢而轻柔地把阴茎珠串抽出来，你咬住了嘴唇。每一个凸起从你的尿道口滑出时，你都感觉它们像毫无摩擦却巨大的圆石。等它们终于全都出来，她解开你的束缚和眼罩，沉默地示意你坐起来。");
            outputText("[pg]光线刺痛了你的眼睛，但你闭上眼并不是因为这个；当你坐直后，堵在肉棒里的那股被拒绝释放的精液开始流出，让你嘶哑地呻吟起来，一大股温热的精潮从你体内涌出，淌到地板上。等它全部流尽，你又花了几秒恢复，这才意识到你的[cock biggest]依然硬得像石头，敏感、胀痛，充满得不到满足的焦躁；对它而言，你根本没有得到释放。惠特尼把一只光滑的手放上去，让你猛地一颤。");
            outputText("[pg][say: 我就想让你保持这样，]她贴着你的耳朵低语，脸上带着淫荡而自豪的笑。[say: 我把你掏空了，可你还是躁得不行，对吧？你想出去，用这玩意儿狠狠抽在玛瑞斯脸上，直到它放弃反抗，颤抖着跪在你面前。我一直都想让你这样，因为奴隶越多，而你越渴望释放，我的日子就越过越甜。去吧，[name]，去让这个世界明白自己的位置。等你的发条又需要上紧的时候，我会在这里等你。]");
            outputText("[pg]你默默起身穿上衣服，起初还有些发抖，但很快便越来越坚定。她说得没错——虽然你已经被彻底干过了，可那股欲火，那股总在你脑海深处翻腾的愤怒欲望，依旧丝毫未减。你感觉像是你那奴隶女主人的欲望全都转移到了你身上，让你更想去干些什么。你转身粗暴地吻住她；她也同样热烈地回应，几乎是欢欣地用舌头攻击你口腔内侧和你的舌头。漫长、湿润而含混的一刻之后，你转身大步离开。");
            get_player().set_hoursSinceCum(0);
            dynStats(DynStat.Lib(1));
         }
         else if(get_player().cockArea(_loc1_ - 1) > whitneyVagCapacity() * 0.66)
         {
            outputText("[pg]她开始转动柔软的腰胯，让湿漉漉的入口沿着你的[cock " + _loc1_ + "]上下滑动，你不禁张开了嘴。你的肉棒被强行弄得硬挺而敏感，敏感到能清楚感觉到她的阴唇被你粗大的尺寸撑开，她小巧的阴蒂在遇到每一条血管和每一处凸起时都上下擦过。你忍不住想挺进那诱人又温热湿润的洞里；可她笑着从你的龟头顶端抽离，挪了挪身体，转而磨蹭起你肉棒的上侧，你只能发出一声呻吟。她似乎打定主意要用你的[cock " + _loc1_ + "]每一寸来让自己自慰，把每一寸都涂上她的女根精液……而她要照顾的地方可还不少。");
            outputText("[pg][say: 你是个实用主义者，对吧，[name]？]她若有所思地自言自语，一边沿着你的根部滑动，手指按在靠近顶端的敏感处。你只能喘着气回应，困在这无休止的灼热瞬间里，就算知道该怎么回答她的沉思，也说不出话。[say: 其他组建后宫的[guy]，都会长出一根巨大的肉棒，好用来彰显自己的地位，你懂吧？可你不是。你把它保持得又好又适中，只为了能塞进每一个能塞的洞里。]她又笑了起来，这次笑声更轻，她的阴蒂压上你硬挺的阴茎缝，让你张开了嘴。你想把自己深深埋进她体内的冲动每一秒都在增强，但你知道，只要你试图这么做，她就会把那挑逗人、诱人到极点的湿热移开。你稍微觉得有些奇怪，她竟然没有也用双手来折磨你；她那样小心地托着自己，简直像是在抱着什么东西。空气中有一股淡淡的、寡淡而温热的气味。");
            outputText("[pg][say: 这样一来，每个洞都能用你了。挺骚的，不是吗？哦，你当然可以装作自己只是很懂分寸，才长了这么一根鸡巴，可你知道这种长度在我看来是什么意思吗？它是在说：“我属于任何人。我就是为了取悦别人。用我吧。”] 她凶狠地低吼出最后几个字，终于向下挺身，把你那根被困住、胀硬的[cock " + _loc1_ + "]上半截沉进她紧窄的小穴里。她缓慢却坚定地旋动腰胯，把你压进自己体内；那令人销魂的柔软揉挤淹没了你的龟头，让你忍不住喘出声来。");
            outputText("[pg]你费了好大劲才决定不向上顶回她体内，因为她显然不怎么喜欢你这么做。反正就这么躺着，感受她享用你，也已经足够舒服了……一小滴白色的痛楚忽然在你腹部成形，像是一根滚烫的手指猛地戳上你的肚子，让你惊叫一声，在束缚中抽搐起来。惠特尼因你的反应得意地叫出声，你这一痉挛反而让肉棒深深顶进了她体内。那处痛点慢慢冷却，只留下钝钝的残留感，而你终于意识到她手里拿着什么，不由得嘶哑地呻吟起来。");
            outputText("[pg][say: 半人马巨屌也好，小娘炮鸡巴也好，那都能代表你，说明你到底是个什么样的[guy]，] 她低声咆哮着继续说，随着主题越说越起劲，她缓慢、规律又笃定地用你的身体抽送着自己，手里攥着的蜡烛不知悬在你上方何处。[say: 可你很弱，不是吗？一碰上小穴就完全没自制力。你就是想被任何人、任何东西拿来用。所以……就……好好被用吧！] 更多液态蜡滴溅落下来，这次落在你一颗" + (get_player().isLactating() ? "湿润的" : "紧绷的") + " [nipple]上，你忍不住又一次瑟缩，身体不受控制的动作再次让惠特尼因快感叫出声来，她紧致湿软的小穴欢快地榨弄着你的[cock " + _loc1_ + "]。");
            outputText("[pg]她的声音渐渐只剩下粗重的叹息和喘息，不再费心嘲弄你，因为她已经真正开始用你的肉棒来操自己。你完全失去了对时间流逝的感觉；这里只有她温热小穴包裹着你敏感顶端的紧致感，她结实的大腿压在你的[hips]上，还有那根蜡烛毫无差别的施虐。你被蒙住眼睛、束缚住身体，根本无法预料惠特尼急促的起落什么时候会让更多蜡滴溅落在你的[chest]或腹部；虽然你努力压抑自己的叫声，可每当又一处白灼的热痛刺进身体，你还是忍不住抽搐，而每一次都让这位把你当宠物支配的主人更加快乐。");
            outputText("[pg]她利用你把自己推上高潮，在她的小穴和大腿一同夹紧你时高声嚎叫——然后又若无其事地继续下去，懒洋洋地在你身上磨蹭了几分钟，等欲火重新燃起，便再次回到猛烈的抽送之中。哪怕你想射，也根本抵达不了自己的高潮；你一次又一次感觉它积蓄起来，又一次次退去，在令人沉醉的折磨中，被锁精环硬生生拒之门外。蜡烛带来的疼痛，与包裹并挤压着你肉棒的甜美快感交融在一起，形成一个只属于你的感官世界；眼前的黑暗让一切更加强烈，而你彻底沉溺其中，只按奴役你的女主人所愿去感受、去动作。");
            outputText("[pg]终于，在她自己高潮到你已经数不清次数之后，惠特尼大发慈悲。又一阵格外激烈的骑乘过后，她把身体压在你身上，你的 [cock " + _loc1_ + "] 也因此酸痛不已；她摆弄着覆盖在你身前、已经凝固的蜡块，而你根部那道坚硬的环扣终于被解开。她再次开始套弄你，双手紧紧攥住你的肩膀，一边让自己重新兴奋起来，任汗水滴落到你身上，沉重的呼吸在你耳边回响。");
            outputText("[pg][say: 来吧，[boy]玩具，]她低声说。[say: 射给我看。]她的小穴无法抗拒地紧夹着你憋了太久的阴茎，而它就像一直在等待她这道命令似的，立刻胀开，将一道道精液喷进那柔软、湿润又挤榨着你的深处。你的全身都被高潮攫住，因先前被剥夺而膨胀到巨大的快感让你朝惠特尼弓起后背，忍不住喊出声来。你的精液很快又从她湿热的穴口淌回到你身上，而你的肉棒仍在销魂地抽动；你被束缚的身体仿佛把全部力气都凝聚到了胯间，将种子一阵阵往上涌，直到肉体酸痛、阴茎只能徒劳地脉动。在意识的边缘，你隐约听见惠特尼的笑声；她还在继续骑着你，对自己在你身上造成的反应乐不可支。");
         }
         else
         {
            outputText("[pg]当她开始旋动柔软的腰胯，把湿润的穴口压上你的[cock " + _loc1_ + "]时，你的嘴不由得张开了。她轻易就将它整个吞没，随后又退开、再度覆上，用那湿热的温暖挑逗着你。你的肉棒被强行弄得硬挺又敏感，敏感到能清楚感觉她的阴唇一寸寸分开，包裹住你的小鸡巴，她小巧的阴蒂则抵在你鼓胀的龟头上。你忍不住想挺身插进那诱人的温暖湿穴里；可她笑着从你的龟头顶端退开，换了个方向，又从另一侧将你包住，让你发出一声低吟。她似乎打定主意，要用她能想到的每一种方式拿你来自慰。");
            outputText("[pg][say: 一个拥有后宫的[guy]，本钱怎么会这么寒酸？]她一边折磨你那玩具似的小鸡巴，一边自言自语。虽然她和你上过的其他人一样紧致，尺寸也不算夸张，你却仍无法完全填满她；而她如此从容地用柔软的肉褶在你身上来回摩擦，时不时夹住你鼓胀的龟头，那感觉简直销魂得近乎折磨。你除了喘息之外什么也做不了，像是被困在一个永无止境的炽热瞬间里，就算你知道该怎么回答她的自言自语也一样。");
            outputText("[pg][say: 是因为施虐癖吗？你倒是能把自己那根可爱的小娘炮棍泡进小穴里，你的荡妇们可什么都感觉不到。你用这玩意儿的时候她们会呻吟吗？要是会，我保证她们想的肯定是牛头人又粗又大的鸡巴。]她低低地自顾自笑了起来，同时缓慢却坚定地旋动腰胯，把你压向她；那柔软的包裹感揉弄着你的龟头，你根本忍不住倒抽一口气。[say: 不，我看她们什么都不会说。会在射的时候像挨了打的小女生一样呜咽的是你吧，大概真正的女人才刚碰到它几秒钟你就不行了。]你能感觉到羞耻的红晕爬上脸颊；你拼命想把它压下去，想笑着把她刻薄的话带过去，可她这样用小穴若即若离地亲吻你，实在太难了。在这种情况下，你决定保持沉默，不给她任何回应。毕竟，只是躺在这里，欣赏她享用你肉体的愉悦，也确实相当惬意……");
            outputText("[pg]一小滴白色的痛楚忽然落在你的腹部，就像有一根滚烫的手指刚戳进你的肚子，惊得你叫出声来，身体也在束缚中抽动。惠特尼见你这反应得意地叫了起来，你的痉挛让你的肉棒更深地顶进她体内。那点痛楚慢慢冷却，只留下一阵迟钝的余痛；当你意识到她手里拿着什么时，不由得粗哑地呻吟起来。");
            outputText("[pg][say: 就是这样。哭给我听，娘炮！]她一边喊着，一边越说越来劲，缓慢、规律又坚定地骑弄着你，手里攥着的蜡烛就在你上方某处。[say: 天啊，就这么点大的屌，还想让我狠狠对你，合情合理，不是吗？你骨子里就是个娘炮，而娘炮想要的就是被惩罚、被使用。所以……给我……好好被用吧！]更多液态蜡油溅落下来，这一次落在一颗" + (get_player().isLactating() ? "湿润的" : "紧绷的") + " [nipple] 上；你忍不住再次瑟缩，而那不由自主的动作又让惠特尼愉悦地叫出声来，她紧致水润的小穴欢快地榨弄着你的 [cock " + _loc1_ + "]。");
            outputText("[pg]她渐渐只剩下粗重的叹息和喘息，不再费心嘲弄你，真正开始借着你的身体取乐。你已经感觉不到时间流逝；世界里只剩下她温热小穴的紧致，完整包裹着你那根男孩阴蒂，她结实的大腿压着你的 [hips]，还有那支蜡烛毫无差别的施虐。你被蒙住眼睛、束缚着，完全不知道惠特尼轻快的起伏什么时候又会让蜡油溅落在你的 [chest] 或腹部。尽管你努力压抑自己的叫声，可每当又一处白热的痛点刺进你时，你还是忍不住抽动，而每一次都只会让你这位宠物女主人更加愉悦。");
            outputText("[pg]不管她嘴上怎么嫌弃你的尺寸，她倒是完全不介意在你身上把自己推上高潮，节奏分明地用她肿胀的小蒂顶弄你那根虽小却硬得要命的肉棒；当她的小穴和大腿一起夹紧你时，她放声嚎叫——然后竟然就这么继续下去，懒洋洋地在你身上磨蹭几分钟，等欲火回潮后又重新变得猛烈。就算你想，也根本到不了高潮；你一次次感觉快要积聚起来，却又一次次退去，被甜美地折磨着，全都因为那枚锁精环不肯放过你。蜡烛带来的疼痛和包裹你肉棒的挤压甜美融成了只属于你的感官世界；蒙眼让这一切更加强烈，你彻底迷失其中，只按照你的奴隶女主人所渴望的方式感受和动弹。");
            outputText("[pg]终于，在她自己高潮到你已经数不清次数之后，惠特尼大发慈悲。又一阵格外激烈的骑乘过后，她把身体压在你身上，你的 [cock " + _loc1_ + "] 也因此酸痛不已；她摆弄着覆盖在你身前、已经凝固的蜡块，而你根部那道坚硬的环扣终于被解开。她再次开始套弄你，双手紧紧攥住你的肩膀，一边让自己重新兴奋起来，任汗水滴落到你身上，沉重的呼吸在你耳边回响。");
            outputText("[pg][say: 那就来吧，娘炮，]她低声耳语。[say: 射给我看。]她的小穴无法抗拒地夹紧你那根憋到极限的肉棒；它就像一直在等待她的命令似的，立刻胀开，将一股股精液喷进那柔软、湿润、榨弄着你的体内。你的整个身体都被高潮攫住，背脊朝惠特尼弓起，因这场被压抑许久后变得无比猛烈的高潮而叫喊出声。你的精液很快又从她湿漉漉的穴里渗回到你身上，而你的肉棒仍在美妙地抽动；被束缚的身体仿佛把所有能量都凝聚到了胯间，不断把你的种子向上涌出，直到你的肉体发痛，阳具也只能徒劳地脉动。在感知的边缘，你隐约意识到惠特尼还在笑着继续骑乘你，对自己在你身上造成的反应欣喜不已。");
         }
         if(!_loc2_)
         {
            outputText("[pg]等一切终于结束，你酸痛的肉棒从她穴里滑出后，她又在你身上沉沉地压了好一会儿，双手在自己的战利品上游移片刻，最后才从你身上滑下来。你仍被铐着、蒙着眼，大口喘息，感觉自己像是漂浮在蒙眼视野里游动的群星之上。");
            outputText("[pg]在这场交欢后的恍惚余韵里，你感觉有人拿毛巾擦拭你的身体，擦掉了相当多已经凝固的蜡。随后她蜷到你身边，把一条结实的大腿压在你身上，抱着你，占有欲十足地用手抚过你的身体，让你慢慢恢复。直到这段被迫的亲昵结束后，惠特尼才终于解开你的扣具和眼罩，让你起身。你低头看向自己身前，那里红斑点点，简直像是跟一大片荨麻丛狠狠打了一架；接着你带着某种惊愕的难以置信望向罪魁祸首，那位犬女则以半阖的双眼回望着你，满脸餍足，活像完全没有半点悔意。");
            outputText("[pg]她看着你穿衣服，在你起身走向门口时恋恋不舍地叹了口气。但面对这个你亲手造就出来的家伙，你觉得一次应付一场已经差不多是身体能承受的极限了。这次遭遇留下的痕迹还会在你身上停留一阵子。");
            outputText("[pg][say:希望你确实放松下来了，[master]，]她说道。[say:准备好面对整个世界，把它压到你脚下了吗？当你需要接触真正的自己时，俺和这间屋子永远都会在这儿。]");
            get_player().orgasm("Dick");
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function whitneyDomPleasure() : void
      {
         clearOutput();
         whitneySprite();
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1161) == 0)
         {
            firstWhitneyDomPleasure();
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1161,1);
         }
         else
         {
            repeatWhitneyDomPleasure();
         }
         var _loc1_:Array = [];
         if(!get_player().isTaur())
         {
            _loc1_.push(whitneyDomBondageOral);
         }
         if(get_player().hasCock() || get_player().hasVagina())
         {
            _loc1_.push(whitneyDomStraponDoggy);
         }
         if(get_player().hasCock())
         {
            _loc1_.push(whitneyDomRide);
         }
         doNext(_loc1_[Utils.rand(int(_loc1_.length))]);
      }
      
      public function whitneyDomBondageOral() : void
      {
         clearOutput();
         whitneySprite();
         outputText("惠特尼爬到你仰躺的身体上方，双手按进你的[chest]，紧实的臀胯夹住你的腹部，打量着你。");
         outputText("[pg][say: 对，]片刻后她说道，[say: 这样就行。躺着别动。]");
         if(get_player().isBiped())
         {
            outputText("[pg]她动作很快，依次抓起固定在床架四角的皮革束带，把它们绕过你的四肢，然后用干脆而有把握的猛力一扯，将其绷紧。最多不过一分钟，你就被四肢大张地绑在床上，动弹不得。当她重新爬到你身上时，你模模糊糊地想到，在农场里大概确实能练出一手很厉害的打结技巧。");
         }
         else if(get_player().hasTailInsteadOfLegs())
         {
            outputText("[pg]很明显，她为此费了些心思。你那条又长又沉的尾巴被缠在两个床柱球头上，又用皮带固定住；另外两条皮带则把你的手腕分别绑在对应的床柱上，随着她利落而笃定的猛拽被绷得死紧。她爬回你身上时，你迷迷糊糊地想到，在农场周围大概确实能练出很厉害的打结本事。");
         }
         else if(get_player().isDrider())
         {
            outputText("[pg]很明显，她为此费了些心思。她早就在床底下系好了长长的皮带；这些皮带缠住你纤细腿肢与沉重腹部相连的位置，让你覆着几丁质的脚无助地指向天花板。另有两条皮带固定住你的手腕，随着她利落而笃定的猛拽被绷得死紧。她爬回你身上时，你迷迷糊糊地想到，在农场周围大概确实能练出很厉害的打结本事。");
         }
         else if(get_player().isGoo())
         {
            outputText("[pg][say:我没法把你正经绑好，]她喘息着，捏住你黏糊糊的身体，手指陷进其中。[say:都怪你管这团乱七八糟的东西叫身体。所以我就再说一遍。躺。好。]她抓起你毫不反抗的手腕，把它们绑到床头的床柱球头上。她爬回你身上时，你迷迷糊糊地想到，在农场周围大概确实能练出很厉害的打结本事。");
         }
         outputText("[pg]在她的膝盖滑过你耳侧之前，你有一瞬间看见了她眼中压倒一切的欲望。她纤细的大腿锁住你的脖颈，你的视野随即完全被她的小穴占据——光滑整齐的阴唇因情欲而肿胀湿润。没有预兆，没有挑逗；她只是把湿透的性器直接压到你嘴上，你的下颌和耳朵都被她臀胯间炽热紧实的肌肉吞没，柔软平坦的小腹抵上你的额头。你动不了，也看不见，连呼吸都几乎做不到；只剩她的阴户蛮横地压在你脸上，她下半身一下下顶向你的头，而你能做的只有一件事。你把嘴唇贴上她那里，将舌头探进她湿润的入口。");
         outputText("[pg]她发出一声不成词的野兽般低叫，开始对着你挺动。你舔舐她的甬道，又把舌头深深弯进她体内，她的臀胯则用力地夹紧又松开你的头。你感觉到一双温热干燥的手圈住你被困住的手腕，借力按着你；你稍稍退开，让舌头滑过她那小小的、鼓起的突点。下一刻，你立刻得到了回报——她又欢快地叫了一声，雌液直直涌进你的喉咙，呛得你咳喘不止。她仍然狠狠骑着你的脸，完全不管你的死活。");
         outputText("[pg][say:就这样，]她的声音传来。惠特尼听起来像是正处在远高于你的欢愉之上。她攥住你手臂的力道更紧了。[say:就这样！现在往上。往上！]你大概猜得到那是什么意思。你缓过来些，便把舌头深深探进她不断渗出淫液的小穴里；她立刻夹紧，将你的舌头困在里面，随即毫不客气地尽情使用起来。床铺轻快地吱呀作响，你舔弄着她紧窄的甬道，整个世界都变成了令人窒息的紧实肉壁、棕色的" + (whitneyDefurred() || get_noFur() ? "皮肤" : "毛皮") + "，以及雌性情欲的气味与味道。惠特尼的小穴收缩着裹住你的舌头，腹部拍打着你的额头，她发出一声喘不过气似的声音，又有一小股温热的汁液顺着你的下巴流下。");
         outputText("[pg]她的大腿放松下来，稍稍抬起，让你也能跟着喘口气，稍微缓过来些。你恍恍惚惚地看着她" + (whitneyDefurred() || get_noFur() ? "光滑" : "毛茸茸") + "的小腿在你周围挪动，直到她转向另一边；但直到你感觉她把双手放到你的[hips]上，你才彻底意识到——她还没打算放过你。");
         outputText("[pg][say:刚才总算消了点火，]她轻快的声音从上方飘下来。那股急切的语气已经不见，取而代之的是更慵懒、更玩闹的口吻。[say:呼！好了。我可不记得我叫你停下……]她一边说，一边沉下臀部，渗着淫液的小穴径直坐回你的嘴唇上，温热的臀瓣压住你的双眼。你发出的呻吟被她性器重新覆上来的窒息需求堵了回去。你被拉得这样紧，根本不可能挣扎，只能照她说的去做，用柔软而专注的动作让舌头滑过她灼热的褶皱，希望能取悦她。[say:就是这样。乖乖慢慢来，别急。趁你忙着这个，让我看看你下面给我藏了些什么，嗯？]你感觉她的手指轻柔地沿着你的大腿内侧向上滑去，于是闭上了眼睛。");
         if(get_player().hasCock() && !get_player().hasVagina())
         {
            outputText("[pg]她干燥而光滑的手指碰到你硬挺的[cock biggest]根部，缓缓沿着敏感的茎身向上抚去。");
            if(get_player().totalCocks() > 1)
            {
               outputText("[say:这里面还藏着这么多能玩的东西呢！]她欢快的声音再次响起，与此同时你感觉她握住了你的[cock smallest]；她轻柔而挑逗地套弄了一下，你在她肉体的包围中发出闷哼。不过很明显，你的主根肉棒才是真正吸引了她的注意，很快她的双手又都回到了它上面。");
            }
            outputText("[pg]被迫做出的粗暴口交已经让你的腰腹间热意翻涌，她的双手只是轻柔抚弄几下，便让你的阴茎完全挺立起来。你继续舔舐她湿润的性器，暂时离开她的阴唇，舔去淌出的润滑液，随后又弯回去深入其中，循着上方传来的满足声调整动作。");
            outputText("[pg]她抬起大腿，又沉沉压下，抬起，再压下，让你得以短暂呼吸片刻，随后又将她那炽热沉重的需求居高临下地压回来。与此同时，她始终抚弄着你的[cock biggest]，时而让手掌放松，时而又突然紧紧用力地套弄。她的手在你的阴茎各处游走，却尤其集中在上方三分之二处的敏感点上，反复抚过那段敏感而鼓胀的位置。天啊，太舒服了。你感觉高潮正在逼近，开始把[hips]朝那感觉顶去……惠特尼的手却突然狠狠攥住你的阴茎，差点让你一头呛进她的阴户里。");
            outputText("[pg][say:不行，]她说。语气依旧轻快又带着调笑，可底下那股冷硬的意味却让你背脊一凉。[say:在你再让我爽一次之前，你哪儿也别想去。至于现在……]她的手又开始动了，温柔而细致地揉捏、套弄着你的肉棒，直到你感觉血液再度涌起——然后她猛地攥紧，强迫你又跌回去；但也没跌多远，几秒后，折磨般的挑逗便重新开始。");
            outputText("[pg]你被困在这里，被你的奴隶女主人以可怕的熟练手法吊着不让射——你必须让她第二次高潮，否则这会把你逼疯！你带着狠劲扑向她的小穴，把身体其他部位被压抑住的灼热欲望全都倾注到舌头上，拼命舔弄她珠润的甬道，迅速舔过湿软的肉壁，随后再次转向她的阴蒂，用舌尖轻轻弹弄，再用嘴把它整个含住。");
            outputText("[pg]你高明的服侍引得她轻轻娇吟，她则以抬起下半身作为对你勤勉工作的奖励，让你能大口深吸一口气，然后又重重坐下，再次以炽热、紧绷而坚定的力道骑上你的脸。她的大腿夹住你的耳朵，你的双眼被她晃动弹跳的臀部遮住，你的整个世界缩小到你的嘴在干她、也被她所干；而她那光滑、温柔、折磨人的手指则让你永远悬在边缘，鼓胀的[cock biggest]几乎因受挫而颤鸣。");
            outputText("[pg]她的大腿几乎痛得发紧地夹住你的脖子；你更多是感觉到，而不是听见她兴奋地叫喊起来，随即使出全力骑着你的脸。你的舌头几乎被她收缩的甬道吸进去，你只能把嘴贴得更深，嘴唇抵着她鼓起的敏感小点，尽可能用力舔舐她敏感的阴道；她清亮的液体顺着你的脸颊滚落，流进你的嘴里。");
            outputText("[pg]当你把她往上顶时，她用指腹弹了你的[cockHead biggest]一下、两下，随后开始毫不停歇地用力套弄，几乎带着疼痛般的力道把它朝你被闷住的头这边拉。伴随这凶狠的动作而来的，却是汹涌的狂喜——你终于被放开，精液终于得以涌起。她的小穴裹着你的舌头痉挛起来，她大声喊叫，向下顶动并夹紧你，湿液溅落在你身上；几秒之后，你终于也被允许抵达自己的顶点，视野中仿佛有星光游动。你挺动臀部迎上去，身体陷入无助的抽搐，精液喷涌而出，回落溅在你的腹部和[hips]上。你看不见，但感觉那力道简直像能打到天花板——你憋得太久了，而惠特尼那毫不放松、光滑有力的握法又实在太棒了。");
         }
         else if(get_player().hasCock() && get_player().hasVagina())
         {
            outputText("[pg]她干燥而光滑的手指碰到你硬挺的[cock biggest]根部，缓缓沿着敏感的茎身向上抚去。");
            outputText("[pg][say:这里面还藏着这么多能玩的东西呢！]她欢快的声音再次响起，与此同时你感觉她另一只手探进你的大腿之间，碰上你[vagina]的唇瓣；她的手指滑进你的裂缝，绕着你的[clit]打转，你在她肉体的包围中发出闷哼。你被迫承受的粗暴口交已经让你的腰腹间热意翻涌，她双手对你阴茎和小穴温柔却不容忽视的摆弄没费多少工夫，就让你完全硬挺起来，也让情欲开始凝成湿润的珠液。");
            outputText("[pg]你继续舔舐她自己的湿润性器，暂时离开她的阴唇，舔去淌出的润滑液，随后又弯回去深入其中，循着上方传来的满足声调整动作。她抬起大腿，又沉沉压下，抬起，再压下，让你得以短暂呼吸片刻，随后又将她那炽热沉重的需求居高临下地压回来；与此同时，她一直抚弄着你的[cock biggest]，时而让手掌放松，时而又突然紧紧用力地套弄。她的手在你的阴茎各处游走，却尤其集中在上方三分之二处的敏感点上，反复抚过那段敏感而鼓胀的位置。");
            outputText("[pg]她另一只手探进你的女性性器，往你的[vagina]深处摸去，抚弄着你敏感的内壁，又退出来拨弄你的阴蒂；它此刻已经明显从包皮下鼓了出来。天啊，太舒服了。你感觉高潮正在逼近，开始挺起[hips]迎向那股快感……惠特尼的双手却突然狠狠握住你的肉棒，并从你的小穴里完全抽离，害你差点呛在她的小穴里。");
            outputText("[pg][say:不行，]她说。语气依旧轻快又带着调笑，可底下那股冷硬的意味却让你背脊一凉。[say:在你再让我爽一次之前，你哪儿也别想去。至于现在……]她的手又开始动了，温柔而细致地揉捏、套弄着你的肉棒，直到你感觉血液再度涌起——然后她猛地攥紧，强迫你又跌回去；但也没跌多远，几秒后，折磨般的挑逗便重新开始。");
            outputText("[pg]你被困在这里，被你的奴隶女主人以可怕的手法吊在高潮边缘——你必须让她第二次高潮，不然这折磨会把你逼疯！你带着报复般的狠劲扑向她的小穴，把身体其他部位被压抑住的灼热欲望全都用在舌头上，拼命舔弄她珍珠般的甬道，迅速舔舐那片湿软，然后又把注意力转回她的阴蒂，用舌尖轻轻弹弄，接着用嘴将它整个含住。");
            outputText("[pg]你娴熟的侍弄让她发出一声娇吟；作为对你卖力的奖赏，她再次抬起下半身，让你能大口深吸一口气，随后又重重坐下，以炽热、紧绷而坚定的力道再一次骑上你的脸。她的大腿夹住你的耳朵，晃动弹跳的臀部遮住你的视线，你的整个世界都缩小到嘴里被操弄、也用嘴操弄她的感觉；而她光滑、温柔又折磨人的手指则让你始终停在高潮边缘，鼓胀的[cock biggest]几乎因挫败而嗡鸣。");
            outputText("[pg]她的大腿几乎痛得发紧地夹住你的脖子；你更多是感觉到，而不是听见她兴奋地叫喊起来，随即使出全力骑着你的脸。你的舌头几乎被她收缩的甬道吸进去，你只能把嘴贴得更深，嘴唇抵着她鼓起的敏感小点，尽可能用力舔舐她敏感的阴道；她清亮的液体顺着你的脸颊滚落，流进你的嘴里。");
            outputText("[pg]当你把她往上顶时，她用指腹弹了你的[cockHead biggest]一下、两下，随后开始用力而不停地撸动，几乎疼得把它往你被压住的脑袋方向拉去。与此同时，你感觉她另一只手钻进你大腿交合处，重新刺入你的[vagina]，在填满你湿润小穴的同时勾弄着你的前列腺，强硬地用手指操弄你。");
            outputText("[pg]随着那猛烈的动作，汹涌的狂喜一并袭来；你终于被放过，精液终于被允许涌出。她的小穴在你的舌头周围痉挛，她叫喊着向下挺动、夹紧，将湿意洒在你身上；几秒后，你也终于被允许抵达自己的高潮，眼前星光乱闪。你挺起腰胯迎向快感，身体陷入无助的抽搐，喷射精液、涌出淫液，失控地将体液射洒出来。你看不见，但感觉自己仿佛一定射到了天花板、把床都浸透了；你就是被憋到了这种程度，而惠特尼那毫不松懈、光滑的掌握也就是这么厉害。");
         }
         else if(get_player().hasVagina() && !get_player().hasCock())
         {
            outputText("[pg]她干燥光滑的手指滑过你的丘阜，钻入你的大腿之间，碰上你[vagina]的唇瓣；当她的手指滑入你的缝隙、绕着你的[clit]打转时，你在她身体的包围中发出呻吟。刚才那粗暴的口交已经让热意沉进你的胯间，她的手只需温柔却执拗地侍弄你的小穴，你便开始渗出兴奋的湿意。");
            outputText("[pg]你继续舔舐她湿润的性器，暂时从她的阴唇移开，舔去流出来的润滑液，随后又俯身回去，顺着上方传来的满足声调整动作。她抬起大腿，又沉重地落下，抬起、落下，让你片刻得以呼吸，随后又带着不容拒绝的气势，将她滚烫而沉重的欲望压回你的脸上。");
            outputText("[pg]当她的臀胯闷住你的脸时，她的双手探进你的女性性器，一只深入你的[vagina]，抚弄你敏感的内壁，另一只则绕着你的阴蒂打圈、轻弹；它此刻已经明显从包皮下鼓了出来。天啊，太舒服了。你感觉高潮正在逼近，开始挺起[hips]迎向那股快感……惠特尼的双手却突然从你的小穴里完全抽离，一只手啪地按在你的肚子上，害你差点呛在她的小穴里。");
            outputText("[pg][say:不行，]她说。语气依旧轻快又带着调笑，可底下那股冷硬的意味却让你背脊一凉。[say:在你再让我爽一次之前，你哪儿也别想去。至于现在……]她的手又开始动了，极其轻柔地抚弄你的阴蒂，直到你感觉血液再度涌起——然后她又抽手离开，强迫你跌回去；但也没跌多远，几秒后，折磨般的挑逗便重新开始。");
            outputText("[pg]你被困在这里，被你的女同性恋奴隶女主人以可怕的手法吊在高潮边缘——你必须让她第二次高潮，不然这折磨会把你逼疯！你带着报复般的狠劲扑向她的小穴，把身体其他部位被压抑住的冲动全都用在舌头上，拼命舔弄她珍珠般的甬道，迅速舔舐那片湿软，然后又把注意力转回她的阴蒂，用舌尖轻轻弹弄，接着用嘴将它整个含住。");
            outputText("[pg]你娴熟的侍弄让她发出一声娇吟；作为对你卖力的奖赏，她再次抬起下半身，让你能大口深吸一口气，随后又重重坐下，以炽热、紧绷而坚定的力道再一次骑上你的脸。她的大腿夹住你的耳朵，晃动弹跳的臀部遮住你的视线，你的整个世界都缩小到嘴里被操弄、也用嘴操弄她的感觉；而她光滑、温柔又折磨人的手指则让你始终停在高潮边缘，鼓胀的[clit]几乎因挫败而嗡鸣。");
            outputText("[pg]她的大腿几乎痛得发紧地夹住你的下颌；你更多是感觉到，而不是听见她兴奋地叫喊起来，随即使出全力骑着你的脸。你的舌头几乎被她收缩的甬道吸进去，你只能把嘴贴得更深，嘴唇抵着她鼓起的敏感小点，尽可能用力舔舐她敏感的阴道；她清亮的液体顺着你的脸颊滚落，流进你的嘴里。");
            outputText("[pg]当你把她往上顶时，她用指腹弹了你的[clit]一下、两下，随后将另一只手的手指重新刺入你的[vagina]，勾弄着你的敏感点，同时进攻你的阴蒂，强硬地用手指操弄你。随着那猛烈的动作，汹涌的狂喜一并袭来；你终于被放过，高潮终于被允许涌出。她的小穴在你的舌头周围痉挛，她叫喊着向下挺动、夹紧，将湿意洒在你身上；几秒后，你也终于被允许抵达自己的高潮，眼前星光乱闪。你挺起腰胯迎向快感，身体陷入无助的抽搐，失控地喷出淫液。你看不见，但感觉自己一定把床都浸透了；你就是被憋到了这种程度，而惠特尼那毫不松懈、光滑的手指也就是这么厉害。");
         }
         outputText("[pg]只要你还在喷射和滴淌");
         if(get_player().hasCock())
         {
            outputText("精液");
         }
         else
         {
            outputText("淫液");
         }
         outputText("，她就强硬地在你身上冲撞不止；直到在你脸上沉沉放松了好一会儿，她才终于从你身上滑下来。你仍被铐在床上，剧烈喘息着，淫液细流顺着你的脸淌下，你的舌头和");
         if(get_player().hasCock())
         {
            outputText("[cock biggest]");
         }
         if(get_player().hasCock() && get_player().hasVagina())
         {
            outputText("和");
         }
         if(get_player().hasVagina())
         {
            outputText("[vagina]");
         }
         outputText("酸胀不已，还在渗出淫液。做爱后的深沉恍惚中，你感觉有人拿毛巾擦拭你的身体，随后蜷身贴了上来，把一条结实的大腿搭在你身上，占有欲十足地抱住你、抚摸着你，陪你慢慢缓过来。");
         outputText("[pg]直到这段被迫的亲昵拥抱结束后，惠特尼才终于解开你的扣具，让你起身。她带着眼帘低垂的满足感看着你穿衣服；当你站起来朝门口走去时，她又恋恋不舍地叹了口气。但面对这个由你一手造就出来的家伙，一次一场已经差不多是你身体所能承受的极限了。");
         outputText("[pg][say:希望你确实放松下来了，[master]，]她说道。[say:准备好面对整个世界，把它压到你脚下了吗？当你需要接触真正的自己时，俺和这间屋子永远都会在这儿。]");
         get_player().orgasm("Generic");
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function whitneyDom() : Boolean
      {
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1122) == 1)
         {
            return true;
         }
         return false;
      }
      
      public function whitneyDefurred() : Boolean
      {
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1121) == 1)
         {
            return true;
         }
         return false;
      }
      
      public function whitneyCorruption(param1:int = 0) : int
      {
         var _loc2_:* = null as IMap;
         if(param1 != 0)
         {
            _loc2_ = KFLAGS.flags;
            FlagDict_Impl_.arrayWriteInt(_loc2_,1078,FlagDict_Impl_.arrayReadInt(_loc2_,1078) + param1);
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1078) > FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1112))
            {
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1112,FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1078));
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1114) == 0 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1078) > 30)
         {
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1078,30);
         }
         else if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1115) == 0 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1078) > 60)
         {
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1078,60);
         }
         else if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1118) == 0 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1078) > 90)
         {
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1078,90);
         }
         else if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1119) == 0 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1078) > 119)
         {
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1078,119);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1078) < 0)
         {
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1078,0);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1078) >= 120)
         {
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1078,120);
         }
         return FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1078);
      }
      
      public function whitneyCorrupt() : Boolean
      {
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1095) > 0)
         {
            return true;
         }
         return false;
      }
      
      public function whitneyCockArea() : Number
      {
         return 20;
      }
      
      public function whitneyAppearanceNotCorrupt() : void
      {
         clearOutput();
         whitneySprite();
         outputText("惠特尼是个身高5英尺8英寸的犬" + (get_noFur() ? "女" : "兽人") + "，穿着一件朴素的棉质衬衫和一条褪色长裙，裙子上开了个洞，好让她那条短短的翘尾巴伸出来。" + (get_noFur() ? "" : "她的口吻让人想到金毛寻回犬，不过实际上她可能是任何犬种。她的毛皮是沙色的，四肢末端逐渐转为黑色。") + "她的" + (get_noFur() ? "下垂的犬耳呈沙褐色，耳尖逐渐转为黑色" : "耳朵下垂着") + "，眼睛是深棕色，和她齐肩的头发颜色相称。她早已过了青春洋溢的年纪，不过一眼就能看出她从未生育过；多年农活让她的身体变得结实，但她的身形依旧相对纤细，臀部和屁股只是因肌肉而变宽，小巧的乳房在不起眼的工作服下依然挺翘。她有一个肛门，安安稳稳地藏在紧实的臀瓣之间。");
         menu();
         dogeNotCorruptYetMenu();
      }
      
      public function whitneyAppearanceCorrupt() : void
      {
         clearOutput();
         whitneySprite();
         outputText("惠特尼是个身高5英尺8英寸的犬");
         if(whitneyDefurred() || get_noFur())
         {
            outputText("女。" + (get_noFur() ? "" : "她的人类化变形让她呈现出一种精致而羞怯的美。"));
         }
         else
         {
            outputText("兽人。她的口吻让人想到金毛寻回犬，不过实际上她可能是任何犬种。");
         }
         if(whitneyMaxedOralTraining())
         {
            outputText("与她整体偏瘦的五官形成鲜明对比的是，她的嘴唇丰满而漆黑，像湿润的焦油一样发亮。她总会无意识地用舌头舔过双唇。");
         }
         outputText("尽管她依旧穿着一贯那种朴素的棉质衬衫和长裙，裙子上也照旧开了洞，好让她那条短短的翘尾巴伸出来，但衣服的剪裁，以及她因欲火和近乎持续不断的性压抑而躁动难耐、摆动身体的方式，却让这套端庄衣装显得比任何恶魔能想出来的打扮都更加下流。\n");
         if(whitneyHasTattoo())
         {
            if(numTattoos("whitney") > 1)
            {
               outputText("\n她身上烙有以下纹身：\n");
            }
            else
            {
               outputText("\n她有");
            }
            if(1129 in KFLAGS.flags.h)
            {
               outputText(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1129) + "\n");
            }
            if(1130 in KFLAGS.flags.h)
            {
               outputText(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1130) + "\n");
            }
            if(1131 in KFLAGS.flags.h)
            {
               outputText(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1131) + "\n");
            }
            if(1132 in KFLAGS.flags.h)
            {
               outputText(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1132) + "\n");
            }
         }
         outputText("\n");
         if(!whitneyDefurred() && !get_noFur())
         {
            outputText("她的毛皮是沙色的，四肢末端逐渐转为黑色");
         }
         else
         {
            outputText("她的皮肤呈沙色，指甲涂着黑色甲油");
         }
         outputText("。她的耳朵下垂着，眼睛是深棕色，和她齐肩的头发颜色相称，如今其中又染上了深沉而赤红的欲望。尽管她早已过了青春柔嫩的年纪，不过一眼就能看出她从未生育过；多年农活让她的身体变得结实，但她的身形依旧相对纤细，小巧的乳房在不起眼的工作服下依然挺翘。她有一个肛门，就在紧实的臀瓣之间它该在的位置。");
         menu();
         dogeCorruptedMissionComplete(false);
      }
      
      public function wantOrgyRoom() : void
      {
         clearOutput();
         whitneySprite();
         outputText("[say: [Master]，] 惠特尼跪在你面前后，结结巴巴地说道。[say: 我可以提个建议吗？] 你漫不经心地耸耸肩。[say: 嗯……只是你经常一副很疲惫的样子来到这儿，像是……在外面的荒原上跟恶魔、龙什么的打架，不管你到底在做什么。那一定很重要吧，因为你总是弄得遍体鳞伤。更别说你还得照看……你的牲口……] 她闭上眼，深深叹了口气。");
         outputText("[pg]沉默拖得有些久，你不耐烦地挪了挪[legs]。[say: 嗯，我也只能按农夫的见识来说。可要是我有一匹上等的" + get_player().mf("种马","母马") + "，老是把自己折腾得那么狠——很多时候还不是我逼的，是它们自己非要逞强；它们就是那么高大，那么强势，一刻都不肯停下——那就会落下劳损。它们越是假装没事，伤就越会恶化。我不是说你一定也有那样的问题，可我看你每次来这儿，气势汹汹又焦躁不安，然后又急匆匆地离开……我心里真有点难受。因为我能帮你，至少能帮上一点。一辈子照料牲畜，总会懂些肌肉和药理的东西。我可以帮你别变成那种在打斗中突然栽倒、惨叫着说腿筋废了的[guy]。]");
         outputText("[pg]你精明地看着她。她从头到尾都没把手从膝盖上移开，也没试着碰你，或展示她到底能做些什么。你问她真正想提议的是什么。");
         outputText("[pg][say: 我想让你真的舒服起来，[master]，] 她热切地说道。[say: 所以，如果你给我2,200颗宝石……]");
         outputText("[pg][say: 2,200颗宝石？！]");
         outputText("[pg][say: ……我就能把前厅改成专门给你用的放松室，] 这名犬女固执地继续说道。[say: 里面会有我好好照料你所需要的一切。比如热水浴池。然后我还会把各种东西都准备好……] 她又梦幻般地叹了口气，[say: 各种这片土地上高大强壮的[lord]会想要的东西。尤其是在[he]照料[his]仆从的时候。比如很多个仆从。同时一起。]");
         menu();
         var _loc1_:String = "否";
         if(get_player().get_gems() >= 2200)
         {
            addButton(0,"是",getOrgyRoom);
         }
         else
         {
            _loc1_ = "太贵了";
         }
         addButton(1,_loc1_,noOrgyRoomPlz);
      }
      
      public function vapulaTribalTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "一片部落风纹身，尽是蜿蜒而色情的线条，横跨她的";
         if(param1 == 0)
         {
            vapulaCollarboneIntro();
            outputText("[pg][say: 真俗气，]你结束后，她打了个哈欠说道。[say: 我可能得开始穿衣服了。]不过，从她唇边勾起的笑意，以及她抚摸那图案的样子来看，你看得出她其实暗自很满意。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1149,_loc2_);
         }
         else if(param1 == 1)
         {
            vapulaShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1150,_loc2_);
         }
         else if(param1 == 2)
         {
            vapulaLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1151,_loc2_);
         }
         else if(param1 == 3)
         {
            vapulaButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1152,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function vapulaSlotSelect() : void
      {
         slotSelectMenu("vapula",vapulaBrandSelect);
      }
      
      public function vapulaShouldersIntro() : void
      {
         outputText("你命令她背对着你跪下，不许乱动。你的魅魔照做了，一动不动地待着；你把手指蘸进墨水，小心地在她身上画下图案，然后用纸将其封上。");
         outputText("[pg][say: 那就让我看看吧，]她叹了口气，指尖火花四溅，魔法在她手中凝成一面镜子，对准自己的后背。[say: 啊。很不错，[name]。我很期待下次你再用那些粗鄙到极点的想法和工具，来毁坏我这具完美身体的时候。]你暗示她，下次你干脆在她脸上画一根巨大的鸡巴，这倒是把她逗笑了。");
      }
      
      public function vapulaPropertyOfTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"[Name]的所有物\"纹在她的";
         if(param1 == 0)
         {
            vapulaCollarboneIntro();
            outputText("[pg][say: 还真是把明摆着的事说出来了啊，[master]，]她低头瞥了一眼后，翻着白眼叹了口气。不过看她唇边勾起的笑，以及轻抚那些字的样子，你看得出来，这个荡妇其实暗自很喜欢它。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1149,_loc2_);
         }
         else if(param1 == 1)
         {
            vapulaShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1150,_loc2_);
         }
         else if(param1 == 2)
         {
            vapulaLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1151,_loc2_);
         }
         else if(param1 == 3)
         {
            vapulaButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1152,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function vapulaLowerBackIntro() : void
      {
         outputText("你命令她脸朝下趴在你的[legs]上，就像马上要挨一顿屁股似的。你的魅魔照做了；当你把手指蘸进墨水，在她身上仔细画下图案，再用纸封住墨迹时，她那故作委屈的叹息也变成了一声尖促的咕鸣。");
         outputText("[pg][say:那就让我看看吧，]她说道，指尖迸出火花，魔法般在手中凝成一面镜子，对准自己的背。[say:啊，很不错，[name]。我很期待下一次，你再用你那些粗劣到不可思议的想法和工具来糟蹋我完美的身体。]");
         outputText("[pg]你暗示她，下次你会直接在她脸上画一根巨大的鸡巴，这倒是把她逗笑了。");
      }
      
      public function vapulaHeartTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "一枚饱满的红色爱心纹身，位于她的";
         if(param1 == 0)
         {
            vapulaCollarboneIntro();
            outputText("[pg][say: 真俗气，]你结束后，她打了个哈欠说道。[say: 我可能得开始穿衣服了。]不过，从她唇边勾起的笑意，以及她抚摸那图案的样子来看，你看得出她其实暗自很满意。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1149,_loc2_);
         }
         else if(param1 == 1)
         {
            vapulaShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1150,_loc2_);
         }
         else if(param1 == 2)
         {
            vapulaLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1151,_loc2_);
         }
         else if(param1 == 3)
         {
            vapulaButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1152,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function vapulaFullTribalTats() : Boolean
      {
         if(numVapulaTribalTats() == 4)
         {
            return true;
         }
         return false;
      }
      
      public function vapulaDildoPolisherTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"假阳具清洁工\"纹在她的";
         if(param1 == 0)
         {
            vapulaCollarboneIntro();
            outputText("[pg][say: 还真是把明摆着的事说出来了啊，[master]，]她低头瞥了一眼后，翻着白眼叹了口气。不过看她唇边勾起的笑，以及轻抚那些字的样子，你看得出来，这个荡妇其实暗自很喜欢它。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1149,_loc2_);
         }
         else if(param1 == 1)
         {
            vapulaShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1150,_loc2_);
         }
         else if(param1 == 2)
         {
            vapulaLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1151,_loc2_);
         }
         else if(param1 == 3)
         {
            vapulaButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1152,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function vapulaCumAddictTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"精液成瘾者\"纹在她的";
         if(param1 == 0)
         {
            vapulaCollarboneIntro();
            outputText("[pg][say: 还真是把明摆着的事说出来了啊，[master]，]她低头瞥了一眼后，翻着白眼叹了口气。不过看她唇边勾起的笑，以及轻抚那些字的样子，你看得出来，这个荡妇其实暗自很喜欢它。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1149,_loc2_);
         }
         else if(param1 == 1)
         {
            vapulaShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1150,_loc2_);
         }
         else if(param1 == 2)
         {
            vapulaLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1151,_loc2_);
         }
         else if(param1 == 3)
         {
            vapulaButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1152,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function vapulaCollarboneIntro() : void
      {
         outputText("你命令她跪在你面前，一动也别动。那只魅魔照做了，安安静静地保持不动。你把手指蘸进墨水，小心翼翼地在她身上画下图案，然后用纸将其封定。");
      }
      
      public function vapulaButtslutTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"屁眼荡妇\"纹在她后腰上，周围还围着一颗红色爱心。";
         vapulaLowerBackIntro();
         FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1151,_loc2_);
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function vapulaButtIntro() : void
      {
         outputText("你命令她趴到你的[legs]上，就像准备挨一顿屁股似的。你的魅魔照做了；你把手指蘸进墨水，仔细地在她身体最柔软的部位画下图案，她那委屈的叹息也变成了一声尖细的低吟，随后你用纸将图案封印上去。");
         outputText("[pg][say: 那就让我看看吧，]她说着，指尖迸出火花，施法在手中变出一面镜子，对准自己的屁股。[say: 啊。真不错，[name]。我很期待下次你再用你那些粗糙得离谱的点子和工具，糟蹋我这具完美的身体。]");
         outputText("[pg]你暗示她，下次你会直接在她脸上画一根巨大的鸡巴，这倒是把她逗笑了。");
      }
      
      public function vapulaBrandSelect(param1:int) : void
      {
         var slot6:int;
         var _g5:FarmCorruption;
         var slot5:int;
         var _g4:FarmCorruption;
         var slot4:int;
         var _g3:FarmCorruption;
         var slot3:int;
         var _g2:FarmCorruption;
         var slot2:int;
         var _g1:FarmCorruption;
         var slot1:int;
         var _g:FarmCorruption;
         clearOutput();
         outputText("你要在她的" + slotNames[param1] + "上画什么？");
         menu();
         _g = this;
         slot1 = param1;
         addButton(0,"部落纹",function():void
         {
            _g.vapulaTribalTattoo(slot1);
         });
         _g1 = this;
         slot2 = param1;
         addButton(1,"爱心",function():void
         {
            _g1.vapulaHeartTattoo(slot2);
         });
         _g2 = this;
         slot3 = param1;
         addButton(2,"专属",function():void
         {
            _g2.vapulaPropertyOfTattoo(slot3);
         });
         _g3 = this;
         slot4 = param1;
         addButton(3,"精液成瘾",function():void
         {
            _g3.vapulaCumAddictTattoo(slot4);
         });
         if(param1 == 2 || param1 == 3)
         {
            _g4 = this;
            slot5 = param1;
            addButton(4,"屁眼荡妇",function():void
            {
               _g4.vapulaButtslutTattoo(slot5);
            });
         }
         if(!get_player().hasCock())
         {
            _g5 = this;
            slot6 = param1;
            addButton(5,"假阳具抛光师",function():void
            {
               _g5.vapulaDildoPolisherTattoo(slot6);
            });
         }
         addButton(14,"返回",vapulaSlotSelect);
      }
      
      public function vaginaOralTrainingStageTwo() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你一言不发地解开自己的[armor]，带着柔和的微笑露出全身。无需任何指示，惠特尼便开始行动，她的手探进内裤里，满足地叹了口气，目光专注在眼前的任务上，同时用纤细身体紧促而急切的抽动，稳定地点燃自己胯间的热意。");
         outputText("[pg]她按照你早已命令过的那样开始，抱住你的腰，舔舐你的[chest]。她闭着眼，温热湿润的舌头无声地在你的柔软上滚动、探索，把每一寸都涂上唾液，再将你的每一颗[nipples]含入口中，细致地吮吸舔弄。这个过程美妙而感官十足");
         if(get_player().lactationQ() > 0)
         {
            outputText("，这很快让你胸中的液态暖意涌到顶点，乳汁从你的乳头自由地凝成珠滴。惠特尼急切地舔吮吞下，但令人满意的是，她记得你的命令，只吸了一口便不情愿地停了下来");
         }
         outputText("，只留下你的乳头");
         if(!get_player().hasFuckableNipples())
         {
            outputText("坚硬如石，并且");
         }
         outputText("泛着光泽，而你的[vagina]也急切地渗出珠液。");
         outputText("[pg]接着她跪了下来，一边继续把自己弄得兴奋不已，一边将滚烫的小手指滑进你的大腿之间，找到你的[vagina]后慢慢玩弄起来。她用一根柔软的手指勾弄你的[clit]，另一根则深深探入你的甬道，在你的女性私处里轻柔地来回滑动、打着转，凭着细致而撩人的动作，将那里弄得肿胀湿润。");
         outputText("[pg]当你因她对你雌性性器的服侍而发出满意的呻吟时，她俯下身，把舌头探入你湿润、吮吸般收缩的温暖之中。她开始动作，让你轻轻叹息起来；她舔舐你的入口，舌尖在你的小穴里探索、卷动，而她结实的手指仍在继续挑弄她自己和你。那种生涩感再次隐约浮现——她有时会太投入于舔弄你，忘了你的阴蒂，于是你不得不低声提醒她集中注意。");
         outputText("[pg]即便如此，那股近乎崇拜般淹没你胯间的快感也几近高明，让你不由得沉醉其中，闭上双眼，忘了发号施令，完全迷失在你的母狗那轻柔、准确而陶醉的动作浪潮里，耳边充满她的叹息与啜舔声。当你的高潮开始酝酿，在奴隶温热的崇拜下被如此美妙地点燃时，你几乎已经飘得太远，差点没能下达命令。然而随着热意升腾，你懒懒地低头一看，对上那双正仰望着你的深情棕眼，才想起来……");
         outputText("[pg][say: 我要去了。]你勉强说出这句话，闭上眼，把自己彻底交给快感。你听见惠特尼闷在嘴里的呻吟；你的身体绷紧，小穴收缩，阴蒂跳动，随即在无法抑制的高潮中猛地挺进她的嘴和手里");
         if(get_player().wetness() >= 5)
         {
            outputText("，把淫液喷泉般灌进她的喉咙");
         }
         outputText("。她在你身下发抖，眼睛翻起，手指在自己的小穴里摸索着，也迎来了自己的巅峰。让你极为满意的是，尽管她已经沉浸在比你更高处的顺从快感之中，她仍然设法吞下了你喷进她口中的每一滴润液。阴蒂与阴道同时高潮的感觉让你仰起脖颈");
         if(get_player().wetness() >= 5)
         {
            outputText("，一次又一次用温热的女性奖赏将她浸透");
         }
         outputText("。");
         outputText("[pg]当你最后一次绷紧身体后，你带着极乐的叹息，飘飘然沉入被舔弄后的迷离余韵；你闭上眼睛，惠特尼不用你吩咐，便用平坦的舌头清理你的小穴，让舌尖在你湿透的阴道周围美妙地搜寻，把她在你阴唇和大腿内侧找到的每一缕淫液都舔净，还一边哼着声，温柔地安抚着你。");
         outputText("[pg][say: 你享受吗，女主人？]她的声音里带着一点发飘的意味。她看上去有些醉意，瞳孔放大。[say: 我想我——我想我掌握了。]她已经相当熟练了，但你本能地知道，她还没有达到自己真正能做到的程度。");
         outputText("[pg]你注视着她的眼睛，告诉她她做得很好——但最优秀的小穴奴隶永远不会停止寻找让自己更进一步的方法。你的犬女微微皱起眉头，接受了这一点。");
         outputText("[pg][say: 我、我明白，女主人。下次一定会比以往都好！]");
         get_player().orgasm("Vaginal");
         dynStats(DynStat.Sens(-1));
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function vaginaOralTrainingStageThree() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你看着跪在面前的犬女，露出一抹坏笑，任由沉默慢慢拉长。她几乎按捺不住期待地望着你，不停用舌头舔过嘴唇，短短的尾巴一下下抽打着裙摆，而你则慢条斯理地脱下[armor]下半部分。和之前一样，你的动作慢得近乎折磨；你细细品味着身下传来的压抑呻吟与呜咽。");
         outputText("[pg]当你终于坐定，露出你的[vagina]时，惠特尼最后一点安静端坐的克制也崩溃了。她毫不掩饰地喘息着，舌头垂在外面，贪婪地盯着那让她彻底沦陷的东西。你让一只手沿着身体前侧游走，触到一颗[nipple]时梦呓般叹息，接着手指一路下滑；当一根手指刺入你的[vagina]时，你忍不住轻喘一声，那里已经因即将发生的一切而闪着湿光。空气中弥漫着你浓重的体香。");
         outputText("[pg][say: 天啊……]惠特尼呻吟着，目光无法移开，同时重重咽了口口水。");
         outputText("[pg][say: 我不确定你配不配得上这个。]你说道。你一边缓缓抚弄自己，内心为眼前这番辛苦调教的成果而得意，表面上却只显出一丝淡淡的轻蔑。[say: 上一次你连伺候我一半都没做到，就像个婊子一样把内裤弄湿了。我为什么要把侍奉我美丽身体的任务交给这么没用的荡妇？]");
         outputText("[pg][say: 求您了，女主人，]惠特尼说道。她想尽量让声音保持平稳，可嘴里分泌了那么多口水，这实在很难。她用力咽了咽，才继续说道：[say: 我会乖的。我做得到。是您告诉我我可以的，我本来以为自己不行，但现在我——我知道我可以。我……真的很需要这个……]");
         outputText("[pg][say: 嗯，]你若有所思地沉吟。[say: 好吧。如果你想享用我赐给你的东西，如果你想当我的女仆母狗，除了用舌头把我的小穴、乳房和屁股伺候得光洁漂亮之外别无所求，一边喝下我的淫液一边呻吟着高潮，那你就得开口求我。好好地求。]");
         outputText("[pg][say: 是！]那条尾巴摇得更厉害了。");
         outputText("[pg][say: 很好。把双手伸到面前，弯起来。背挺直。很好。现在跟我说：求您了，大小姐，我可以舔您的小穴吗？]");
         outputText("[pg][say: 求您了大小姐我可以舔您的小穴吗，]惠特尼急切地说道，话语都黏在了一起。她在你面前乞求时，那双深情又饥渴的眼睛始终没有离开你。你向后靠去，慢慢花时间考虑。");
         outputText("[pg][say: 很好，]你冷淡地说道。[say: 不过下次要说得更清楚。开始吧。]");
         outputText("[pg]她贴上你的腹部时，整个人都散发着热意，嘴唇压在你的[chest]上。她闭着眼，温热如绒布般的舌头无声地在你的柔软上滚动、探寻，把每一寸都涂上唾液，时不时用牙齿轻轻叼住你的皮肤，让血色恰到好处地浮上表面，只为让你更加享受她的舔舐；");
         if(!get_player().hasFuckableNipples())
         {
            outputText("她把你的每一颗[nipples]含入口中，贴近地吮吸舔弄");
         }
         else
         {
            outputText("她的舌头探向你每一颗小穴乳头，舔舐卷弄那敏感的粉色，直到它们因渴求而湿润");
         }
         outputText("。这个过程美妙而撩人。");
         if(get_player().lactationQ() > 0)
         {
            outputText("这很快让你乳房里的温热液体涌向顶端，乳汁从乳头上自由地凝珠滴落。惠特尼急切地舔舐、吮吸着它们，每喝下一口就呜咽着退开。你柔柔一笑，知道这点浅尝辄止的甜味只会让她更加饥渴。");
         }
         outputText("她向下沉去，离开你的乳头");
         if(get_player().hasFuckableNipples())
         {
            outputText("坚硬如石，并且");
         }
         outputText("闪闪发亮，你的[vagina]也迫不及待地渗出湿意。");
         outputText("[pg]你柔软而蜿蜒地俯到她上方，回头望着她，脸上挂着冷淡的坏笑，将你的[butt]展示给她看。");
         outputText("[pg][say: 它不像我的胸部那样常有出场机会，]你低声说道。[say: 但这可不是女仆娼妇偷懒的借口，对吧？去吧。]片刻停顿后，惠特尼的舌头探进你臀缝的上端，一路向下滑去，舔弄你的[asshole]。她对这里还很陌生，但做得相当不错，反复舔舐着你的菊口，直到那里变得柔软而湿润，充满感官的愉悦；她一路向下舔到你的[vagina]边缘，又将舌头抚过你的臀肉，让你的整个[ass]都像被温暖的崇拜润滑过一般闪闪发亮。不过这感觉对你来说已经足够舒服了，你低声咯咯笑着，扭动臀部，确保她把每一寸都照顾到。");
         outputText("[pg]娇小的犬娘急切地抓住你的[hips]，轻轻喘息着。最后，你转过身，让她靠近你的[vagina]。她用一根柔软的手指逗弄你的[clit]，另一根则深深没入你的甬道，轻柔地在你的女性性器内外滑动，细致而挑逗的动作让那里肿胀湿润。当你对她侍弄你女性性器的手法发出认可的呻吟时，她俯下身，把舌头探进你湿润、吮吸般温热的深处。她开始动作，你轻叹一声；她舔弄着你的入口，探索并卷入你的阴道，同时结实的手指还继续拨弄着她自己和你。");
         outputText("[pg]她如今已经很擅长了，精准地压向你褶皱中那些她知道会让你滴水、抽颤的位置，交替侍弄你的[clit]和[vagina]：前一刻还用力弹弄你的小核，同时用舌尖轻轻点弄你的入口；下一刻又深深舔入你的甬道，卷弄你的敏感点，而手指只是温柔地停在你的阴蒂周围。最后，她完全放弃了手指，像你教过她的那样用双手勾住你的臀部，用温暖湿润的崇拜舔遍你的小穴。她断断续续发出的呻吟穿过你的性器，与那里早已脉动的深沉快感交织在一起，你发现自己渐渐沉溺其中，闭上眼睛，忘记了指导，完全迷失在你的母狗柔软、精准而狂喜的动作浪潮里，耳边充满她的叹息和吮舔声。");
         outputText("[pg]你紧盯着在你下方不断点头侍奉的奴隶，但其实完全没这个必要。她现在清楚自己在做什么，嘴上的每一个动作都被精准地引导着，让丰沛的快感与浓重的热意在你胯间脉动。对你做这种事，带给她的愉悦或许比你从中得到的还要多。她一边把嘴埋进你的柔软处，一边呻吟、喘息，几乎像那是她的第二个阴道，而你正在与它交融；她深陷在你早已植入她内心深处的、腐化而纠缠的服从冲动之中。");
         outputText("[pg]你欣赏着娇小娼妇对你身体的崇拜，露出笑容。要是把她的嘴变成一个漂亮湿润的小穴，那倒也有意思，不是吗？这肯定会帮助她完成你训练她为你身体涂抹润滑的工作。好吧，你还做不到那个，不过……当她用流动的湿润包裹住你的[clit]，轻轻吮吸拉扯时，你发出一声呻吟……你觉得，为了她如此刻苦的学习，她确实值得得到一点认可的标记。");
         outputText("[pg]你抓住这些念头，将黑暗的力量注入其中；淹没你性器的快感强度不断攀升，你用[hips]把她的脑袋牢牢锁在你湿透的性器里，开始以沉重的顶弄使用她的嘴。你努力保持清醒，俯视着这只犬女；你狠狠撞进她湿润的嘴里，她愉悦地呜咽着，夹紧你的大腿，等待着你的淫液。若说她现在还有什么不足，那就是她那双相当单薄、苍白的嘴唇。没有哪个舔小穴的勇者会长着那样的嘴唇——它们应该又大又肿，像被蜜蜂蜇过一样，总是随着饥渴舌头的动作湿漉漉的。那该是丰润的娼妇唇垫，值得滑过你身体的每一寸。你将这些多汁而邪恶的念头深深推入自己的胯间，推入那里不可阻挡地积聚起来的热意深处。");
         outputText("[pg]你这样使用她时，她发出深沉的呻吟；即便你正用下体操弄她的脸，她也依旧做得恰到好处，在你向内挺入时将舌头刺入你的深处，又美妙地滑回你的入口，在你抽离时用她那布料般柔软肌肉的根部抵住你的阴蒂。你在金色而狂喜的高潮中腾飞，已经找不到任何言语；你仰起头，尽可能把自己埋进她口中，额头沁出汗珠，放声喊叫着在她舌头上乘着高潮起伏，同时阴蒂与小穴一同抵达顶峰的感觉让你弓起脖颈");
         if(get_player().wetness() >= 5)
         {
            outputText("，用温热的雌性认可一次又一次浸湿她的嘴和脸");
         }
         outputText("。");
         outputText("[pg]你下方传来一连串尖细而窒息的 squeal，她的身体在你周围颤抖；不用看你也知道惠特尼也高潮了，纯粹是因为她以垂涎的欢喜吞下女主人注入她口中的、每一滴麝香般的果实。她忽然震惊地倒吸一口气，你立刻低头看去。她的嘴唇看起来肿了起来，而且似乎正在变暗。你因狂喜而低吼着，继续使唤她的舌头，用力把[hips]撞向她的脸；这赤裸裸展现出的腐化力量让你重新涌起力气。你每一次把雌性的汁液滴落到她唇上，她的嘴唇就更肿、更黑一点；在你狂乱的操弄下，它们丰满起来，开始泛起湿润而深不见底的黑亮，她的眼睛也随之翻白。最终，你再也给不了她更多，只能踉跄着向后退去，强烈的余韵让眼前星光乱舞。你带着幸福的神情叹息，漂浮在舔阴后的高处与无形的迷雾中，听着惠特尼慢慢恢复自己的意识。");
         outputText("[pg][say: 女、女主人，您对我做了什么？我的嘴……它好——]一声细小而湿润的声响，随即是急促的吸气。片刻之后，你感觉到双手环住你的[hips]，那湿润的丰满压上你正沁出水珠的[vagina]。");
         outputText("[pg]你或许没有给她第二个阴道，但很快就显而易见：她那双全新、丰满的黑色嘴唇几乎同样敏感，至少用在你身上时是如此。惠特尼清理你的性器时，不只是满足地叹息，让嘴唇抚过你跳动的阴部；她像个娼妇一样呻吟，屁股高高翘起，让舌头带着你汁液的味道，在她新生的“小穴唇垫”周围推挤游走，然后又探回你高潮过后的[vagina]里，寻找每一丝残留的液体。你闭上眼睛，享受她新嘴唇在你胯间带来的愉悦触感；她搜寻你麝香味的最后一点痕迹，用一连串深长的呼气将其舔入口中，那气息深得仿佛你不是只是躺在那里，而是在给她世上最令人神魂颠倒的性爱。");
         outputText("[pg]也许只是你的错觉，但她现在似乎分泌出了更多唾液，而且不仅如此，那唾液还带着极其轻微的黏着感和油滑质地。在她让你的小穴更加酸胀之前，你把她拉开，将她结实娇小的身体按进你的[chest]里，懒洋洋地低头看着她。她眼中那压倒性的渴求已经稍稍平息了一些，但它如今永远不会真正离开她了。她不仅是舔小穴的勇者，还已经对你上瘾，并且完美地配备好了让你充分利用这两种特质。");
         outputText("[pg][say: 我——]她低声说道，舔了舔自己丰润的黑色嘴唇。[say: 我想我现在学会了，夫人。]");
         outputText("[pg]你自豪地对她灿然一笑，然后揉了揉她耳后、拍了拍她的屁股，默默让你的女管事娼妇晕乎乎、踉踉跄跄地离开。");
         get_player().orgasm("Vaginal");
         dynStats(DynStat.Sens(-1));
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function vaginaOralTrainingStageOne() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你叹了口气，脱下[armor]的下半身，对她笑着说又该上另一堂课了。惠特尼一看到你的[vagina]，就不安地绞着" + (whitneyDefurred() || get_noFur() ? "双手" : "爪子") + "。你不觉得她是不愿意；她只是害怕自己会做得不好。所以你的指示温和而耐心。你让她看着你裸露的胯间，先重新摸弄自己，等她似乎稍微放下焦虑后，你才让她开始舔。");
         outputText("[pg]接下来半个小时偶尔令人沮丧，但最终还是令人满意。她似乎怎么也改不掉本能，总是像舔自己的胯间一样舔舐你的阴部；虽然那感觉也挺舒服，看起来也相当好笑，但你必须相当坚定地指示她，才能让她真正探入你体内，取悦你的甬道。她在一心多用上有点问题，有时太专注其中一边，就会停下拨弄自己的阴蒂，或者停下舔你的小穴。");
         outputText("[pg]你知道以后让她同时处理不止一件事会很重要，所以你尽可能严厉地要求她把这件事做好；甚至在她沉迷于拨弄自己的小豆、又一次忘了你时，你会让她退开并扇她一巴掌。你并不喜欢这么做，因为被训斥的狗女孩看起来实在令人心碎，但该做的还是得做。不过她已经掌握了基本要领；她已经牢牢记住，在伺候完你之前，绝不能让自己先爽到。于是她一边让自己停在边缘，一边用柔软的嘴在你湿热的深处内外动作，发出叹息与呻吟。");
         outputText("[pg]令人沮丧的是，她似乎仍然没有意识到你的[clit]有多重要，只是草草舔上一两下。但当她深入你体内时，那种来回摩擦的感觉相当不错；尽管你还得慢慢告诉她该怎么做，你的欲火仍然一点点被推成烈焰，让你抛开言语，抓住她的头，开始用力把她顶向你湿透泛红的深处。她对此依旧有些挣扎，但两次推送之后，她就学会了放松嘴巴，让舌头扭进你的甬道。你挺直背，带着近乎陶醉的神情闭上眼，奔向顶点；你的[vagina]先是颤抖，随后紧紧收缩，尽情榨取那条深深卡在你体内的扁平舌头。");
         outputText("[pg][say: 你现在可以高潮了，贱狗，]在一阵令人满足的余韵低谷中，你声音沙哑地吐息道。");
         if(get_player().wetness() >= 5)
         {
            outputText("那狗女人被你每次收缩时灌进她嘴里的阵阵芳香淫液呛得咳嗽连连、含混喘息，更多液体从她鼻子里喷溅出来，又顺着下巴往下淌，把她胸前弄得一片狼藉。这并没有阻止她疯狂地在内裤里动着手，拼命拨弄自己的阴蒂，同时努力应付你那湿得惊人的小穴。她本就已经在边缘，没过多久，眼睛便向上翻起，身体绷紧又颤抖，嘴里满是你的小穴和它的味道。那景象令你十分满意，于是你站到她上方，把最后几股带着麝香气息的兴奋液体喷在她脸上和衣服上。她几乎没有注意到，只是喘着气，陶醉地继续用手弄着自己。");
         }
         else
         {
            outputText("那狗女人被你滴进她嘴里的润滑液呛得咳嗽连连、含混喘息，即使你仍继续把自己往她嘴里推进，也有一些液体从她鼻子里滴了出来。这并没有阻止她疯狂地在内裤里动着手，拼命拨弄自己的阴蒂，同时努力应付你小穴迫切的索求。她本就已经在边缘，没过多久，眼睛便向上翻起，身体绷紧又颤抖。");
         }
         outputText("[pg]等你弄完并抽身离开后，惠特尼又陷入了事后的恍惚。你不得不意有所指地咳了一声，仍然张开着你的[hips]，她才想起最后一步。她温热、扁平的舌头在你不断渗液的小穴周围打转，暖暖地压在你湿润的大腿上，把你舔得相当干净，你不由得叹了口气。");
         outputText("[pg][say: 这还挺有意思的，主人，]她做完后咧嘴说道。她的表情稍稍阴沉下来。[say: 不过你确定这样有用吗？我开始觉得自己可能根本不是这块料。]");
         outputText("[pg]你用自己能摆出的全部信心告诉她，她进步得很顺利，只要记住课程内容，用不了多久就会成为舔穴勇者。惠特尼慢慢点了点头，显然正拼命试着相信你的话。");
         outputText("[pg][say: 好吧，主人，我会试……我会做到的！]");
         get_player().orgasm("Vaginal");
         dynStats(DynStat.Sens(-1));
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function vaginaOralTrainingMaxed() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你坐稳下来，卸下你的[armor]。惠特尼一边看着，一边忍不住舔自己的嘴唇，让那对像被蜜蜂蜇过般丰满的黑唇湿亮发光。早在你将[vagina]露出来之前，她就已经摆好了姿势，并因即将发生的事而湿润：背挺得笔直，双手抬起，手腕弯着，用充满赤红欲望的棕色眼睛和缓缓摇动的尾巴，无声地向你乞求。");
         outputText("[pg][say: 求您了，夫人，我可以舔您的小穴吗？]你让沉重的一刻缓缓过去。");
         outputText("[pg][say: 很好，]你仁慈地说道，张开你的[hips]。[say: 看在你这么努力当个任务娼妇的份上，我想你的确配得上。]");
         outputText("[pg]她贴向你的腹部时，身上散发着热意，将嘴压进你的[chest]。她闭着眼，无声地把丰满的嘴唇压入你的柔软之中，随后让温暖、法兰绒般的舌头在你的肌肤上翻滚探寻，用黏着的唾液涂亮每一寸；她还不时用牙齿轻轻含住你的皮肤，让血色浮上表面，只为了让你更加享受她的舔舐；");
         if(!get_player().hasFuckableNipples())
         {
            outputText("她用嘴唇裹住你的每一颗[nipples]，用那丰润柔软的唇瓣亲吻它们，随后贴近吮吸，细细舔弄");
         }
         else
         {
            outputText("她把嘴唇贴上你小穴上的乳头，接着将舌头轻轻探入每一处，卷弄那敏感的粉肉，直到它们愉悦地渗出湿意");
         }
         outputText("。整个过程美妙而感官十足，而她在细细舔弄你胸部时发出的柔软欲望呻吟，更让这一切变得无比撩人。");
         if(get_player().lactationQ() > 0)
         {
            outputText("这很快便让你乳房中温热的液体涌上顶点，乳汁从你的乳头上自然地凝成珠滴。惠特尼急切地舔吮着吞下，才吸了一口就呜咽着退开。你轻轻一笑，心知那一小口撩人的浓郁甜美，只会让她变得更加饥渴。");
         }
         outputText("她让你的[chest]在温热油滑的唾液中泛着光，乳头也");
         if(!get_player().hasFuckableNipples())
         {
            outputText("坚硬如石，并且");
         }
         outputText("闪闪发亮，然后她俯身进入下一阶段。");
         outputText("[pg]你起身时甚至不必转身；她自己绕到你身后，手指渴望地沿着你的腰身一路滑下，抚过你的[hips]，跪在你身后，将滚烫的舌头探入你[butt]的臀沟，向下滑去舔弄你的[asshole]。她先把你臀间的盐味与麝香舔得干干净净，又反复舔舐你的后庭，直到那里变得湿润柔软、充满感官的酥意，随后才小心地用嘴唇和舌头抚过你的");
         if(get_player().butt.rating < 4)
         {
            outputText("结实的屁股");
         }
         if(get_player().butt.rating < 8)
         {
            outputText("柔软的臀部");
         }
         else
         {
            outputText("软嫩的屁股");
         }
         outputText("，将其舔得泛起油亮光泽。她一边做着，一边发出细小而压抑的喘息，你的唇边不禁浮起一抹笑意。");
         outputText("[pg][say:别再装作舔你女主人的屁股不会让你湿了。]你轻声低语。[say:我当初把你变成我的女仆母狗时，最没考虑的就是尊严。]她低低地、绵长地呜咽起来，而当她把丰满的嘴唇贴上你的肛门，将舌头深深埋进你的通道时，你叹息着沉溺在她饥渴而温热的嘴那顺从又流畅的动作里。她让你整个[butt]都像被温热的崇拜润滑得闪闪发亮，不过她带来的感觉与声音已经足够愉悦，让你忍不住左右扭动臀部，确保她把每一寸都舔到；她奴顺的呻吟和湿滑的舔舐声充满你的耳畔。你让她亲吻两边臀瓣后才继续。");
         outputText("[pg]娇小的犬娘急切地抓住你的[hips]，轻轻喘息，最后终于挪到你的[vagina]前；在她方才对你身体其他敏感部位的悉心伺候下，那里已经丰润地渗出湿意。她用一根柔软的手指勾逗你的[clit]，另一根则深深没入你的甬道，轻柔地在你的女性私处内外滑动，直到那里在她细致又撩人的动作下变得肿胀湿润。当你发出一声认可的轻哼时，她便俯身下来，把舌头探入你湿热而吮吸般的暖意之中。你不由得张开嘴、弓起后背；她丰满的嘴唇压在你的入口与阴蒂上，而当她开始在你深处探索并卷动舌头时，她柔软的黑暗毫无阻滞地滑过你的褶皱。");
         outputText("[pg]如今她已经对这一切驾轻就熟，精准地压向她明知会让你滴落湿液、阵阵抽搐的褶皱处，在你的[clit]与[vagina]之间交替伺候；前一刻她还用力弹弄你的敏感小扣，同时用舌尖温柔轻点你的入口，下一刻便深深舔入你的甬道，卷弄你的甜蜜点，而手指只是轻轻停在你的阴蒂周围。");
         outputText("[pg]最终，她完全放弃了手指，按照你教过她的那样双手勾住你的臀部，用温暖湿润的崇拜舔遍你整个性器。她间或发出的呻吟穿过你的私处，与那里本就深沉跳动的快感交织在一起，你发现自己渐渐被这感觉带走，闭上眼，忘了继续指导，彻底迷失在你这只母狗柔软、精准而陶醉的动作浪潮中，耳边尽是她的叹息与啧啧水声。如今已经不再需要任何指示，也不必做任何事，只需享受那丰满的湿意，以及那略带粗糙的舌头在你的粉肉里、上方与周围滑动；温热而不断变幻的快感浪潮将你卷入一场漫长的性欲狂喜。");
         outputText("[pg]惠特尼如今技艺如此纯熟，只要她愿意，大概随时都能让你高潮；但和你一样，她也想尽可能让这一切持续得更久。她以难以置信的缓慢与感官享用着你，间或的呻吟在你的性器中送来愉悦的震颤，尽可能把她敏感而渴求精液的嘴唇压进你的[vagina]里，用它们爱抚你的[clit]，让你始终在湿热中慢慢煎熬。她每次把嘴唇压进去时那喘息和抽动的模样，简直就像她有第二个小穴一样，与其说你是在被舔，不如说你其实是在和她的嘴交合摩擦。这个念头让你急切地向她顶去，摆动臀部，而你的褶皱挤进她湿润的口腔时，你得到的回应是闷闷的、温顺而喜悦的声音。");
         if(get_player().getClitLength() >= 4)
         {
            outputText("[pg]又过了几分钟，她缓慢地舔舐着，你也把腰往她脸上磨去。你将手指穿进她丝滑的头发里，小心却坚定地把她提起来，让她的舌头刚好能碰到你从包皮里高高挺出的阴蒂。你声音沙哑地命令她捧住自己的乳房。她柔软的舌头轻轻舔着你女根的尖端，让纯粹的狂喜一阵阵掠过你的性器；她挫败的呻吟也悠然相伴。你沉醉地看着她，试图把记忆中那个冷静、独立的狗女人，和如今被你攥在手里呜咽着、因崇拜你而湿得一塌糊涂的小穴奴隶重叠在一起。");
         }
         outputText("[pg]你把她深深按向你的[clit]，用双腿夹住她的头，让她用多汁的嘴将其完全含住。她现在以真正的需求舔弄你，专注地用舌头进攻你的阴蒂，随后滑入你的小穴，一次又一次压向你的甜蜜点，让你也忍不住叫出声来。你已经无力也不愿再控制自己，开始向她身上顶动，朝着高潮逼近。");
         outputText("[pg]你这样使用她时，她发出深沉的呻吟；即便你正用下体操弄她的脸，她也依旧做得恰到好处，在你向内挺入时将舌头刺入你的深处，又美妙地滑回你的入口，在你抽离时用她那布料般柔软肌肉的根部抵住你的阴蒂。你在金色而狂喜的高潮中腾飞，已经找不到任何言语；你仰起头，尽可能把自己埋进她口中，额头沁出汗珠，放声喊叫着在她舌头上乘着高潮起伏，同时阴蒂与小穴一同抵达顶峰的感觉让你弓起脖颈");
         if(get_player().wetness() >= 5)
         {
            outputText("，用温热的雌性认可一次又一次浸湿她的嘴和脸");
         }
         outputText("。");
         outputText("[pg]你身下传来一连串尖细而窒息的啼叫，她的身体在你周围颤抖；不用低头看，你也知道惠特尼也高潮了——仅仅是因为能把女主人灌进她嘴里的、带着麝香味的每一滴蜜液都吞咽干净，就让她陷入了流涎般的狂喜。最终，你再也给不了她更多，只能踉跄着向后退去，强烈的余韵让你眼前星光乱闪。");
         outputText("[pg]片刻之后，你感觉有双手环住你的[hips]，而那湿润、毫无摩擦感的丰软唇瓣压上了你仍在渗液的[vagina]。惠特尼像荡妇一样低声呻吟着清理你的性器，让她的嘴在你抽痛的小穴和大腿内侧来回抚过，随后又探寻般滑回你已经耗尽的[vagina]里，寻找最后一丝液体。你闭上眼，享受她那双新唇落在你胯间的美妙触感；她搜寻着你麝香气息的每一缕残留，将其舔舐干净，每一次吐息都深沉得仿佛你不是只是躺在那里，而是在给她世上最令人神魂颠倒的性爱。");
         outputText("[pg]等你的整个胯间都被唾液打磨得像是泛起明亮光泽时，你才把她拉开，将她紧实娇小的身体按进你的[chest]里，懒洋洋地低头看着她。她干得很好——你全身都像被抹了油、按摩过一般放松，覆盖在敏感带上的唾液让你在平静而慵懒的肉欲中微微共鸣。你觉得有你的女仆母狗的润滑液黏在身上，再加上此刻这种敞开的心境，几乎什么样的插入你都能承受，而且还会尽情享受。至于她，眼中那股压倒一切的渴望已经稍稍平息了一些——但那东西如今再也不会真正离开她了。");
         outputText("[pg][say: 你该说什么，母狗？]你低声说道。");
         outputText("[pg][say: 谢谢您，夫人。]你的任务荡妇低声呢喃，一边舔着她饱满的黑唇，一边满怀爱慕地凝视着你的眼睛。你疼爱地揉了揉她软塌塌的耳朵后面，然后在她紧实的屁股上拍了一下，把她打发走了，同时避开了她裙子上那一大片明显的湿痕。");
         get_player().orgasm("Vaginal");
         dynStats(DynStat.Sens(-1));
         if(get_player().wetness() < 5 && Utils.rand(4) == 0)
         {
            var _temp_1:* = get_player().vaginas[0];
            _temp_1.vaginalWetness = _temp_1.vaginalWetness + 1;
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function vaginaOralTraining() : Function
      {
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1136) == 0)
         {
            return firstVaginaOralTraining;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1136) <= 3)
         {
            return vaginaOralTrainingStageOne;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1136) == 4)
         {
            return firstVaginaOralTrainingStageTwo;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1136) <= 9)
         {
            return vaginaOralTrainingStageTwo;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1136) == 10)
         {
            return firstVaginaOralTrainingStageThree;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1136) == 11)
         {
            return vaginaOralTrainingStageThree;
         }
         return vaginaOralTrainingMaxed;
      }
      
      public function updateFarmCorruption() : int
      {
         var _loc1_:* = null as IMap;
         var _loc3_:int = 0;
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1077) <= 0)
         {
            return FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1078);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1120) == 1)
         {
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1120,2);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1124) != 0 && !get_player().hasKeyItem("Breast Milker - Installed At Whitney\'s Farm"))
         {
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1124,0);
            get_player().createKeyItem("Breast Milker - Installed At Whitney\'s Farm",0,0,0,0);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1125) != 0 && !get_player().hasKeyItem("Cock Milker - Installed At Whitney\'s Farm"))
         {
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1125,0);
            get_player().createKeyItem("Cock Milker - Installed At Whitney\'s Farm",0,0,0,0);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1127) != 0)
         {
            _loc1_ = KFLAGS.flags;
            FlagDict_Impl_.arrayWriteInt(_loc1_,1127,FlagDict_Impl_.arrayReadInt(_loc1_,1127) + 1);
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1127) > 7)
            {
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1109,1);
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1127,0);
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1126) != 0)
         {
            _loc1_ = KFLAGS.flags;
            FlagDict_Impl_.arrayWriteInt(_loc1_,1126,FlagDict_Impl_.arrayReadInt(_loc1_,1126) + 1);
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1126) > 3)
            {
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1094,1);
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1126,0);
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1128) != 0)
         {
            _loc1_ = KFLAGS.flags;
            FlagDict_Impl_.arrayWriteInt(_loc1_,1128,FlagDict_Impl_.arrayReadInt(_loc1_,1128) + 1);
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1128) > 3)
            {
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1128,0);
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1123,1);
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1089,1);
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,870,0);
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1134) != 0)
         {
            _loc1_ = KFLAGS.flags;
            FlagDict_Impl_.arrayWriteInt(_loc1_,1134,FlagDict_Impl_.arrayReadInt(_loc1_,1134) + 1);
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1134) > 2)
            {
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1134,0);
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1133,1);
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1135,1);
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1164) != 0)
         {
            _loc1_ = KFLAGS.flags;
            FlagDict_Impl_.arrayWriteInt(_loc1_,1164,FlagDict_Impl_.arrayReadInt(_loc1_,1164) + 1);
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1164) > 7)
            {
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1164,0);
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1162,2);
            }
         }
         var _loc2_:int = -1;
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1079) == 1)
         {
            _loc2_ += 2;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1080) == 1)
         {
            _loc2_ += 2;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1081) == 1 && get_game().sophieBimbo.bimboSophie())
         {
            _loc2_++;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1084) == 1)
         {
            _loc2_ += 4;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1085) == 1)
         {
            _loc2_++;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1087) > 0)
         {
            _loc2_ += 4;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1088) == 1)
         {
            _loc2_ += 2;
         }
         whitneyCorruption(_loc2_);
         _loc1_ = KFLAGS.flags;
         FlagDict_Impl_.arrayWriteInt(_loc1_,1093,FlagDict_Impl_.arrayReadInt(_loc1_,1093) + farmValue());
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1079) == 1 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1096) == 1 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1094) == 1)
         {
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1100) == 0)
            {
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1100,1);
            }
            _loc1_ = KFLAGS.flags;
            FlagDict_Impl_.arrayWriteInt(_loc1_,1097,FlagDict_Impl_.arrayReadInt(_loc1_,1097) + 1);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1080) == 1 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1098) == 1 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1094) == 1)
         {
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1101) == 0)
            {
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1101,1);
            }
            _loc1_ = KFLAGS.flags;
            FlagDict_Impl_.arrayWriteInt(_loc1_,1099,FlagDict_Impl_.arrayReadInt(_loc1_,1099) + 1);
            if(get_game().jojoScene.tentacleJojo())
            {
               _loc1_ = KFLAGS.flags;
               FlagDict_Impl_.arrayWriteInt(_loc1_,1099,FlagDict_Impl_.arrayReadInt(_loc1_,1099) + 1);
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1081) > 0 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1102) == 1)
         {
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1104) == 0)
            {
               _loc3_ = 1105;
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,_loc3_,FlagDict_Impl_.arrayReadInt(KFLAGS.flags,_loc3_) - 1);
               if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1105) == 0)
               {
                  FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1104,1);
                  FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1105,7);
               }
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1084) == 1 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1106) == 1)
         {
            _loc1_ = KFLAGS.flags;
            FlagDict_Impl_.arrayWriteInt(_loc1_,1097,FlagDict_Impl_.arrayReadInt(_loc1_,1097) + 1);
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1094) == 1)
            {
               _loc1_ = KFLAGS.flags;
               FlagDict_Impl_.arrayWriteInt(_loc1_,1097,FlagDict_Impl_.arrayReadInt(_loc1_,1097) + 1);
            }
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1107) == 0)
            {
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1107,1);
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1097) > 5)
         {
            _loc1_ = KFLAGS.flags;
            FlagDict_Impl_.arrayWriteInt(_loc1_,1093,FlagDict_Impl_.arrayReadInt(_loc1_,1093) + (FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1097) - 5) * 3);
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1097,5);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1099) > 5)
         {
            _loc1_ = KFLAGS.flags;
            FlagDict_Impl_.arrayWriteInt(_loc1_,1093,FlagDict_Impl_.arrayReadInt(_loc1_,1093) + (FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1099) - 5) * 5);
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1099,5);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1085) == 1)
         {
            get_game().latexGirl.gooHappiness(-0.5,false);
            get_game().latexGirl.gooObedience(0.5,false);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1086) > 0)
         {
            _loc1_ = KFLAGS.flags;
            FlagDict_Impl_.arrayWriteInt(_loc1_,1086,FlagDict_Impl_.arrayReadInt(_loc1_,1086) + 1);
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1086) > 7)
            {
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1086,-1);
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1087) > 0)
         {
            _loc1_ = KFLAGS.flags;
            FlagDict_Impl_.arrayWriteInt(_loc1_,1087,FlagDict_Impl_.arrayReadInt(_loc1_,1087) + 1);
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1087) > 20)
            {
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1087,-1);
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1109) == 1)
         {
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1111) == 0)
            {
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1111,1);
            }
         }
         _loc1_ = KFLAGS.flags;
         FlagDict_Impl_.arrayWriteInt(_loc1_,1092,FlagDict_Impl_.arrayReadInt(_loc1_,1092) + 1);
         return _loc2_;
      }
      
      public function turnDownInvestment(param1:Boolean = false) : void
      {
         clearOutput();
         whitneySprite();
         if(!whitneyCorrupt())
         {
            outputText("惠特尼耸耸肩，不以为意。");
            if(param1)
            {
               outputText("[pg][say: 带钱再来。]");
            }
            else
            {
               outputText("[pg][say: 要是改变主意就回来。带上钱。]");
            }
         }
         else
         {
            outputText("惠特尼带着一抹假笑耸了耸肩。");
            outputText("[pg][say: 只要你改主意，随时都能回来，[master]。只要你有钱，这事儿不难办。]");
         }
         investmentMenu();
      }
      
      public function tribalTattoo(param1:int) : void
      {
         clearOutput();
         whitneySprite();
         var _loc2_:String = "一片部落风纹身，尽是蜿蜒而色情的线条，横跨她的";
         if(param1 == 0)
         {
            collarboneIntro();
            outputText("[pg][say: 你的手指真灵巧，[master]，]她一边赞叹地抚摸着你画下的东西，一边说道。[say: 不过我想我早就知道了。]");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1129,_loc2_);
         }
         else if(param1 == 1)
         {
            shouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1130,_loc2_);
         }
         else if(param1 == 2)
         {
            lowerbackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1131,_loc2_);
         }
         else if(param1 == 3)
         {
            buttIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1132,_loc2_);
         }
         tattooMerge();
      }
      
      public function testBranding() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你也回以她恶作剧般的咧嘴一笑。");
         outputText("[pg][say: 既然你这么能干，我想你确实该得到点奖励。把衣服脱了。]");
         outputText("[pg]狗女孩兴冲冲地脱下衣服，而你小心地拿起那罐黑墨水，思考着要在她身上哪里、纹些什么。");
         brandSlotSelect();
      }
      
      public function tattooMerge() : void
      {
         outputText("[pg]胡闹完之后，惠特尼重新穿好衣服；穿衣时，她的手还是忍不住一次次摸向身体上那道新添的、无法抹去的印记。");
         outputText("[pg][say: 我很高兴你喜欢我给你弄来的东西，[master]，]她说道。[say: 我会把它放到谷仓里，这样如果你哪天又想，呃，给更多牲口做标记，它就在那儿。不过先提醒你，[master]，魔法墨水可不便宜——每个标记都要花整整50颗宝石。]");
         outputText("[pg]你告诉她她做得很好，然后转身离开。");
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function takeoverPromptNow() : void
      {
         clearOutput();
         outputText("你大步走下农场，跃过一道栅门。你姿态随意，大摇大摆地朝辣椒地走去，看不出有什么明确目的。惠特尼发现你后，从除草中慢慢站起身来，你便抬起手，友好地打了个招呼");
         if(!get_player().get_weapon().isAttached())
         {
            outputText("，为了表示自己没有敌意，你还夸张地举起你的[weapon]，然后漫不经心地一甩手把它丢到一边。");
         }
         else
         {
            outputText("。");
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,725) >= 4 || get_player().hasStatusEffect(StatusEffects.MarbleRapeAttempted))
         {
            outputText("[pg]她没有动，也没有赶你走，但你能看出她脸上绷得厉害。[say: 我早就跟你说过，我不想让你到我的农场来，]你们面对面时，她低沉而愤怒地说道。你猛地举起双手，故作恼火地环顾四周，像是在向某个并不存在的观众诉苦。");
         }
         else
         {
            outputText("[pg]她紧张又拿不准地看着你。[say: 听着，[name]，我其实挺高兴你来了。我一直想跟你谈谈。我……我觉得我不想再让你来农场了。自从我刚认识你以来，你变了，你……最近闻起来不一样了。说实话，像个恶魔。我一直没计较，是因为我认识你，而且我也一直说人该管好自己的事，可是……]她的话音渐渐低了下去，因为你撅起下唇，装出一副受伤的样子嘲弄她。");
         }
         outputText("[pg][say: 我只是想谈谈。我对你的农场有些大计划，想跟你商量一下。]");
         outputText("[pg][say: 没什么好商量的，]她回答道。");
         outputText("[pg][say: 哦，可我觉得有。]你朝惠特尼迈出一步，她立刻后退，伸手摸进手推车里，掏出一把已经上弦的弩，对准了你。你咧嘴一笑。");
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,725) >= 4)
         {
            outputText("[pg][say: 真可爱。不过，你知道吗，凯尔特也有一张弓。他每天都练。大概是为了保护你的农场吧。]你停顿了一下，直视她的双眼。[say: 最近有好好看过凯尔特吗？你也想变成那样吗？跪在地上，求我射在你脸上？因为在我看来，如今这农场已经没什么能保护它了。随便什么人都能走进来，为所欲为。也许趁你睡着的时候？或者在你干活时悄悄污染你的食物？你真打算下半辈子都抱着那把弩不放吗？]惠特尼的手微微发颤，你能从弩箭和弩弦上看出来。");
         }
         else if(get_player().hasStatusEffect(StatusEffects.MarbleRapeAttempted))
         {
            outputText("[pg][say: 真可爱。不过，你知道吗，玛布尔有一把锤子，跟那东西一比，你这玩意儿简直像把玩具弹弓。她每天都练。大概是为了保护你的农场吧？]你停顿了一下，直视她的双眼。[say: 如果我没记错，我收拾完她之后，她已经成了一团只会呜咽的烂泥。她后来还能打得多好？因为在我看来，如今这农场已经没什么能保护它了。随便什么人都能走进来，为所欲为。也许趁你睡着的时候？或者在你干活时悄悄污染你的食物？你真打算下半辈子都抱着那把弩不放吗？]惠特尼的手微微发颤，你能从弩箭和弩弦上看出来。");
         }
         else
         {
            outputText("[pg][say: 真可爱。不过我见过有些东西的鸡巴，看起来都比你那玩意儿危险。]你停顿了一下，直视她的双眼。[say: 自从来到这里以后，我已经和很多东西交过手了，惠特尼。也把很多东西踩在脚下碾碎。整个玛瑞斯都快明白了：如果你对我没用，那你就会被打碎重塑，好让你</i>变得有用<i>。要是你因为不肯认清形势而落到那种下场，那可真他妈可惜。毕竟，随便什么人都能走进来，为所欲为，也许趁你睡着的时候？或者在你干活时悄悄污染你的食物？你真打算下半辈子都抱着那把弩不放吗？]惠特尼的手微微发颤，你能从弩箭和弩弦上看出来。");
         }
         outputText("[pg][say: 你想要什么？]她用憋闷的声音低吼道。");
         outputText("[pg][say: 我想要的只是……最大化这座农场的产出。要我说，这里有太多懈怠的地方需要补上。]你把双手背到身后，开始在辣椒地里缓缓来回踱步。她仍然用弩指着你，但箭头的晃动越来越不稳。[say: 你会让我按我的意思使用这座农场。我会视情况给你派来……帮手……作为回报，我保证不会对你本人动手，也保证你的农场不会受到伤害。]箭头又颤抖了好一会儿。");
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,725) >= 4 || get_player().hasStatusEffect(StatusEffects.MarbleRapeAttempted))
         {
            outputText("[pg]你不得不承认，要是她真扣下扳机，那一定会疼得厉害，甚至你都不知道之后会发生什么；脑海中闪过一幅烈焰吞没谷仓的画面。不过，在仿佛过了一个小时的权衡之后，惠特尼终于放下了弩。");
            outputText("[pg][saystart]好吧。好吧，也许你拿住我了，陌生人。没有");
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,725) >= 4)
            {
               outputText("凯尔特");
            }
            else
            {
               outputText("玛布尔");
            }
            outputText("，我就没法好好保护这地方，所以也许我确实需要……保险。[sayend]她吐出最后那个词。[say: 只要你他妈离我远点，我就照你说的做。]你露出灿烂的笑容。");
         }
         else
         {
            if(!get_player().hasStatusEffect(StatusEffects.MarbleRapeAttempted) && !get_player().hasStatusEffect(StatusEffects.NoMoreMarble))
            {
               outputText("[pg][say: 玛布尔不会容忍这种事的，]惠特尼压低声音说道，几乎只剩耳语。");
               outputText("[pg][say: 玛布尔他妈的爱咋咋地，]你平静地回答。[say: 我这边人数占优。]");
            }
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,725) < 4)
            {
               outputText("[pg][say: 你以为凯尔特会容忍你强行插手他的地盘吗？他宁可杀了你，也不会让这种事发生。]");
               outputText("[pg][say: 如果凯尔特愿意听你这种人的指挥，那我想，他也会听我的，]你随意地耸了耸肩说道。[say: 如果你觉得我会怕那个愚蠢又爱吹牛的家伙，那你可就大错特错了。]");
            }
            outputText("[pg]你不得不承认，要是她用弩朝你射上一箭，那肯定会疼得要命，甚至让你不知道之后会发生什么；脑海中一闪而过的，是一座谷仓被烈焰吞没的景象。不过，在仿佛经过了一个小时的斟酌之后，惠特尼还是放下了武器。");
            outputText("[pg][say: 好吧。好吧，或许你拿住我了，陌生人。我又不能眼观六路，所以也许我确实需要……保险。]她咬牙吐出最后那个词。[say: 只要你他妈的离我远点，我就照你说的做。]你露出了灿烂的笑容。");
         }
         outputText("[pg][say: 明智的决定。我会尽快派人手来帮你。我期待与你建立一段长久而兴旺的生意关系。]你深深鞠了一躬，转身几乎一路走到大门口，才又竖起一根手指。");
         outputText("[pg][say: 哦，还有一件事。我会要抽成。毕竟我现在也算投进了你这点小买卖里，对吧。就定在20%怎么样？如果你不愿亲手把钱交给我，就每周把它放在那边那块石头底下。照做的话，我们就不会有任何……麻烦。]你冲她露出一抹坏笑。");
         outputText("[pg]她看着你，仿佛这辈子从没见过你似的，一句话也说不出来。[say: 那看来事情就这么定了。跟你谈话总是这么愉快，惠特尼。]你故意摆出夸张的架势扭着[hips]，慢慢往营地走去，心里清楚，那名犬兽人的目光会一直追随着你，直到你消失在远方。");
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1077,1);
         if(!get_player().hasStatusEffect(StatusEffects.NoMoreMarble))
         {
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1091,0);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function takeoverPromptNever() : void
      {
         clearOutput();
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1075,1);
         outputText("你闭上眼睛，深深地、颤抖地呼吸着，吸入带着青草香气的清甜空气，聆听笼罩着此地的那份安静而温柔的平和。那些在你脑海中翻涌的腐臭念头和恶毒而鲜艳的画面一点点褪去，你的血液冷却下来，慢慢地，终于，你找回了内心的宁静。你向自己承诺，无论发生什么，你永远都不会对这片很久以前在这个世界里找到的宁静之地做任何事，哪怕只是为了提醒自己曾经是什么样的人。喉咙里像是堵着一块沉重的东西，你转身离开。");
         dynStats(DynStat.Cor(-5));
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function takeoverPromptMerge(param1:Boolean = false) : void
      {
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1076,get_time().days);
         if(param1)
         {
            outputText("[pg]你任由怒火滋长，随后如野火般在体内咆哮，奔涌过你的血管；近来你越来越发现，激情能让你思路更清晰，也能更好地点燃你的灵感。这座农场很有潜力，你看得出来；你完全可以把它变成服务于你目的的地方。当然，下面田里那个目光短浅的贱人永远不会自己意识到这一点。你得先下去，让她明白自己的位置。唯一的问题是：现在，还是以后？");
         }
         else
         {
            outputText("你又一次站在俯瞰农场的峭壁上，望着下方那个阻挠你、妨碍你对这片地产规划的女人，心中充满了亵渎般的怒火。你要现在就开始执行计划，还是以后再说？");
         }
         menu();
         addButton(0,"现在",takeoverPromptNow);
         addButton(1,"稍后",takeoverPromptLater);
         addButton(2,"永不",takeoverPromptNever);
      }
      
      public function takeoverPromptMarbleRape() : void
      {
         outputText("你站在一处小坡顶上，俯瞰着农场。从这里，你勉强能看见胡椒田里有个" + (get_noFur() ? "金发" : "米色毛皮") + "的身影正在埋头干活。看着这幅田园景象，你几乎难以置信地摇了摇头。你还记得，当初自己刚在这片土地上蹒跚起步时，身上除了衣服几乎一无所有；也记得发现这座农场时，心里涌起的那份宽慰——在这片混乱之地中，这里就像一小块安宁之所。那时的你是多么感激它的主人，愿意和她一起在泥地里刨土，只为赚那点微薄的工钱。");
         outputText("[pg]可现在，你心里只剩下轻蔑。那个贱人怎么<b>敢</b>把你从她的土地上赶走，好像你是什么普通流浪汉一样？只因为你从那头母牛贱人身上拿走了本就属于你的东西。要是玛布尔对你做了你对她做的事，惠特尼会出手吗？你可不这么认为。不，惠特尼才不会。她只会高高兴兴地坐在山坡上读她的书，看着那头母牛贱人随心所欲地摆弄你，多半还会把她那该死的奶硬灌进你喉咙里。可一旦事情影响到她，哎呀，天哪，那可就不行了，对吧？");
         outputText("[pg]她知不知道自己有多幸运？知不知道自己惹上的是谁？知不知道要摧毁她的意志、让她成为你心甘情愿的奴隶，会有多容易");
         if(get_game().amilyScene.amilyCorrupt() || get_game().jojoScene.campCorruptJojo())
         {
            outputText("，还有那个啮齿荡妇");
            if(get_game().amilyScene.amilyCorrupt() && get_game().jojoScene.campCorruptJojo())
            {
               outputText("");
            }
            outputText("在她之前");
         }
         outputText("？");
      }
      
      public function takeoverPromptLater() : void
      {
         clearOutput();
         outputText("你又盯着看了一会儿，随后决定暂时先什么都不做。你会给予她本不配得到的仁慈……暂时如此。");
         get_farm().farmMenu();
      }
      
      public function takeoverPromptKelly() : void
      {
         outputText("你站在一处小坡顶上，俯瞰着农场。从这里，你勉强能看见胡椒田里有个" + (get_noFur() ? "金发" : "米色毛皮") + "的身影正在埋头干活。看着这幅田园景象，你几乎难以置信地摇了摇头。你还记得，当初自己刚在这片土地上蹒跚起步时，身上除了衣服几乎一无所有；也记得发现这座农场时，心里涌起的那份宽慰——在这片混乱之地中，这里就像一小块安宁之所。那时的你是多么感激它的主人，愿意和她一起在泥地里刨土，只为赚那点微薄的工钱。");
         outputText("[pg]可现在，你心里只剩下轻蔑。那个贱人怎么<b>敢</b>把你从她的土地上赶走，好像你是什么普通流浪汉一样？只因为你向那个她放任其四处晃荡、为所欲为的半人马贱货讨回了自己应得的报复？要是他对你做了你对他做的事，她会出手吗？你可不这么认为。不，惠特尼才不会。她只会高高兴兴地坐在山坡上读她的书，看着她那混账宠物把你狠狠强奸个彻底。");
         outputText("[pg]可一旦事情影响到她，哎呀，天哪，那可就不行了，对吧？她知不知道自己有多幸运？知不知道自己惹上的是谁？知不知道要像你对凯尔特");
         if(get_game().amilyScene.amilyCorrupt() || get_game().jojoScene.campCorruptJojo())
         {
            outputText("，还有那个啮齿荡妇");
            if(get_game().amilyScene.amilyCorrupt() && get_game().jojoScene.campCorruptJojo())
            {
               outputText("");
            }
            outputText("所做过的那样对付她，会有多容易");
         }
         outputText("？");
      }
      
      public function takeoverPromptGeneric() : void
      {
         outputText("你站在一处小坡顶上，俯瞰着农场。从这里，你勉强能看见胡椒田里有个" + (get_noFur() ? "金发" : "米色毛皮") + "的身影正在埋头干活。看着这幅田园景象，你几乎难以置信地摇了摇头。你还记得，当初自己刚在这片土地上蹒跚起步时，身上除了衣服几乎一无所有。");
         outputText("[pg]你还记得发现这座农场时，心里涌起的那份宽慰——在这片混乱之地中，这里就像一小块安宁之所。那时的你是多么感激它的主人，愿意和她一起在泥地里刨土，只为赚那点微薄的工钱。");
         outputText("[pg]可现在，你心里只剩下轻蔑。什么人会选择在这种地方过一辈子，安稳又无所事事？什么样毫无性趣、空洞无物的家伙，会对路过的勇者点点头，然后又回去看她的书，只要事情不直接影响到自己，就对任何人、任何事都漠不关心？她知不知道自己有多幸运？知不知道你有多仁慈，竟然让她继续平静地过着她那没用的人生，而你就在山丘另一边，身边聚集着一群性奴？你愿意付出什么，又会做些什么，才能让她惊恐地睁大眼睛，让她明白，那个曾从她院子里经过、被她无视的[manboy]，心里怀着更大的野心，如今回来就是要彻底摧毁她。");
      }
      
      public function takeoverPrompt() : Boolean
      {
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1075) == 1)
         {
            return false;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1077) == 1)
         {
            farmMenu();
            return true;
         }
         if(get_player().isCorruptEnough(70) && corruptFollowers() >= 2 && softLevelMin(12))
         {
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1076) != get_time().days)
            {
               clearOutput();
               if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,725) >= 4)
               {
                  takeoverPromptKelly();
               }
               else if(get_player().hasStatusEffect(StatusEffects.MarbleRapeAttempted))
               {
                  takeoverPromptMarbleRape();
               }
               else
               {
                  takeoverPromptGeneric();
               }
               takeoverPromptMerge(true);
               return true;
            }
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1076) != get_time().days || FlagDict_Impl_.arrayReadInt(KFLAGS.flags,464) == 1)
            {
               clearOutput();
               takeoverPromptMerge();
               return true;
            }
            return false;
         }
         return false;
      }
      
      public function takeItems(param1:int) : void
      {
         var _loc2_:Consumable = getItemObj(param1);
         if(param1 == 1104)
         {
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1105,7);
         }
         var _loc3_:int = param1;
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,_loc3_,FlagDict_Impl_.arrayReadInt(KFLAGS.flags,_loc3_) - 1);
         get_inventory().takeItem(_loc2_,afterTakeItems);
      }
      
      public function subHappyEndingMale() : void
      {
         clearOutput();
         var _loc1_:int = get_player().cockThatFits(whitneyVagCapacity() * 1.33) + 1;
         var _loc2_:Boolean = false;
         if(get_player().cockArea(_loc1_ - 1) != get_player().biggestCockArea())
         {
            _loc2_ = true;
         }
         outputText("你漂到她身边，用身体将她包裹住，你的[chest]压上她小巧乳房的柔软。你能感到欲望，却因放松状态而没有被它吞没，于是反而花时间享受你奴隶身体的迎合与回馈：她平坦的小腹贴着你滑过，坚硬的乳头抵在你胸口，她修长的" + (whitneyDefurred() || get_noFur() ? "光滑" : "覆着绒毛的") + "双腿在水中缓慢地与你纠缠。她呼吸一滞，在胸腔里急促颤抖；你把手探入她两腿之间，手指没入她紧窄而迎人的穴口。");
         outputText("[pg]你将你的[cock " + _loc1_ + "]沿着她的小腹上下滑动，接着送到她的唇瓣之间，用它逗弄着她的湿润，让它渐渐硬起来。");
         if(_loc2_)
         {
            outputText("你的[cock biggest]早已习惯受到优待，此刻不满地鼓胀起来；蜥蜴般的本能在你脑海深处翻涌，催促你用它把她狠狠干到神志不清。但你知道，与其在一场蛮牛闯瓷器店般横冲直撞的乱干里把她变成又一个被操松的婊子，不如让她继续保持这样美妙的紧致。况且……当你用你的[cock " + _loc1_ + "]试探她时，也将你的[cock biggest]沿着她的小腹向上滑去，一边享受她肌肤的光滑，一边感受另一侧热泡沫的拍打。惠特尼愉悦地轻哼着，双手握住那根指向她乳房的粗大肉棒，在你准备插入她时，慢慢地上下摩挲。}");
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1163) == 0)
         {
            outputText("[pg][say: 有段时间没做了吧？]你轻声说道，同时将你的[cock " + _loc1_ + "]对准她粉色的裂缝，为那柔软而美妙的阻力轻叹一声。");
            outputText("[pg][say: 感觉像是——像是过了好久，[master]。我不知道为什么我——噢……]她的念头随着你沉入她体内而断开；你深入她的深处，感受着她湿润的内壁从四面八方挤压着你的肉棒，不由得吐出一口气。你动作很慢，每当她呼吸哽在喉头时，就停下来，几乎全数抽出，再温柔地刺入那份美妙的紧致之中，每一次都比上一次更深入一点。她的身体很快就想起了这种节奏——毫无疑问，也多亏了你让她深陷其中的堕落——没过多久，她的臀部便缠上了你，渴求着你的[cock " + _loc1_ + "]一次次回抽再送入。");
         }
         else
         {
            outputText("[pg]你一挺身撑开她的阴唇，刺入她的深处，她顿时倒吸一口气。她的小穴如今已经习惯了你的[cock " + _loc1_ + "]，依旧美妙地紧致收缩，却也同样热情地接纳着你，仿佛天生就该用湿热的快感套住并挤压你尺寸适中的肉棒每一寸。没过多久，你的臀部便贴上了她，将你的肉棒尽根吞入。她的大腿在你身周收紧，而你也开始沉醉在这柔软、缓慢的节奏之中。");
         }
         outputText("[pg][say: 如果可以的话，就跟着我的节奏呼吸，]你带着一丝嘲弄低声说着，望进她眼中，同时温柔地推入她体内。[say: 要是做不到——我可能就得稍微快一点了。]这本只是挑逗，可当你慢慢挺入她，将她随着你身体慵懒的起伏推回热水浴池边缘时，她却执拗地让自己的呼吸与你同步，再一次让这闷热温暖的空间里充满你们共同呼吸时那性感而亲密的声音。");
         outputText("[pg]在浴池的热意与泡沫深处进出她身体的感觉美妙至极，而她先前彻底的按摩又让你此刻对自己的身体有着十足的掌控感，仿佛一切都尽在掌握——甚至包括惠特尼。她沉重的呼吸与你完全一致，柔韧的身体缠绕着你、夹紧着你。你觉得自己还能继续待在这里，在蒸汽与奴隶的紧致中再尽情享受很久……");
         outputText("[pg]惠特尼呼吸一滞，手上更用力地抓住");
         if(_loc2_)
         {
            outputText("你的[cock biggest]");
         }
         else if(get_player().isBiped())
         {
            outputText("，抵着你的[hips]");
         }
         else
         {
            outputText("你的后背");
         }
         outputText("了一瞬。你咧嘴一笑，开始稍微更用力地抽送，借着你抹了油的[hips]所能带来的完整幅度尽情动作。这正如你所预料的那样起了效果。又过了片刻，那只被你深深埋入的狗女孩还努力配合着你沉重的呼气节奏，终于还是喘叫出声，无法再控制自己。你抓住她的膝弯把她的双腿抬起，再一次加快速度，依旧用骨盆的完整动作将你的[cock " + _loc1_ + "]每一寸都抽出又沉入，猛烈地挺进她粉色的紧致之中，激得周围的水花急促四溅，也让你埋入她体内更深。");
         outputText("[pg]惠特尼尽力让呼吸保持平稳，任由你一次次撞上她、把她压回浴池边缘；但当你托起她的大腿，借着额外的支点以新的角度顶入她的内壁时，她终于再也忍不住，狠狠咬住你的肩头，免得自己叫出声来。你咧嘴笑着，享受着那记爱咬的尖锐感与浸透你身体其他部位的柔软暖意之间的反差。不得不说，她反应确实很快，但这可拦不住你再一次加快节奏……");
         outputText("[pg]这场呼吸上的挑逗很快就发展到她彻底放弃努力的地步。你用沉重而快速的抽送操着她，在浓重湿热中尽可能地加快速度；她的自制力已经荡然无存，除了你的肉棒填满她紧致小穴的每一寸外，再也感受不到别的。你很享受把她弄成这副模样，但若说你还保持着最初那样的克制，那就是在撒谎——如今你也同样急切地挺入她体内，沉醉于她每一声尖细的叫喊，神经末梢嗡嗡作响，压力在你的");
         if(get_player().balls > 0)
         {
            outputText("[balls]中不断积聚。");
         }
         else
         {
            outputText("胯间不断积聚。");
         }
         outputText("[pg]你紧紧抱住她，和她一同呻吟着，将你的[cock " + _loc1_ + "]每一寸都尽数塞入她体内并释放出来，紧绷着、跳动着把精液射进她身体里。就算那只狗女孩先前没能高潮，现在也肯定达到了；她弓起背，眼睛上翻，你用滚烫的精液灌满她的子宫，她的小穴几乎令人难以忍受地紧紧挤住你，简直像是在把精液从你体内吸出来。");
         if(get_player().cumQ() >= 1500)
         {
            outputText("她小小的容量几乎立刻就被填满，而你每一次浓烈的顶送都会让精液喷涌而出，用你巨量的白浊污染着周围的水。");
         }
         if(_loc2_)
         {
            outputText("这整段时间里，惠特尼一直时不时用滚烫的双手和光滑的小腹抚弄、挑逗你的[cock biggest]；当你的高潮积蓄并将你吞没时，她也得到了应有的奖赏——你从[eachCock]中喷射出精液，先糊上她的脸，再糊满她紧致的乳房，同时仍然狠狠地骑弄着她。");
         }
         happyEndingMerge();
      }
      
      public function subHappyEndingFemale() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你滑过去，用身体包裹住她，你的 [chest] 压上她小巧乳房的柔软。你能感到自己的欲望，但在放松状态下并未被它吞没，于是你花时间享受你的奴隶身体带来的起伏回应：她平坦的小腹贴着你的腹部滑过，她坚硬的乳头抵在你胸前，她那双修长、" + (whitneyDefurred() || get_noFur() ? "光滑" : "覆着细绒") + "的腿在水中缓慢地与你纠缠。你把手探入她双腿之间，拂过那片整齐的阴毛，将手指沉入她紧致而迎接你的穴中；她胸口一滞，在你掌下喘息、颤抖。你勾起一条 [legs] 压过她的腿，把你的 [vagina] 抵上她的，随着彼此的唇瓣相触、摩擦而轻轻叹息。");
         if(get_player().hasCock())
         {
            outputText("[pg]你的[cock biggest]早已习惯受到优待，此刻因躁动而鼓胀，想用它把她操到松开、操到迷糊的男性冲动充斥在你脑海深处——但在这蒸汽缭绕、悠然闲适的时刻，你更想纵容自己女性的一面。况且……当你把自己的[vagina]压向她时，也将你的[cock biggest]沿着她的腹部滑上去，一侧享受她肌肤的光滑，另一侧则感受滚烫泡沫的涌动。惠特尼愉悦地轻哼，双手握住那根指向她乳房的粗大肉棒，慢慢上下摩挲着，而你也准备好与她交叠磨蹭。");
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1163) == 0)
         {
            outputText("[pg][say: 有一阵子没这样了吧？]你轻声说道，感受着她肿胀的外阴抵住你的[clit]时那柔软而美妙的阻力，不由得叹息。");
            outputText("[pg][say: 从来——从来没和别的女人这样过，女主人。我不知道为什么我——噢……]她的念头随着你夹紧她而中断，你们的小穴被有力地贴合在一起。起初她僵在那里，似乎完全不知道该做什么，也不知道你的阴阜压着她的感觉该如何回应；你的肉缝和内侧粉肉压进她的阴唇，带来愉悦的触感。你尽可能缓慢而感性地动作，手掌滑过她柔韧而湿润的肌肤，占有般地亲吻、舔舐她的脸和脖颈；每当她因你手或臀的动作而幸福地叹息时，你便低声鼓励她。你一点点、却稳稳地解开她，没过多久，她便急切地回压向你，不仅接受着，也同样用自己的性器回应着你。");
         }
         else
         {
            outputText("[pg]她倒抽一口气；你向她收紧，将你们的身体强硬地锁在一起。她现在已经习惯了你的[vagina]，很乐意把纤瘦的身子往你怀里推回来。你们的小穴彼此摩擦、缠绕，先挑逗你的阴蒂，再挑逗她的，直到两者都因渴求而涨起。随着你深深地同她剪腿摩擦，你的性器湿润展开。她的大腿夹紧你的腿，你也开始沉溺在这柔软、缓慢、属于女人之间的节奏里。");
         }
         outputText("[pg][say: 能做到的话，就跟着我的节奏呼吸，]你低声说道，语气里带着几分戏弄，一边望进她的眼睛，一边轻轻压向她。[say: 要是做不到——我可能就得稍微快一点了。]这本只是句挑逗，可当你缓缓贴着她摇动，用身体那慵懒的起伏把她推回热水浴池边时，她却下定决心跟上了你的呼吸。很快，这闷热而温暖的房间里，再一次充满了你们交缠在一起的亲密呼吸声。");
         outputText("[pg]在浴池的热意与泡沫深处同她贴身滑磨，那感觉美妙得难以形容。不过她刚才那番细致的按摩让你对自己的身体掌控十足，仿佛一切都在你的掌握之中，就连惠特尼也是。她沉重的呼吸与你完全一致，柔韧的身体缠住你、夹紧你。你觉得自己还可以在这里待上很久，尽情享受蒸汽，以及你的奴隶那紧紧裹住你的触感……");
         outputText("[pg]惠特尼呼吸一滞，手上更用力地抓住");
         if(get_player().hasCock())
         {
            outputText("你的[cock biggest]");
         }
         else if(get_player().isBiped())
         {
            outputText("，抵着你的[hips]");
         }
         else
         {
            outputText("你的后背");
         }
         outputText("，只持续了一瞬。你咧嘴一笑，开始更用力地顶弄她，借着[hips]能带来的全部活动幅度尽情施为。效果正如你所料。又过了片刻，这只与你纠缠在一起的犬娘还在努力跟上你沉重的吐息，最终却再也撑不住，喘息声一下子爆发出来。你随即低下头含住她硬挺的乳头，把它们吞入口中，先轻轻咬弄一个，再咬弄另一个，同时将你的[clit]用力顶向她粉嫩紧致的部位，动作激烈得让周围的水都急促地溅起。");
         outputText("[pg]在你一次次撞击、按压着把她抵回浴池边时，惠特尼竭力保持呼吸平稳；可当你用嘴唇向外拉扯她那颗棕褐色乳头时，她终于忍不住，狠狠咬住你的肩膀，借此压住险些出口的叫声。你咧嘴笑了起来，享受着那道咬痕的尖锐痛感，和浸没你全身其他部位的柔软暖意之间的反差。她反应倒是很快，值得夸奖，但这可拦不住你再次加快节奏……");
         outputText("[pg]这场呼吸上的挑逗很快失控到了她放弃尝试的地步。你用沉重而迅疾的动作同她交合，她则在你身下呻吟、呜咽、尖叫。在令人窒息的湿热中，你已经尽可能加快速度，而她的自制力早已消失殆尽；除了你们彼此摩擦的小穴和阴蒂，她对其他一切都没了知觉。你很享受把她逼到这种状态，但要说你还像一开始那样克制，那就是自欺欺人了——现在你也同样急切地磨蹭着她，沉醉于她每一声尖细的哭叫。随着热意在你胯间积聚，你的每一根神经都在嗡嗡作响。");
         outputText("[pg]你紧紧抱住她，也加入她的呻吟，尽可能把自己的身体缠到她身上；你的[chest]压上她被挑逗得发疼的乳头，而你的[vagina]颤抖着，随即猛然收紧。如果说刚才她还没能跟上，那么这只犬娘现在绝对做到了——她弓起背，眼睛上翻，紧窄的小穴也在你的高潮带动下紧紧收缩。");
         if(get_player().wetness() >= 5)
         {
            outputText("你的小穴随着每一次挺动欢快地喷涌出兴奋的淫液，彻底淹没了她的性器，也让你的气味污染了周围的池水。");
         }
         if(get_player().hasCock())
         {
            outputText("这整段时间里，惠特尼一直时不时用滚烫的双手和光滑的小腹抚弄、挑逗你的[cock biggest]；当你的高潮积蓄并将你吞没时，她也得到了应有的奖赏——你从[eachCock]中喷射出精液，先糊上她的脸，再糊满她紧致的乳房，同时仍然狠狠地骑弄着她。");
         }
         happyEndingMerge();
      }
      
      public function sophieFullTribalTats() : Boolean
      {
         if(numSophieTribalTats() == 4)
         {
            return true;
         }
         return false;
      }
      
      public function smallMilkyTribalTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "一片部落风纹身，尽是蜿蜒而色情的线条，横跨她的";
         if(param1 == 0)
         {
            smallMilkyCollarboneIntro();
            outputText("[say: 哦，嘿，这还挺漂亮的。][bathgirlName]在你收回笔时低头看着你画的图案，微笑起来。[say: 谢谢，[name]！]你亲昵地吻了吻她的额头，然后让她离开了。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1157,_loc2_);
         }
         else if(param1 == 1)
         {
            smallMilkyShouldersIntro();
            outputText("[pg][say: 那个，呃……]她说，等你弄完之后。[say: 你到底做了什么？]你咧嘴一笑，摸了摸那道永久标记，说那可是比蝴蝶好得多的东西，然后转身去把烙印工具收起来。");
            outputText("[pg][say: 是啊，可那到底是什么？[name]？喂？]");
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1158,_loc2_);
         }
         else if(param1 == 2)
         {
            smallMilkyLowerBackIntro();
            outputText("[pg][say: 那个，呃……]她说，等你弄完之后。[say: 你到底做了什么？]你咧嘴一笑，摸了摸那道永久标记，说那可是比蝴蝶好得多的东西，然后先把她放下，再去把烙印工具收起来。");
            outputText("[pg][say: 是啊，可那到底是什么？[name]？喂？]");
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1159,_loc2_);
         }
         else if(param1 == 3)
         {
            smallMilkyButtIntro();
            outputText("[pg][say: 那个，呃……]她说，等你弄完之后。[say: 你到底做了什么？]你咧嘴一笑，摸了摸那道永久标记，说那可是比蝴蝶好得多的东西，然后先把她放下，再去把烙印工具收起来。");
            outputText("[pg][say: 是啊，可那到底是什么？[name]？喂？]");
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1160,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function smallMilkySlotSelect() : void
      {
         slotSelectMenu("milky",smallMilkyBrandSelect);
      }
      
      public function smallMilkyShouldersIntro() : void
      {
         outputText("你命令她背对着你跪下，不许乱动。肤色黝黑的女孩照做了，挺直后背一动不动地待着；你把手指蘸进墨水，小心地在她身上画下图案，然后用纸将其封上。");
      }
      
      public function smallMilkyPropertyOfTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"[Name]的所有物\"纹在她的";
         if(param1 == 0)
         {
            smallMilkyCollarboneIntro();
            outputText("[say: [name]，][bathgirlName]忍不住笑得哼哼起来，深深的羞意染红了她晒成褐色的脸颊，她低头看着你写下的字。[say: 所有人都看得到这个！]你带着坏笑回答说，这才是重点。她懊恼地叹了口气，而你亲昵地吻了吻她的额头，然后转身离开。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1157,_loc2_);
         }
         else if(param1 == 1)
         {
            smallMilkyShouldersIntro();
            outputText("[pg][say: 那个，呃……]她说，等你弄完之后。[say: 你到底做了什么？]你咧嘴一笑，摸了摸那道永久标记，说那可是比蝴蝶好得多的东西，然后转身去把烙印工具收起来。");
            outputText("[pg][say: 是啊，可那到底是什么？[name]？喂？……]");
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1158,_loc2_);
         }
         else if(param1 == 2)
         {
            smallMilkyLowerBackIntro();
            outputText("[pg][say: 那个，呃……]她说，等你弄完之后。[say: 你到底做了什么？]你咧嘴一笑，摸了摸那道永久标记，说那可是比蝴蝶好得多的东西，然后先把她放下，再去把烙印工具收起来。");
            outputText("[pg][say: 是啊，可那到底是什么？[name]？喂？]");
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1159,_loc2_);
         }
         else if(param1 == 3)
         {
            smallMilkyButtIntro();
            outputText("[pg][say: 那个，呃……]她说，等你弄完之后。[say: 你到底做了什么？]你咧嘴一笑，摸了摸那道永久标记，说那可是比蝴蝶好得多的东西，然后先把她放下，再去把烙印工具收起来。");
            outputText("[pg][say: 是啊，可那到底是什么？[name]？喂？]");
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1160,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function smallMilkyMegaMilkTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"超大奶量\"纹在她的锁骨上。";
         smallMilkyCollarboneIntro();
         outputText("[say: [name]，][bathgirlName]忍不住笑得哼哼起来，深深的羞意染红了她晒成褐色的脸颊，她低头看着你写下的字。[say: 所有人都看得到这个！]你带着坏笑回答说，这才是重点。她懊恼地叹了口气，而你亲昵地吻了吻她的额头，然后转身离开。");
         FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1157,_loc2_);
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function smallMilkyLowerBackIntro() : void
      {
         outputText("你命令她趴到你的[legs]上。这个深肤色的女孩照做了，一动不动地待着；你把手指蘸进墨水，在她身上仔细画下图案，然后用纸封住墨迹。");
      }
      
      public function smallMilkyHeartTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "一枚饱满的红色爱心纹身，位于她的";
         if(param1 == 0)
         {
            smallMilkyCollarboneIntro();
            outputText("[say: 哦，嘿，这还挺漂亮的。][bathgirlName]在你收回笔时低头看着你画的图案，微笑起来。[say: 谢谢，[name]！]你亲昵地吻了吻她的额头，然后让她离开了。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1157,_loc2_);
         }
         else if(param1 == 1)
         {
            smallMilkyShouldersIntro();
            outputText("[pg][say: 那个，呃……]她说，等你弄完之后。[say: 你到底做了什么？]你咧嘴一笑，摸了摸那道永久标记，说那可是比蝴蝶好得多的东西，然后转身去把烙印工具收起来。");
            outputText("[pg][say: 是啊，可那到底是什么？[name]？喂？……]");
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1158,_loc2_);
         }
         else if(param1 == 2)
         {
            smallMilkyLowerBackIntro();
            outputText("[pg][say: 那个，呃……]她说，等你弄完之后。[say: 你到底做了什么？]你咧嘴一笑，摸了摸那道永久标记，说那可是比蝴蝶好得多的东西，然后先把她放下，再去把烙印工具收起来。");
            outputText("[pg][say: 是啊，可那到底是什么？[name]？喂？]");
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1159,_loc2_);
         }
         else if(param1 == 3)
         {
            smallMilkyButtIntro();
            outputText("[pg][say: 那个，呃……]她说，等你弄完之后。[say: 你到底做了什么？]你咧嘴一笑，摸了摸那道永久标记，说那可是比蝴蝶好得多的东西，然后先把她放下，再去把烙印工具收起来。");
            outputText("[pg][say: 是啊，可那到底是什么？[name]？喂？]");
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1160,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function smallMilkyCollarboneIntro() : void
      {
         outputText("你命令她脱掉衣服，跪在你面前，一动也别动。那名深肤色女孩照做了，安安静静地保持不动。你把手指蘸进墨水，小心翼翼地在她身上画下图案，然后用纸将其封定。");
      }
      
      public function smallMilkyCockCozyTattoo() : void
      {
         clearOutput();
         var _loc1_:String = "\"肉棒暖套\"纹在她的锁骨上。";
         smallMilkyCollarboneIntro();
         outputText("[say: [name]，][bathgirlName]忍不住笑得哼哼起来，深深的羞意染红了她晒成褐色的脸颊，她低头看着你写下的字。[say: 所有人都看得到这个！]你带着坏笑回答说，这才是重点。她懊恼地叹了口气，而你亲昵地吻了吻她的额头，然后转身离开。");
         FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1157,_loc1_);
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function smallMilkyButterflyTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "一只蝴蝶，它四片叶子般的翅膀仿佛正在振动，纹在她的";
         if(param1 == 0)
         {
            smallMilkyCollarboneIntro();
            if(numMilkyButterflyTats() < 3)
            {
               outputText("[pg]随着那四翼形状逐渐显现，她低头看着，脸上的喜悦也越来越浓。等你添上最后几笔红色点缀时，她兴奋得差点叫出声来，胸口也跟着轻颤，险些把图案毁掉。你一完成，她就凑上来，在你唇上重重亲了一口。");
               outputText("[pg][say: 太谢谢你了，[name]，真漂亮！我等不及要拿给这里的其他人看了！]你微笑着目送她离开。她的手指轻轻抚过新纹上的蝴蝶，还调整着衣服，想把它尽量展示出来。");
            }
            else
            {
               outputText("[pg][say: 哎，真是……] [bathgirlName]气恼地叹了口气；凭着丰富经验，她很快就看出你在画什么。你咧嘴一笑，又让她别动。[say: 我是说过我喜欢蝴蝶，[name]，]你画完后她说道。[say: 但你看看我！它们爬得到处都是，太夸张了。我看起来就像……像……]像是在蝴蝶堆里泡了个澡，你接话道，一边往后坐了坐，尽情欣赏她赤裸而布满蝴蝶图案的身体。而且这模样实在可爱极了。");
               outputText("[pg][say: 以后我可得非常小心，不能随便告诉你我喜欢什么了，]她一边转来转去欣赏自己，一边说道，显然正努力憋住怒气。[say: 我想——它们确实让我看起来不一样了，对吧？]你宠爱地吻了吻她的额头，又在那只蝴蝶上拍了一下，送她离开。");
            }
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1157,_loc2_);
         }
         else if(param1 == 1)
         {
            smallMilkyShouldersIntro();
            if(numMilkyButterflyTats() < 3)
            {
               outputText("[pg]当你描出一个四翼形状时，[bathgirlName]的背轻轻一颤；她已经明白你在做什么了。你咧嘴一笑，叫她别动。等你添上最后几笔红色点缀时，她还是兴奋得差点叫出声来，险些把图案毁掉。你一完成，她就立刻起身，在你唇上重重亲了一口。");
               outputText("[pg][say: 太谢谢你了，[name]！我等不及要拿给这里的其他人看了！]你微笑着目送她离开。她的手指轻轻抚过新纹上的蝴蝶，还调整着衣服，想把它尽量展示出来。");
            }
            else
            {
               outputText("[pg][say: 哎，真是……] [bathgirlName]气恼地叹了口气；凭着丰富经验，她很快就看出你在画什么。你咧嘴一笑，又让她别动。[say: 我是说过我喜欢蝴蝶，[name]，]你画完后她说道。[say: 但你看看我！它们爬得到处都是，太夸张了。我看起来就像……像……]像是在蝴蝶堆里泡了个澡，你接话道，一边往后坐了坐，尽情欣赏她赤裸而布满蝴蝶图案的身体。而且这模样实在可爱极了。");
               outputText("[pg][say: 以后我可得非常小心，不能随便告诉你我喜欢什么了，]她一边转来转去欣赏自己，一边说道，显然正努力憋住怒气。[say: 我想——它们确实让我看起来不一样了，对吧？]你宠爱地吻了吻她的额头，又在那只蝴蝶上拍了一下，送她离开。");
            }
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1158,_loc2_);
         }
         else if(param1 == 2)
         {
            smallMilkyLowerBackIntro();
            if(numMilkyButterflyTats() < 3)
            {
               outputText("[pg]当你描出一个四翼形状时，[bathgirlName]的背轻轻一颤；她已经明白你在做什么了。你咧嘴一笑，叫她别动，可等你添上最后几笔红色点缀时，她还是兴奋得差点叫出声来，险些把图案毁掉。你一完成，她就立刻起身，在你唇上重重亲了一口。");
               outputText("[pg][say: 太谢谢你了，[name]！我等不及要拿给这里的其他人看了！]你微笑着目送她离开。她的手指轻轻抚过新纹上的蝴蝶，还试着调整衣服，想把它尽量展示出来。");
            }
            else
            {
               outputText("[pg][say: 哎，真是……] [bathgirlName]气恼地叹了口气；凭着丰富经验，她很快就看出你在画什么。你咧嘴一笑，又让她别动。[say: 我是说过我喜欢蝴蝶，[name]，]你画完后她说道。[say: 但你看看我！它们爬得到处都是，太夸张了。我看起来就像……像……]像是在蝴蝶堆里泡了个澡，你接话道，一边往后坐了坐，尽情欣赏她赤裸而布满蝴蝶图案的身体。而且这模样实在可爱极了。");
               outputText("[pg][say: 以后我可得非常小心，不能随便告诉你我喜欢什么了，]她一边转来转去欣赏自己，一边说道，显然正努力憋住怒气。[say: 我想——它们确实让我看起来不一样了，对吧？]你宠爱地吻了吻她的额头，又在那只蝴蝶上拍了一下，送她离开。");
            }
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1159,_loc2_);
         }
         else if(param1 == 3)
         {
            smallMilkyButtIntro();
            if(numMilkyButterflyTats() < 3)
            {
               outputText("[pg]当你描出一个四翼形状时，[bathgirlName]的背轻轻一颤；她已经明白你在做什么了。你咧嘴一笑，叫她别动。等你添上最后几笔红色点缀时，她还是兴奋得差点叫出声来，险些把图案毁掉。你一完成，她就立刻起身，在你唇上重重亲了一口。");
               outputText("[pg][say: 太谢谢你了，[name]！我等不及要拿给——呃，总之，我真的很喜欢它！]你微笑着目送她离开。她的手指轻轻抚过新纹上的蝴蝶，还试着调整衣服，想把它尽量展示出来。");
            }
            else
            {
               outputText("[pg][say: 哎，真是……] [bathgirlName]气恼地叹了口气；凭着丰富经验，她很快就看出你在画什么。你咧嘴一笑，又让她别动。[say: 我是说过我喜欢蝴蝶，[name]，]你画完后她说道。[say: 但你看看我！它们爬得到处都是，太夸张了。我看起来就像……像……]像是在蝴蝶堆里泡了个澡，你接话道，一边往后坐了坐，尽情欣赏她赤裸而布满蝴蝶图案的身体。而且这模样实在可爱极了。");
               outputText("[pg][say: 以后我可得非常小心，不能随便告诉你我喜欢什么了，]她一边转来转去欣赏自己，一边说道，显然正努力憋住怒气。[say: 我想——它们确实让我看起来不一样了，对吧？]你宠爱地吻了吻她的额头，又在那只蝴蝶上拍了一下，送她离开。");
            }
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1160,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function smallMilkyButtIntro() : void
      {
         outputText("你命令她趴到你的[legs]上。肤色黝黑的女孩照做了，一动不动地待着；你把手指蘸进墨水，在她圆润漂亮的屁股上仔细画下图案，然后用纸封印上去。");
      }
      
      public function smallMilkyBrandSelect(param1:int) : void
      {
         var slot6:int;
         var _g5:FarmCorruption;
         var slot5:int;
         var _g4:FarmCorruption;
         var slot4:int;
         var _g3:FarmCorruption;
         var slot3:int;
         var _g2:FarmCorruption;
         var slot2:int;
         var _g1:FarmCorruption;
         var slot1:int;
         var _g:FarmCorruption;
         clearOutput();
         outputText("你要在她的" + slotNames[param1] + "上画什么？");
         menu();
         _g = this;
         slot1 = param1;
         addButton(0,"部落纹",function():void
         {
            _g.smallMilkyTribalTattoo(slot1);
         });
         _g1 = this;
         slot2 = param1;
         addButton(1,"爱心",function():void
         {
            _g1.smallMilkyHeartTattoo(slot2);
         });
         _g2 = this;
         slot3 = param1;
         addButton(2,"蝴蝶",function():void
         {
            _g2.smallMilkyButterflyTattoo(slot3);
         });
         _g3 = this;
         slot4 = param1;
         addButton(3,"专属",function():void
         {
            _g3.smallMilkyPropertyOfTattoo(slot4);
         });
         _g4 = this;
         slot5 = param1;
         addButton(4,"洗澡玩具",function():void
         {
            _g4.smallMilkyBathToyTattoo(slot5);
         });
         if(param1 == 0)
         {
            _g5 = this;
            slot6 = param1;
            addButton(5,"超大奶量",function():void
            {
               _g5.smallMilkyMegaMilkTattoo(slot6);
            });
         }
         if(param1 == 0 && get_player().hasCock())
         {
            addButton(6,"鸡巴暖套",smallMilkyCockCozyTattoo);
         }
         addButton(14,"返回",smallMilkySlotSelect);
      }
      
      public function smallMilkyBathToyTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"沐浴玩具\"纹在她的";
         if(param1 == 0)
         {
            smallMilkyCollarboneIntro();
            outputText("[say: [name]，][bathgirlName]忍不住笑得哼哼起来，深深的羞意染红了她晒成褐色的脸颊，她低头看着你写下的字。[say: 所有人都看得到这个！]你带着坏笑回答说，这才是重点。她懊恼地叹了口气，而你亲昵地吻了吻她的额头，然后转身离开。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1157,_loc2_);
         }
         else if(param1 == 1)
         {
            smallMilkyShouldersIntro();
            outputText("[pg][say: 那个，呃……]她说，等你弄完之后。[say: 你到底做了什么？]你咧嘴一笑，摸了摸那道永久标记，说那可是比蝴蝶好得多的东西，然后转身去把烙印工具收起来。");
            outputText("[pg][say: 是啊，可那到底是什么？[name]？喂？……]");
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1158,_loc2_);
         }
         else if(param1 == 2)
         {
            smallMilkyLowerBackIntro();
            outputText("[pg][say: 那个，呃……]她说，等你弄完之后。[say: 你到底做了什么？]你咧嘴一笑，摸了摸那道永久标记，说那可是比蝴蝶好得多的东西，然后先把她放下，再去把烙印工具收起来。");
            outputText("[pg][say: 是啊，可那到底是什么？[name]？喂？]");
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1159,_loc2_);
         }
         else if(param1 == 3)
         {
            smallMilkyButtIntro();
            outputText("[pg][say: 那个，呃……]她说，等你弄完之后。[say: 你到底做了什么？]你咧嘴一笑，摸了摸那道永久标记，说那可是比蝴蝶好得多的东西，然后先把她放下，再去把烙印工具收起来。");
            outputText("[pg][say: 是啊，可那到底是什么？[name]？喂？]");
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1160,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function slotSelectMenu(param1:String, param2:Function) : void
      {
         var _loc8_:int = 0;
         var _loc3_:StringMap = FarmCorruption.tattooFlagMap;
         var _loc4_:Array = param1 in StringMap.reserved ? _loc3_.getReserved(param1) : _loc3_.h[param1];
         var _loc5_:Array = ["锁骨","肩膀","后腰","屁股"];
         menu();
         var _loc6_:int = 0;
         var _loc7_:int = int(_loc5_.length);
         while(_loc6_ < _loc7_)
         {
            _loc8_ = _loc6_++;
            if(!(int(_loc4_[_loc8_]) in KFLAGS.flags.h))
            {
               addButton(_loc8_,_loc5_[_loc8_],(function(param1:Array, param2:Array):Function
               {
                  var _g:Array = param1;
                  var a1:Array = param2;
                  return function():void
                  {
                     _g[0](int(a1[0]));
                  };
               })([param2],[_loc8_]));
            }
         }
      }
      
      public function slavesAtFarmMenu() : void
      {
         var _g1:Vapula;
         var _g:SophieBimbo;
         menu();
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1079) == 1)
         {
            addButton(0,"艾米莉",get_game().amilyScene.amilyFollowerEncounter);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1080) == 1)
         {
            addButton(1,"乔乔",get_game().jojoScene.corruptCampJojo);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1081) == 1 && get_game().sophieBimbo.bimboSophie())
         {
            _g = get_game().sophieBimbo;
            addButton(2,"索菲",function():void
            {
               _g.approachBimboSophieInCamp();
            });
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1084) == 1)
         {
            _g1 = get_game().vapula;
            addButton(3,"瓦普拉",function():void
            {
               _g1.callSlaveVapula();
            });
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1085) == 1)
         {
            addButton(4,get_game().latexGirl.gooName(),get_game().latexGirl.approachLatexy);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1089) == 1)
         {
            addButton(5,get_game().milkWaifu.get_milkName(),get_game().milkWaifu.milkyMenu);
         }
         addButton(14,"返回",farmMenu);
      }
      
      public function slavesAtFarm() : Boolean
      {
         if(numSlavesAtFarm() > 0)
         {
            return true;
         }
         return false;
      }
      
      public function shouldersIntro() : void
      {
         outputText("你命令她背对着你跪下，一动也别动。你那苗条而赤裸的犬娘照做了，安安静静地保持不动。你把手指蘸进墨水，小心翼翼地在她身上画下图案，然后用纸将其封定。[say: 你画了什么，[master]？]她迫不及待地问道。");
         outputText("[pg]你笑着欣赏了一番自己的杰作，然后告诉她，她得去问你的其他奴隶……还得祈祷她们会说实话。[say: 啊，不要嘛，快告诉我那是什么！是不是脏话？[Master]，最好别是什么会让奴隶们笑话我的东西。]");
      }
      
      public function rootScene() : void
      {
         clearOutput();
         spriteSelect(SpriteDb.get_s_whitney());
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1120) == 2)
         {
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1120,3);
            outputText("[say: [name]？[name]！]你转过身，看见惠特尼羞怯地从谷仓的阴影里走出来。她保留了纤细的身形和朴素的衣服，不过她的毛发已经全都消失，取而代之的是同样沙色的皮肤。人类的双脚从她的裙摆下露出来，还有……嗯。你花了片刻细细端详她的人类面容，那张脸依然是典型的惠特尼：修长而柔和的五官，单薄却轻松的笑容，红润的气色衬得高颧骨更加分明；漂亮，但称不上美丽。她唯一保留下来的犬类特征，是那双耷拉着的耳朵和短短翘起的尾巴。不对；当你赞许地微笑时，她也如释重负般咧嘴回笑，露出相当尖锐的牙齿，以及一条比正常人更细的舌头。尽管如此，总的来说，这番努力已经相当不错了。");
            outputText("[pg][say: 真是个好女孩，]你说道。你慢慢走近她。[say: 如此迅速、如此心甘情愿地改变，是个极好的征兆。你和我一定会一起走得很远。]你再次站到她正前方，再次深深凝视着她的棕色眼睛；你一直等到她的呼吸又一次变得浅促。[say: 现在，我们刚才说到哪儿了？]");
            doNext(dontDeFurDoge);
            return;
         }
         if(!whitneyCorrupt())
         {
            outputText("你站在自己常用的那处高坡上，俯视着你如今入股的农场。");
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1094) == 1)
            {
               outputText("一台巨大的机器已经装进了挤奶棚里，它笨重而圆胖，顶部呈圆锥形。粗大的管道像金属藤蔓一样从它身上爬上屋顶，白烟正从它的汽笛烟囱里忙碌地翻涌而出。");
            }
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1109) == 1)
            {
               outputText("在胡椒地旁边，又种下了另一种作物——一片郁郁葱葱的绿色灌木。它们细细的茎在微风中悠闲地摇摆着。");
            }
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1164) > 1)
            {
               outputText("[pg]看起来，惠特尼一直在她的农舍内外进行大规模翻修。前厅的窗户已经被拆掉，所有东西上都盖着白布，而从她挖出的那些狭窄沟槽来看，她似乎正在铺设管道。不管她在建什么，现在都还只是个半成品。");
            }
         }
         else
         {
            outputText("你站在高坡上，俯瞰着你的奴隶农场。");
            if(get_silly())
            {
               outputText(get_player().mf("你突然不可抗拒地想来根雪茄。","你突然不可抗拒地想拿个长烟嘴。"));
            }
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1094) == 1)
            {
               outputText("一台巨大的机器已经装进了挤奶棚里，它笨重而圆胖，顶部呈圆锥形。粗大的管道像金属藤蔓一样从它身上爬上屋顶，白烟正从它的汽笛烟囱里忙碌地翻涌而出。");
            }
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1109) == 1)
            {
               outputText("在胡椒地旁边，又种下了另一种作物——一片郁郁葱葱的绿色灌木。它们细细的茎在微风中悠闲地摇摆着。");
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1086) > 0)
         {
            outputText("[pg]整座农场都笼罩着一种难以言喻的腐化气息；你能在喉咙深处尝到它的味道，盯着这片地方看久了，它几乎就像长时间注视紫光后烙在视网膜上的灼痕一样清晰。这里显然已经被某个恶魔打上了标记。");
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1087) > 0)
         {
            outputText("[pg]你周围的作物和青草似乎都燃烧着生命力，甚至旺盛得近乎病态。形状惹人遐想的藤蔓缠上了一两棵树，有些野花看起来也……不太一样了。霍莉的祝福让农场上的一切都生长得更快，但如果你仔细盯着脚边的草丛看，仍能分辨出其中潜藏的紫色腐化卷须。");
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1079) == 1)
         {
            outputText("[pg]艾米莉正待在胡椒地里，拿着小铲子兴高采烈地忙活着。要不是她浑身发紫，而且除了工作手套外一丝不挂，恐怕很难相信她已经被腐化了。");
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1080) == 1)
         {
            outputText("[pg]你看不见乔乔，但你毫不怀疑，从你抵达的那一刻起他就已经察觉到了你的存在，而且此刻就在附近某处注视着你。");
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1081) == 1 && get_game().sophieBimbo.bimboSophie())
         {
            outputText("[pg]你看不见索菲，但鸡舍里传来了她那很有辨识度的咕咕声和咯咯笑声。");
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1081) == 1 && !get_game().sophieBimbo.bimboSophie())
         {
            outputText("[pg]索菲在鸡舍顶上搭了一个巨大的巢，正若有所思地望着湖面。她发现你在看她时，明显精神一振，开始梳理自己的羽毛。");
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1082) == 1)
         {
            outputText("[pg]伊兹玛正坐在橡树下惠特尼以前待的位置，蜷着身子埋头读书。");
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1083) == 1)
         {
            outputText("[pg]伊莎贝拉正把钢制罐子搬进搬出挤奶棚，一边干活一边欢快地哼着歌。");
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1084) == 1)
         {
            outputText("[pg]瓦普拉懒散地靠在谷仓墙上，看起来像是全世界最暴躁的单人成军女混混。就连附近横七竖八昏迷着的几只小恶魔，似乎也没能让她心情好起来。");
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1085) == 1)
         {
            outputText("[pg]你能看见惠特尼门廊底下有什么黑色东西湿漉漉地闪着光，那只可能是某种特定的乳胶黏液。");
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1089) == 1)
         {
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,870) > 0)
            {
               outputText("[pg][Bathgirlname]果不其然待在牛棚里，正在给牛挤奶。她看起来晒黑了些，精神明亮又快乐；乡间空气显然很适合她。");
            }
            else
            {
               outputText("[pg][Bathgirlname]坐在牛棚旁自己的水箱边缘，缓慢而迷离地揉弄着她那对巨乳。她的眼神空洞，只有落到你身上时才会透出期待。");
            }
         }
         farmMenu();
      }
      
      public function repeatWhitneyDomPleasure() : void
      {
         outputText("你说你想要放松一下。");
         outputText("[pg][say: 离上次才过了这么点时间？]惠特尼欣喜地低声说着，紧紧挽住你的胳膊。[say: 看来我让你放松得还不够狠。]她又一次领你走进她的屋子，又一次把你带进她的房间，又一次牢牢锁上门，然后狂热地把你推到她的床上；皮带和搭扣在你身下挪动着，而她已经开始脱衣。");
         outputText("[pg][say: 脱掉，]她简短地命令道。你温顺地照做，看着她也开始脱衣。她迅速扯下自己朴素的工作服，仿佛那些衣服让她很烦躁；她并不是因为想在你面前表演什么，而只是压倒性地渴望开始。那种如今已经熟悉的温热与战栗感又回来了；若说你并不欢迎它，那就是在撒谎。");
      }
      
      public function prosperityGoNotCorrupt() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你问她帮手的情况怎么样了。");
         var _loc1_:Boolean = false;
         var _loc2_:Boolean = false;
         if(farmProtection() < 12)
         {
            _loc1_ = true;
         }
         if(farmValue() < 12)
         {
            _loc2_ = true;
         }
         if(_loc2_ && _loc1_)
         {
            outputText("[pg]她恼火地耸了耸肩。[say:以前我一个人也能过得好好的，]她说。[saystart]直到你开始张口就要 20% 的收成。你以为宝石会从玉米秆上长出来吗？");
            if(numFollowersAtFarm() + numSlavesAtFarm() + numLoversAtFarm() == 0)
            {
               outputText("随便给我送个像样的人手——谁都行——我就能开始想法子把这地方经营得更好。");
            }
            else
            {
               outputText("我需要更多人手，才能把这地方的潜力发挥出来。至少得是更合适的人手。");
            }
            outputText("[sayend]");
         }
         else if(!_loc2_ && _loc1_)
         {
            outputText("[pg][say:你给了我不少好工人，也给了我不少能赚钱的人手，我也一直交上来不少农产品。]她叹了口气。[say:麻烦在于，东西多了也会招来麻烦。小恶魔、豺狼人之类的。要是没人拦着它们，它们就会自己动手拿。我需要些强壮的人来这儿，战士、看守，能阻止东西在夜里凭空消失的人。你明白吧？]");
         }
         else if(_loc2_ && !_loc1_)
         {
            outputText("[pg][say:晚上倒是安全得很，这我可以跟你保证。你把这地方护得比银行金库还严实。]惠特尼耸耸肩。[say:问题是，金库里是空的。守卫是不错，可他们又不靠刨地过活。我需要能吃苦干活的人，能产出东西、能赚钱的人。眼下这地方最缺的就是这些。]");
         }
         if(!_loc2_ && !_loc1_)
         {
            outputText("[pg][say:也没什么好抱怨的。这地方现在比我记事以来都要好，就算追溯到我奶奶那会儿也一样。只要我们能保持这份勤劳和安全，钱就会一直这么赚下去。]你面无表情地看着她，她一时间有些慌了。[say:不是……你不会是——？呃，要想赚更多钱，唯一的办法就是——可我绝不会……]她说到一半停住了，没有看你。");
         }
         dogeNotCorruptYetMenu();
      }
      
      public function propertyTattoo(param1:int) : void
      {
         clearOutput();
         whitneySprite();
         var _loc2_:String = "\"[Name]的所有物\"纹在她的";
         if(param1 == 0)
         {
            collarboneIntro();
            outputText("[pg][say: 我哪还需要别人提醒这种事啊，[master]，]她低头看见那行如今刻在自己胸口、任谁都能看见的字，又恼又窘地笑着说道。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1129,_loc2_);
         }
         else if(param1 == 1)
         {
            shouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1130,_loc2_);
         }
         else if(param1 == 2)
         {
            lowerbackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1131,_loc2_);
         }
         else if(param1 == 3)
         {
            buttIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1132,_loc2_);
         }
         tattooMerge();
      }
      
      public function orgyRoomTalk() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你走近挤奶棚外的惠特尼时，听见她正开心地哼着小曲；她一看见你，就兴奋地冲过来抱住你的手臂。");
         outputText("[pg][say: 已经完工了，[master]，快来，让我带你看看！] 她牵着你的手，把你带到她那座白色木板农舍的正面。那正面带着一股刚重建完的光秃又别扭的感觉，然后她又拉着你进了屋。她把你带到前厅，满脸自豪地咧嘴笑着，侧身让你进去。");
         outputText("[pg]天哪，她说这会是个放松室？你只扫了一眼，就立刻觉得自己更可能在这里把自己折腾到腿软。她把整个房间都刷成了深红色，摆上黑色按摩台和一片片起伏的软垫，还给这里的煤气灯装上了昏暗的花纹灯罩。厚重的紫色窗帘拉上后，效果至少可以说是相当撩人。角落里摆着压轴之作：一个方方正正的下沉式浴池，用黄铜和瓷器装点得熠熠生辉，显然就是她承诺过的热水浴池。你的女管事几乎是用她温热的小手把你拖到浴池边，给你演示它的用法。");
         outputText("[pg][say: 我爷爷几十年前装过一台抽水泵，可以把湖水抽上来，] 她说道。[say: 他以前常说，冬天腰痛还要去户外厕所，一次就够受一辈子了。不过魔法加热器是我买的。贵是贵，可在农场忙了一整天之后泡一下，真的特别舒服。] 浴池里已经有少量的水；她拧了下旋钮，更多水便从龙头里涌出来。蒸汽懒洋洋地向上卷起，同时还有一股淡淡的、令人不快的硫磺味。");
         outputText("[pg][say: 还有……只要把发电机稍微扩建和调整一下……] 她拧动另一个黄铜旋钮，下面的水里顿时涌出大量气泡，水面翻腾起来。你看得太入神，以至于有什么东西在你耳边嘶地一响时，你吓了一跳。惠特尼带着歉意讨好地笑了笑，手里拿着一个带泵嘴的玻璃瓶。浓重的辛香气味钻进你的鼻子，盖住了臭鸡蛋般的味道。她真的什么都想到了。");
         outputText("[pg]你努力不让自己显得太过惊叹，转过身去，继续打量她这间连装都懒得装成按摩院的房间。热水浴池旁的架子上，她堆着各种瓶装精油和假阳具。也许是你看错了，但那里好像还堆着不少别的东西。黑色的，皮革制的东西。");
         if(whitneyDom())
         {
            outputText("眼前这一幕让一阵战栗般的快意沿着你的脊背窜下去。[say: 你不会以为我会忘了那些吧，[master]？我们都知道，要让你好好放松，它们有多重要，]惠特尼低声说道，把她温热柔软的身体贴上你的身侧。");
         }
         else
         {
            outputText("你冲这些东西挑了挑眉，惠特尼咯咯笑起来，脸也红了。[say: 只是以防你想冒险一点嘛，[master]。或者，呃，想要帮忙的时候。]");
         }
         outputText("那些东西你或许还认得出来，但在房间昏暗的暮色里，靠着远处墙边立着的最后那件物什，你就完全不知道是什么了。它至少有四英尺高，看起来像一只装饰华丽的石瓮：圆圆的底座，细长的躯干，顶端有某种方形装置，还有一串长管从柄部伸出来。旁边摆着一只很小的火盆，底部有几颗木炭正微弱地吐着热气。");
         outputText("[pg][say: 我去买补给的时候在巴扎集市看见了这个，就也忍不住买下来了。]惠特尼开心地说。她拿出一团棕色的浆块，塞进方形隔仓里，然后往顶端那层薄薄的金属网上撒了几粒小炭。[say: 你知道麻根吧，[master]？他们会拿它来做硬糖，我在辣椒旁边也种了一些。嗯，要是像这样用的话，效果会好得多……]她拿起其中一根软管，轻轻往里面吹了一口。装置底部传来一阵细微的冒泡声。她把软管递到你面前。");
         outputText("[pg]你小心地把它含进嘴里，轻轻吸了一口。烟雾立刻冲下你的喉咙，但并不像你预想中那样呛人又致癌；相反，你只吸到一口温暖、芬芳的空气，里面带着一丝黏腻的草药味。你把烟管递回去，若有所思地皱起眉。你没有立刻感觉到什么效果。除了……你伸出手，试探性地碰了碰惠特尼的下颌。你的指尖感觉略微变钝了，触觉也迟钝了一点。");
         outputText("[pg][say: 它的劲儿远远比不上那种糖，]犬女兴奋地解释道。[say: 过一阵子就会退掉，不过要是多吸几口，你在这里能撑的时间可就会比平常久得多。]她的呼吸变得更急促，那颗堕落的脑袋里已经被各种生根发芽般的可能性淹没了。");
         if(!whitneyDom())
         {
            outputText("[say: 这正是一个后宫主人需要的东西，[master]——有了这个，你就能每晚整夜照顾我和你的其他荡妇了！]");
         }
         else
         {
            outputText("[say: 要是你吸了这个，我就能对你做好多好多事，[master]。而且能做上好久。想想看嘛！]");
         }
         outputText("你完全没有觉得头晕或神志飘忽——要说的话，你反而觉得自己对周围稍微更敏锐、更能掌控了，只是皮肤像是蒙上了一层隐约发绒的东西。");
         outputText("[pg]你对这一切惊叹不已。惠特尼把她天生的实用头脑，和你植入她脑中的肮脏想象力结合在了一起，在这里给了你一件你从没开口要求、却现在才意识到自从开始收集母狗以来就迫切需要的东西：一间设备齐全的后宫房。想到要彻底把它派上用场，热血便向你的胯下沉去。你高兴地一把搂住她的腰，笑着问她，究竟是什么样的下流小姑娘，签了约要做理疗室，结果却弄出了一间妓院？");
         outputText("[pg][say: 你不会真以为我要做一间无聊的老诊所吧？]她也咯咯笑着回应。她的双手蛇一般滑向你的[butt]，双眼直勾勾望进你眼里，欲火一阵阵涌动。[say: 我知道你喜欢什么，[master]。而你想要的，也就是我想要的。]你饥渴地吻住她，把嘴压上她的唇，舌头缠上她的舌；你们的手贪婪地游走在彼此身体上，而你知道，她正和你一样清晰地想象着你们会在这里对彼此做些什么。");
         outputText("[pg]你不情愿地抽身退开，免得太过投入。你一边朝门口走去，一边告诉她，等你稍后回来彻底试用这里的时候，她最好已经做好准备。对此她只是咬住嘴唇；你离开农舍时，能感觉到她的目光正灼灼地烧在你背上。");
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function orgyRoomSubMassageHappyEnding() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你默默地从石台上起身，伸手搂住你的女按摩师紧致的身体。她身上散发出的热意渗入你体内，而你的手则顺着她背部的曲线滑下，揉捏起她紧翘而柔软的屁股。");
         outputText("[pg][say: [master]……]惠特尼咯咯笑着，垂下那双带着红色斑点的眼睛，双手抵在你胸口，装出一副矜持的模样。[say: 要是你把油弄得到处都是，会把我们做过的肌肉理疗全毁掉的——哎呀！]");
         if(get_player().get_tallness() >= 67)
         {
            outputText("你一个动作便把她温热紧实的身体甩到肩上。你在她耳边低吼着告诉她，如果她想完成让你每一处都彻底放松的工作，那她还有很多事要做。");
            outputText("[pg][say: 哎呀！]你脑后传来她带着笑意的回答。[say: 那你最好让我看看，你身上还有哪儿需要好好按摩……]你小心地把她抱到热水浴池边，一边走一边褪下她的工作短裙，然后把她放在池沿上。她不需要任何帮忙就把自己的衬衫扯了下来；当你慢慢踏入翻着泡沫的热水时，她饥渴的目光在你涂满油、赤裸的身体上来回游移。");
         }
         else
         {
            outputText("你收紧握住她翘臀的手，低吼着告诉她，如果她想完成让你每一处都彻底放松的工作，那她还有很多事要做。");
            outputText("[pg][say: 哎呀！]她笑着回应道。[say: 那你最好让我看看，你身上还有哪儿需要按摩了，大[boy]……]你带她来到热水浴池边，一边走一边褪下她的工作短裙，然后把她放在池沿上。她不需要任何帮忙就把自己的衬衫扯了下来；当你慢慢踏入翻着泡沫的热水时，她饥渴的目光在你涂满油、赤裸的身体上来回游移。");
         }
         outputText("[pg]你叹了口气，身体一点点沉进浴池里，热水与热气包裹住你的四肢和胯间，简直像是给你这副被宠坏了的身体又来了一场按摩。要是还能再更安宁一点，你恐怕就要直接躺平了。话虽如此……你仍半眯着眼，欣赏着极为赏心悦目的景象：惠特尼也在对面跟着沉入水中，她纤细的棕色身体没进热水里，当她小巧漂亮的小穴消失在翻涌的水面下时，还轻轻喘了一声。即便在这浓重的湿热中，她那对端正挺翘的乳房上的乳头依旧硬得像石头，仿佛在责怪般直指着你；血液不断涌向你的胯下，让你在热气中一阵头晕目眩。");
         if(get_player().hasCock() && get_player().cockThatFits(whitneyVagCapacity() * 1.33) != -1 && get_player().hasVagina())
         {
            outputText("你花了好一会儿考虑，该用自己哪一副性器来满足自己。");
         }
         menu();
         if(get_player().cockThatFits(whitneyVagCapacity() * 1.33) != -1)
         {
            addButton(0,"男性",subHappyEndingMale);
         }
         if(get_player().hasVagina())
         {
            addButton(1,"女性",subHappyEndingFemale);
         }
      }
      
      public function orgyRoomSubMassage() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你用夸张而疲惫的语气宣布，自己又结束了一天让玛瑞斯屈膝臣服的辛劳，现在需要你宠物按摩师的服务。");
         outputText("[pg][say: 马上来，[master]！]惠特尼的目光在你身上飞快扫了一遍，随即站起身，朝农舍跑去。你则用更悠闲的步子跟在后面，享受着农场温暖而闷热的空气，也给她留出准备的时间。等你踱过她的前门，走进那间群欢室时，一股更温暖的气息便迎面扑来。");
         outputText("[pg]惠特尼已经让热水浴缸咕噜咕噜地冒着泡，并在按摩石板周围点燃了许多蜡烛，让这个豪华、充满异国情调的空间充满了温暖和光线的柔和光芒。她把手在毛巾上擦了擦，微笑着指了指石板。你慢慢地脱下衣服。在最近经历了所有那些疯狂的战斗和性爱之后，仅仅是这个动作，在这个安全、温暖的环境中，在你信任的奴隶的陪伴下，裸露你的肉体，确实感觉非常好。你叹了口气，因为");
         if(get_player().isBiped())
         {
            outputText("爬上加热过的石台，把下巴搁在尽头软垫上、交叠的双手上");
         }
         else if(get_player().isDrider())
         {
            outputText("踢踏着步足过去，将蜘蛛的下腹伏到温热的大理石上，随后也把人类的上半身放低。惠特尼很有先见之明，把石台做得相当长，于是你舒舒服服地完成了这一连串动作");
         }
         else if(get_player().hasTailInsteadOfLegs())
         {
            outputText("游移过去，滑上加热过的石台，把下巴搁在尽头软垫上、交叠的双手上。你任由自己又长又沉的尾巴盘落到下方的地板上");
         }
         outputText("。");
         outputText("[pg]你身后传来布料落到地上的声音，直到片刻之后你感觉到惠特尼那" + (whitneyDefurred() || get_noFur() ? "光滑的" : "毛茸茸的") + "大腿蹭到你身侧，并轻轻坐到你后腰上，你才意识到那是她在脱衣服。她湿润的小穴正顶着你[butt]隆起的地方，你实在不太确定自己要怎么在这种情况下放松下来，不过眼下你还是愿意先相信她。");
         outputText("[pg][say: 好的，[master]，]她叹了口气。你听见头顶上方传来涂满油的手掌相互揉搓的声音。[say: 首先，我要你开始慢慢地、深深地呼吸。可以的话，就跟着我的节奏来。]你照她说的做，把肺部完全填满空气，再缓缓呼出。起初你还有些不自在，但当你倾听她的呼吸，并让自己的节奏与之合拍时，这种可感知的韵律让房间里的宁静更深了一层。漫长的片刻里，空间中只剩下你们同步的呼吸声，让你感觉自己与跪坐在你身上的犬女紧紧相连。");
         outputText("[pg]当你把气完全呼出时，她温热而抹了油的双手按上你肋骨下缘，随后在你吸气时，沿着脊椎两侧缓缓向上推去。等按到你的肩膀时，她的黑色指甲极轻地陷入少许，接着又抽回手，在你呼气时让手指向下滑去，几乎像是在轻柔地把你胸腔里的空气按出来。温热油滑的压力又一次随着你的呼气向上掠过……她配合着你的呼吸而动，让那种与她相连的感觉变得更加强烈，仿佛你的身体是一件乐器，而她正以完美的节拍为你伴奏。");
         outputText("[pg]她的双手移到你的肩头，合力按压，并在你的两侧肩胛骨上旋转揉动，随后又安抚般地回到你的背上。她顺着弧度向下时，非常轻柔地压过你脊椎的起伏，让一阵阵细小的酥麻感在你身体深处游走。每一处都按完后，她那双不断探索、滑动的手指转向你的手臂，顺着肌肉的纹理，在你的肱二头肌上来回推揉，直到它们软得像被揉开的面团。");
         outputText("[pg]等你的上半身在她油滑的掌心下彻底放松后，她的动作稍微加重了一些；每一次感官十足的滑动到末尾，她都会稍稍用力抓按，处理她在你肌肉深处找到的硬结与紧绷。而这样的地方还真不少。自从来到玛瑞斯后，你一直过着野性而冲动的生活，身在其中时并没有真正意识到，但你的身体早已写满了长途跋涉、战斗和露宿荒野的痕迹。惠特尼近乎虔诚地在你躯干上寻找每一处劳损与紧绷，再轻轻将它们挤揉开来，仿佛你是一团乱线，而她正一丝不苟地替你解开。你不由得发出带着感激的低吟。");
         outputText("[pg]你几乎完全沉溺在她双手滑动带来的安抚之中，但在你与她同频呼吸时，你迷迷糊糊地察觉到，她的呼吸并不总是平稳；有时会微微一滞，或是稍稍加快。又享受了片刻她的触碰后，你开始注意到这种变化出现的时机：每当她的手指抚过你冒险生涯中留下的那些浅浅伤疤和肿块时，都会如此。你咧嘴一笑；一想到她在抚慰你那些艰难胜利的证明时会因此有些兴奋，实在令人愉快。");
         outputText("[pg]随着她按完你的手臂，将手掌滑向你的[butt]，暧昧的张力也逐渐升高。你不觉得自己身体的这一部分有多少需要按摩的地方，但她还是照样做了起来，一边深深叹息，一边用抹了油的双手在你那");
         if(get_player().butt.rating >= 6)
         {
            outputText("柔软的");
         }
         else
         {
            outputText("健壮的");
         }
         outputText("屁股隆起处缓慢地大范围打着圈。等她把你的屁股揉得发红又光滑后，她将一只温热油腻的手探入你的[hips]之间，并且");
         if(get_player().hasCock())
         {
            outputText("握住你的[cock]");
         }
         else if(get_player().hasVagina())
         {
            outputText("描摹着你的[vagina]入口");
         }
         outputText("停留了片刻……随后又伴着一声低哑的轻笑滑了出来，继续往你的臀胯按去。");
         outputText("[pg]这里更厚实的肉需要更久才能揉松，但你的宠物很有耐心。最终，在她掌腹持续不断、顺滑如水的推揉下，你大腿中交织的肌肉与肉感渐渐放松下来。她的手指沿着那些线条与凹陷不断探索，把埋在其中的细小酸痛与劳损一一释放。她停下来又往手上抹了些油，并在石台上再往下挪了挪，最后开始处理你的[legs]。");
         if(get_player().isBiped())
         {
            outputText("[pg]她先在你的小腿上花了一小会儿，随后用油滑的双手包住你的一只[foot]。");
            if(!(get_player().lowerBody.type == 1 || get_player().hasTailInsteadOfLegs() || get_player().lowerBody.type == 8 || get_player().lowerBody.type == 11))
            {
               outputText("当她按摩你脚底柔软的足弓时，一股纯粹的快感顺着你的[leg]脉络般向上窜去，让你不由得张开了嘴，也让你的");
               if(get_player().hasCock())
               {
                  outputText("鸡巴胀硬");
               }
               if(get_player().hasCock() && get_player().hasVagina())
               {
                  outputText("，你的");
               }
               if(get_player().hasVagina())
               {
                  outputText("小穴湿润起来");
               }
               outputText("。");
               outputText("从你身体最底端通往胯间的地方，肯定有什么神经是直接相连的，因为天啊，这感觉实在不该舒服成这样。她用拇指在你脚底较粗糙的肉垫上打着圈，又把温热的手指探入你");
               if(get_player().lowerBody.type == 6 || get_player().lowerBody.type == 10 || get_player().lowerBody.type == 13 || get_player().lowerBody.type == 18)
               {
                  outputText("爪子");
               }
               else
               {
                  outputText("脚趾");
               }
               outputText("，随后又有意回到你的足弓处轻轻抚按，尽情撩拨那条敏感的神经连结，直到你沉入这份意想不到的极乐之中……然后她才慢慢松开，让你愉悦地沉浸在这样的认知里：同样缓慢而美妙的呵护，马上就要倾注到你的另一只[foot]上了。");
            }
            else
            {
               outputText("[pg]她在你关节奇特的小腿上稍作停留，随后用沾满油的双手包住一只蹄子。她按摩着你脚底那层不屈角质后方柔软的内侧时，一阵纯粹的快感沿着你的腿脉络般窜上来，让你不由得张开了嘴，也让你的");
               if(get_player().hasCock())
               {
                  outputText("鸡巴胀硬");
               }
               if(get_player().hasCock() && get_player().hasVagina())
               {
                  outputText("，你的");
               }
               if(get_player().hasVagina())
               {
                  outputText("小穴湿润起来");
               }
               outputText("。");
               outputText("从你身体底部到胯间，一定有一条直通的神经连线，因为天啊，这感觉实在不该这么舒服。她用拇指在血肉与蹄子相接的地方打着圈，将卡在里面的每一点泥土和碎石都清理出来，随后又有意回到内侧轻轻抚按，尽情撩拨那条敏感的神经连结，直到你沉入这份意想不到的极乐之中；然后她才慢慢松开，让你愉悦地沉浸在这样的认知里：同样缓慢而美妙的呵护，马上就要倾注到你的另一只蹄子上了。");
            }
         }
         else if(get_player().isDrider())
         {
            outputText("[pg]你原本真没指望哪怕最忠心的仆人，也会尝试按摩你那庞大又复杂、由八条外骨骼腿组成的行动方式，但惠特尼似乎下定决心要试一试。她双手环住你一条覆甲的腿干，将手指滑入主要关节，小心而贴近地揉按起来。拥有八条腿的你，平时很容易忽略某一条腿偶尔产生的酸痛与僵硬——如今这样一处通常被忽视的身体部位受到如此细致的呵护，感觉确实非常不错。你抬起那条腿，好让她继续处理下一个关节，同时低声问她到底是在玛瑞斯的哪里学会给蜘蛛按摩的。");
            outputText("[pg][say:这只是看着你学来的，[master]，]她轻声回答，而愉悦的感觉正淹没你的第二处关节。[say:当你爬——走动的时候，就能看出压力落在哪里、积在哪里。所有经常四处活动的动物都有同样的需求，至少在关节这方面是这样。]");
            outputText("[pg][say:这么说，你经常看我？]你的腹底后方陷入一阵沉默，那只摸索揉按、沾着油的手转向了你的第二条腿。你咧嘴一笑。[say:我想，看着你的[master]四处移动，对你来说几乎是一种受虐般的体验吧。如此异质又令人不安的存在，如今却永远和快感与服从联系在了一起。是这样吗？你就是忍不住盯着我美丽又致命的形态，因为那对你来说几乎像是一种淫荡的惩罚？]");
            outputText("[pg][say:差、差不多是那样，]惠特尼颤抖着低声说道。[say:请抬下一条腿，[master]。]你平静地微笑着，将下一个复杂的关节点抬进她温暖而等待着的掌握之中。她把油揉进你每一条腿所花的时间，几乎又和她花在你身体其余部位上的时间一样久，但这完全值得。");
         }
         else if(get_player().hasTailInsteadOfLegs())
         {
            outputText("[pg]你原本真没指望哪怕最忠心的仆人，也会尝试按摩你长长的[if (isNaga) {、爬行类般的|[if (isMer) {、水生的|下}]}]半身，但惠特尼似乎下定决心要试一试。她的双手沿着你臀部与管状下半身之间厚实的连接处四处滑动，缓缓向下，只是轻轻抚过你上半段的鳞片，让其在闪亮的快感中泛起光泽。不过当她接近纤细的末端时，动作开始变得更加用力，揉松你皮肤下厚实而顽固的肌肉，尤其专注于你腹侧那些柔韧的肌群——你正是靠它们流动般的起伏来移动。耐心的按摩让慵懒的快感沿着你的躯干脉络般上涌，你愉悦地叹了口气，问她到底是在玛瑞斯的哪里学会给蛇按摩的。");
            outputText("[pg][say:这只是看着你学来的，[master]，]她轻声回答，而放松的感觉正淹没你的下半身。[say:当你滑——移动的时候，就能看出压力落在哪里、积在哪里。你这里也许没有关节，但这并不代表你没有和那些有“铰链”的动物一样的需求。]");
            outputText("[pg][say:这么说，你经常看我？]你身后陷入一阵沉默，那只摸索揉按、沾着油的手几乎一路向下移动到了你的尖端。");
            if(get_player().tongue.type == 1)
            {
               outputText("你咧嘴一笑，吐出分叉的舌头，嗅到她的情欲气息。");
            }
            outputText("[say:我想，看着你的[master]四处移动，对你来说几乎是一种受虐般的体验吧。如此异质又令人不安的存在，如今却永远和快感与服从联系在了一起。是这样吗？你就是忍不住盯着我美丽又致命的形态，因为那对你来说几乎像是一种淫荡的惩罚？]");
            outputText("[pg][say:差、差不多是那样，]惠特尼颤抖着低声说道。一只温暖而沾满油的手握住你爬行类般的尖端，以近乎自慰的节奏上下移动，你则平静地微笑着。她把油揉进你一圈圈身躯所花的时间，几乎又和她花在你身体其余部位上的时间一样久，但这完全值得。");
         }
         outputText("[pg]惠特尼最后一次用手从你的[legs]一路滑到你的脖颈，然后走下石台。你翻过身，心满意足地望着她，沉醉于她在你身体每一处揉出的柔滑光泽之中。你不仅感到无比放松而灵活，还与自己的身体产生了深刻的连结——你觉得自己可以优雅而精准地移动，每一个动作都能带着恰到好处的力度，完全实现自己的意图。");
         outputText("[pg][say: 刚才舒服吗，[master]？]犬女说道，脸上带着一副大功告成、心满意足的笑容。");
         if(get_player().get_lust() >= 33)
         {
            outputText("热水浴池在她身后安静地冒着泡，而让你肌肤发亮的可不只是油。要是你愿意的话，现在正是追求一次“圆满收尾”的时候。");
         }
         else
         {
            outputText("你琢磨着要不要“奖励”她一下，可是……该死。她真的把你放松得<i>太</i>彻底了。你以高高在上的气度向她道谢，重新穿好衣服，走出门去，享受着贯穿全身的步履轻盈与自制感。");
         }
         menu();
         if(get_player().get_lust() >= 33 && (get_player().hasCock() && get_player().cockThatFits(whitneyVagCapacity() * 1.33) != -1 || get_player().hasVagina()))
         {
            addButton(0,"圆满收尾",orgyRoomSubMassageHappyEnding);
            addButton(1,"离开",get_camp().returnToCampUseOneHour);
         }
         else
         {
            addButton(0,"继续",get_camp().returnToCampUseOneHour);
         }
      }
      
      public function orgyRoomRouter() : void
      {
         if(whitneyDom())
         {
            return;
         }
         var _loc1_:int = FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1162);
         switch(_loc1_)
         {
            case 0:
               if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1164) == 0)
               {
                  addButton(4,"按摩",wantOrgyRoom);
               }
               break;
            case 1:
               if(!get_player().isGoo() && !get_player().isTaur() && !get_player().isGenderless())
               {
                  addButton(4,"按摩",orgyRoomSubMassage);
               }
         }
      }
      
      public function numWhitneyTribalTats() : int
      {
         var _loc1_:int = 0;
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1129) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1129).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1130) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1130).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1131) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1131).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1132) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1132).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         return _loc1_;
      }
      
      public function numVapulaTribalTats() : int
      {
         var _loc1_:int = 0;
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1149) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1149).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1150) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1150).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1151) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1151).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1152) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1152).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         return _loc1_;
      }
      
      public function numTattoos(param1:String) : int
      {
         var _loc6_:int = 0;
         var _loc2_:StringMap = FarmCorruption.tattooFlagMap;
         var _loc3_:Array = param1 in StringMap.reserved ? _loc2_.getReserved(param1) : _loc2_.h[param1];
         if(_loc3_ == null)
         {
            throw new Error("无法确定正确的NPC标志。");
         }
         var _loc4_:int = 0;
         var _loc5_:int = 0;
         while(_loc5_ < int(_loc3_.length))
         {
            _loc6_ = int(_loc3_[_loc5_]);
            _loc5_++;
            if(_loc6_ in KFLAGS.flags.h)
            {
               _loc4_++;
            }
         }
         return _loc4_;
      }
      
      public function numSophieTribalTats() : int
      {
         var _loc1_:int = 0;
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1145) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1145).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1146) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1146).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1147) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1147).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1148) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1148).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         return _loc1_;
      }
      
      public function numSlavesAtFarm() : int
      {
         var _loc1_:int = 0;
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1079) == 1)
         {
            _loc1_++;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1080) == 1)
         {
            _loc1_++;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1081) == 1 && get_game().sophieBimbo.bimboSophie())
         {
            _loc1_++;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1084) == 1)
         {
            _loc1_++;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1085) == 1)
         {
            _loc1_++;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1089) == 1)
         {
            _loc1_++;
         }
         return _loc1_;
      }
      
      public function numMilkyTribalTats() : int
      {
         var _loc1_:int = 0;
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1157) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1157).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1158) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1158).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1159) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1159).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1160) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1160).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         return _loc1_;
      }
      
      public function numMilkyButterflyTats() : int
      {
         var _loc1_:int = 0;
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1157) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1157).indexOf("A butterfly") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1158) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1158).indexOf("A butterfly") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1159) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1159).indexOf("A butterfly") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1160) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1160).indexOf("A butterfly") >= 0)
            {
               _loc1_++;
            }
         }
         return _loc1_;
      }
      
      public function numLoversAtFarm() : int
      {
         var _loc1_:int = 0;
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1082) > 0)
         {
            _loc1_++;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1083) > 0)
         {
            _loc1_++;
         }
         return _loc1_;
      }
      
      public function numKellyTribalTats() : int
      {
         var _loc1_:int = 0;
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1153) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1153).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1154) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1154).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1155) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1155).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1156) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1156).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         return _loc1_;
      }
      
      public function numJojoTribalTats() : int
      {
         var _loc1_:int = 0;
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1141) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1141).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1142) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1142).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1143) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1143).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1144) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1144).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         return _loc1_;
      }
      
      public function numFollowersAtFarm() : int
      {
         var _loc1_:int = 0;
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1081) == 1 && !get_game().sophieBimbo.bimboSophie())
         {
            _loc1_++;
         }
         return _loc1_;
      }
      
      public function numAmilyTribalTats() : int
      {
         var _loc1_:int = 0;
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1137) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1137).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1138) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1138).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1139) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1139).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1140) is String)
         {
            if(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1140).indexOf("A tribal tattoo") >= 0)
            {
               _loc1_++;
            }
         }
         return _loc1_;
      }
      
      public function noOrgyRoomPlz() : void
      {
         var _g:FarmCorruption;
         clearOutput();
         whitneySprite();
         outputText("你告诉她这是个不错的主意，但现在还得先等等。");
         outputText("[pg][say: 我可以等，] 你的女管事低声说道，神情平静得像一幅画。[say: 我只是不知道你三头肌里的那个结能不能等。这会是一笔很值的投资，[master]，相信我。]");
         _g = this;
         doNext(function():void
         {
            _g.dogeCorruptedMissionComplete();
         });
      }
      
      public function no1Tattoo(param1:int) : void
      {
         clearOutput();
         whitneySprite();
         var _loc2_:String = "\"头号母狗\"刺在她的";
         if(param1 == 0)
         {
            collarboneIntro();
            outputText("[pg][say: 我哪还需要别人提醒这种事啊，[master]，]她低头看见那行如今刻在自己胸口、任谁都能看见的字，又恼又窘地笑着说道。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1129,_loc2_);
         }
         else if(param1 == 1)
         {
            shouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1130,_loc2_);
         }
         else if(param1 == 2)
         {
            lowerbackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1131,_loc2_);
         }
         else if(param1 == 3)
         {
            buttIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1132,_loc2_);
         }
         tattooMerge();
      }
      
      public function milkyFullTribalTats() : Boolean
      {
         if(numMilkyTribalTats() == 4)
         {
            return true;
         }
         return false;
      }
      
      public function makeDogeSubby() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你再次取出宝石，又一次开始有节奏地转动它；不过这一次，你稳步走向惠特尼，随着你继续说下去，你的声音在她耳中越来越响，她失焦的眼睛里那道闪耀的光也越来越亮。");
         outputText("[pg][say: 这么做感觉很好，对吧？抛开你还能阻止我的念头，在我面前彻底敞开、毫无防备。因为现在的你在我面前已经毫无防备了，不是吗，惠特尼？]你说话时停下了转动宝石，却仍将它直接举在她眼前，同时把另一只手放到她的臀侧，向上滑去，享受着你这名新奴隶结实的身体轮廓。");
         outputText("[pg]当你的手一路向上摸到足以探进她裙腰下方，又重新向下滑去，抚过她紧实的臀部和大腿内侧，直到碰到她的阴唇时，她发出一声呜咽。发现她已经湿得滴水，对你来说并不意外，她的内衣都因兴奋而浸透了。你轻轻把手指探进那片湿热之中，开始抚弄她的内侧阴唇，指尖向上弯去，找到并爱抚她小小的阴蒂，同时继续说着，将你的强制意志压在她身上，用快感淹没她被催眠的心智。");
         outputText("[pg][saystart]你是我的母狗，你也会像母狗一样行事。你会用生命保护我的财产，并尽你所能把它经营到最好。你会用鞭子管教我的其他奴隶，让他们加倍努力地干活，只为了能从我这里得到一句夸奖。当你听见我的声音时，你就会湿透。");
         if(get_player().biggestTitSize() >= 2)
         {
            outputText("[pg]当你看到我的乳房时，你会想要吮吸它们。");
         }
         if(get_player().hasCock())
         {
            outputText("[pg]当你看到我的肉棒时，你会想要崇拜它。");
         }
         if(get_player().hasVagina())
         {
            outputText("[pg]当你看到我的小穴时，你会想要全心全意地服侍它。");
         }
         outputText("[pg]只要你做个乖女孩，你就会是我在这里的左膀右臂，而乖女孩会得到奖励。坏女孩则会受到惩罚。[sayend]惠特尼喘息着，眼睛无法从那颗闪闪发光的宝石上移开，而你将两根手指插进她紧窄的小穴，开始利落地帮她自慰。[say: 现在……你是什么？]犬女的小穴在你的手指周围失神地痉挛，突如其来的一股淫液将你的整只手都浸湿了。");
         outputText("[pg][say: 乖……女孩！]曾经的农场主在呻吟的喘息间勉强说出这句话。你慢慢把双手都收回来，等着她的目光重新聚焦到你身上。");
         outputText("[pg][say: 证明给我看。]惠特尼立刻在你面前跪了下来，棕色的眼睛满含深情地仰望着你。你咧嘴一笑，把手按在她头上。");
         outputText("[pg][say: 真是个乖女孩！]你在她耳后揉了揉，她开心地咧嘴笑起来，尾巴也疯狂地摇个不停。[say: 我希望每次来访时，都能看见你这副样子。现在去吧，去把我的农场变成摇钱树。晚些时候我会过来看看你是需要奖励，还是需要惩罚。]");
         outputText("[pg][say: 遵命，[master]！]犬女一个利落的动作便站起身，朝农场奔去，身姿中透着全新的决心。你对农场的接管已经完成；既然惠特尼成了你的奴隶监工，一心一意为你效劳，你现在应该能分到更多利润了。");
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function makeDogeDommy() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你再次取出宝石，又一次开始有节奏地转动它。不过这一次，你稳步走向惠特尼，随着你继续说下去，你的声音在她耳中越来越响，她失焦的眼中那道闪耀的光也越来越亮。");
         outputText("[pg][say: 你喜欢刚才那么做，对吧，惠特尼？那种放手一搏，那阵纯粹的暴力爆发，那份化作实体的激情。那些东西一直都在你心里，可不知为什么，你却选择把它埋起来，用一成不变的乏味生活将它压抑。直到</i>我<i>出现。直到</i>我<i>给了你可以使唤的奴隶，把那些欲望逼到表面，变成一股无法浇灭的渴望，渴望征服，渴望占有。]");
         outputText("[pg]你一边说，一边停下旋转宝石，却仍将它正正举在她眼前，同时把另一只手放到她的臀侧，缓缓向上滑去，享受着你这名新奴隶紧实的曲线。这一次，犬女的眼神并没有失焦；她以一种强烈而纯粹的欲望凝视着刺目的光芒，随着你的手继续移动，她的呼吸也变得粗重。想到自己接下来要做的事，你的心跳不由得加快；但一想到能煽旺这位曾经平静的女人心中那簇被你点燃的狂热火种，这诱惑实在令人难以抗拒。");
         outputText("[pg]当你的手一路向上，钻到她裙子的腰带下方，又重新向下滑去，抚过她紧致的臀部和大腿内侧，直到碰到她的阴唇时，她的呼吸变得更加急促。发现她已经湿得一塌糊涂、内衣都被兴奋浸透，对你来说并不意外。你轻轻将手指推入那片湿热之中，开始抚弄她的内唇，向上弯去找到并爱抚她小小的阴蒂；与此同时，你继续说着话，将强迫的意念压在她身上，用快感淹没她被催眠的心智。");
         outputText("[pg][say: 我来得真是时候，替你打开了通往这些感觉的大门，对吧，奴隶？而你想尽你所能地感谢我，对不对？]");
         outputText("[pg][say: 是的，]她喘息着，嘴唇微张，那双炽热的眼睛无法从宝石上移开。");
         outputText("[pg][say: 很好。因为我正好用得上你的这些激情。你会用它们逼我的其他奴隶加倍努力，你会对她们挥鞭，直到她们向你乞求怜悯，然后你还会因为这样能让你愉悦而继续下去。你会变成一个彻头彻尾的母狗。我的母狗。我用来管束后宫的那只手。你能为我做到吗，惠特尼？你有那么坚强吗？还是说，你也会变成另一个需要我不断管教、只会呜咽的荡妇？]");
         outputText("[pg][say: 不，]她咬着牙说道。你将两根手指插进她紧窄的小穴，开始利落地帮她自慰，她的呼吸也变得断断续续。[say: 我能做到。我想成为你的左膀右臂，我想让其他奴隶在我面前趴在泥土里发抖，我想操练她们，让她们更好地侍奉你。我想——我需要这个！]");
         outputText("[pg][say: 我会让你变成那样，]你轻声说道，[say: 只要你完全照我的命令去做。]");
         outputText("[pg][say: 是！]你没有立刻说话，而是继续抚弄她，嗅着弥漫在你们周围的狂野气味，将手指在她紧窄的小穴里一直没入到指根，在她体内撩拨、弯曲，直到她喘息不止。当你感觉到即将到来的高潮紧紧攫住她的肌肉时，你才再次开口。");
         outputText("[pg][say: 那么，如果，]你低声说道，[say: 你的主人命令你把激情释放在[him]身上，你会照做吗？]困惑只在惠特尼的眉间停留了一瞬，随即便被恍然大悟的狂喜所取代，那是欲望带来的顿悟。");
         outputText("[pg][say: 会，]她喘息着，宝石发出的光映在她眼中，化作强烈的欲望。她开始疯狂地用臀部顶撞你的手。[say: 诸神啊，我当然会。我会为了[master]变得强大……我会成为[his]的监工，尽我所能训练他的牲口……只为了学会该怎么……</i>非常<i>……好好照顾[master]！]她每咆哮出一个词，便用力向你的手指顶撞一次；她的小穴在你的手指周围失神地痉挛，突如其来的一股淫液将你的整只手都浸湿了。你慢慢抽回双手，等着她的目光重新聚焦到你身上。那团火焰丝毫未减。");
         outputText("[pg][say: 很好，]你轻声说道。[say: 因为就算是最勤勉的" + get_player().mf("主人","女主人") + "，偶尔也需要一点休息放松。和一名非常值得信任的奴隶，单独享受一点私密时光。这个奴隶会知道不能辜负这份信任，因为她身边到处都是例子，告诉她一旦背叛会堕落到何种地步。你明白我的意思吗？]");
         outputText("[pg][say: 你在我心里撬开了某种我从来不知道存在的东西，]惠特尼在急促的喘息间热切地说道。[say: 然后又给了我一种我每分每秒都会该死地热爱的生活。我想用这份生活来爱你、触碰你、和你做爱，让你用你从未想过的方式叫出声来。这就是我想要的一切，[master]，让我给你看看你到底能多么信任我吧！]她被一种紧张的精力驱使着，手指不断抽动，仿佛正竭力压抑着想要一把抓住你的冲动。你温柔地对她笑了笑。");
         outputText("[pg][say: 以后吧。既然你已经把心智彻底向我敞开，那么以后会有无穷无尽的机会。现在……去吧，把我的农场变成会吐金子的机器。]");
         outputText("[pg][say: 马上就去，[master]！]狗女孩一个利落的转身，朝农场飞快离去，姿态中刻下了全新的决心。你对农场的接管已经完成；既然惠特尼如今成了你的奴隶监工，并且一心一意为你服务，你应该可以期待今后拿到更大份额的利润了。");
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1122,1);
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function lowerbackIntro() : void
      {
         outputText("你命令她趴到你的[legs]上，像是正要挨一顿打屁股。你那赤裸而身段轻盈的犬娘照做了，她因自己这副难堪的姿势而笑出声；当你把手指蘸进墨水、小心地在她身上画下图案时，笑声变成了一声尖促的低哼，随后你用纸将其封上。[say: 您画了什么，[master]？]她急切地问。");
         outputText("[pg]你笑着自己欣赏了一番，然后说她得去问你其他奴隶……还得希望她们说的是实话。[say: 哎呀不要，快告诉我那是什么嘛！是脏话，对不对？[Master]，最好别是什么会让奴隶们笑话的东西……]");
      }
      
      public function loversAtFarmMenu() : void
      {
         var _g:CoC;
         menu();
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1082) == 1)
         {
            addButton(0,"伊兹玛",get_game().izmaScene.izmaFollowerMenu);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1082) == 2)
         {
            _g = get_game();
            addButton(0,"伊兹梅尔",function():void
            {
               _g.gameOver();
            });
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1083) == 1)
         {
            addButton(1,"伊莎贝拉",get_game().isabellaFollowerScene.callForFollowerIsabella);
         }
         addButton(14,"返回",farmMenu);
      }
      
      public function loversAtFarm() : Boolean
      {
         if(numLoversAtFarm() > 0)
         {
            return true;
         }
         return false;
      }
      
      public function keltAChangeInManagement() : void
      {
         clearOutput();
         outputText("[say:听说这里换了管事的，]凯尔特说道，马蹄嗒嗒地在你面前停下。你确认确有其事。高大的半人马若有所思地看着你。他深色的眼睛和粗犷的皱眉中，有些不同于往常那种疲惫轻蔑的东西。是不情愿的钦佩吗？");
         outputText("[say:真难相信像你这种人也能把那条母狗收拾服帖，]他最后说道。[saystart]也许你的蛋比我以为的要大。");
         if(get_player().balls == 0)
         {
            outputText("当然，只是打个比方。");
         }
         outputText("[sayend]他哼了一声，朝箭靶小跑过去。[say:只是别指望我会对你另眼相看。只要你还在接受我的免费指导，我就是师傅，你就是小崽子。明白了吗？]");
         outputText("[pg]你平静地回答说你可以接受，他也欢迎继续待在农场，但如果他敢碰你的任何一个奴隶一根手指，你就会把他手里的每一根骨头都打断。凯尔特放声大笑起来。");
         outputText("[pg][say:我看起来像是想要，或者需要捡你用剩下的破烂货吗？天杀的，我真不敢想象，究竟是什么可怜虫会让</i>你<i>骑在他们头上作威作福。真是个笑话！好了，我们到底还要不要去看你在五码外连靶子都射不中，丢人现眼？]");
         outputText("说实话，这已经比你预想中他会给出的反应好多了。你取出弓，默默跟着他去了射箭场。");
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1110,1);
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1088,1);
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function kellyTribalTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "一片部落风纹身，尽是蜿蜒而色情的线条，横跨她的";
         if(param1 == 0)
         {
            kellyCollarboneIntro();
            outputText("[say: 这、这其实真的很漂亮，[master]！]你结束后，凯莉低头看着，满心欢喜地说道。[say: 谢谢你！]");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1153,_loc2_);
         }
         else if(param1 == 1)
         {
            kellyShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1154,_loc2_);
         }
         else if(param1 == 2)
         {
            kellyLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1155,_loc2_);
         }
         else if(param1 == 3)
         {
            kellyButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1156,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function kellySlotSelect() : void
      {
         slotSelectMenu("kelly",kellyBrandSelect);
      }
      
      public function kellyShouldersIntro() : void
      {
         outputText("你命令她背对着你跪下，不许乱动。半人马照做了，一动不动地待着；你把手指蘸进墨水，小心地在她的肩胛骨上画下图案，然后用纸将其封上。");
         outputText("[pg][say:你画了什么，[master]？]你做完之后，她试探着问。你强忍着不笑，说是一根精液淋漓的巨大马鸡巴。[say:真好笑，[master]。哈哈。你、你没真画那个吧？]");
      }
      
      public function kellyPropertyOfTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"[Name]的所有物\"纹在她的";
         if(param1 == 0)
         {
            kellyCollarboneIntro();
            outputText("[pg][say: 哦，[master]，]你完成后，凯莉看着你永久刻在她胸口的字样，带着气恼又毫不掩饰的欲念叹了口气。[say: 有必要写得这么大吗？]你用无比讲道理的语气说，纹身大小取决于它背后事实的分量；对此她无言以对。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1153,_loc2_);
         }
         else if(param1 == 1)
         {
            kellyShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1154,_loc2_);
         }
         else if(param1 == 2)
         {
            kellyLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1155,_loc2_);
         }
         else if(param1 == 3)
         {
            kellyButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1156,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function kellyNo1FillyTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"头号小母马\"纹在她的";
         if(param1 == 0)
         {
            kellyCollarboneIntro();
            outputText("[pg][say: 哦，[master]，]你完成后，凯莉看着你永久刻在她胸口的字样，带着气恼又毫不掩饰的欲念叹了口气。[say: 有必要写得这么大吗？]你用无比讲道理的语气说，纹身大小取决于它背后事实的分量；对此她无言以对。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1153,_loc2_);
         }
         else if(param1 == 1)
         {
            kellyShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1154,_loc2_);
         }
         else if(param1 == 2)
         {
            kellyLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1155,_loc2_);
         }
         else if(param1 == 3)
         {
            kellyButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1156,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function kellyLowerBackIntro() : void
      {
         outputText("你命令她一动不动地站好。她还是忍不住不安地哒哒跺着蹄子；你把手指蘸进墨水，在她人类形态的后腰上仔细画下图案，然后用纸封住墨迹。");
         outputText("[pg][say:你画了什么，[master]？]你做完之后，她试探着问。你强忍着不笑，说是一根精液淋漓的巨大马鸡巴。[say:真好笑，[master]。哈哈。你、你没真画那个吧？]");
      }
      
      public function kellyHorseshoeTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "每边肩膀上都清晰地印着一枚马蹄铁印。";
         kellyShouldersIntro();
         FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1154,_loc2_);
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function kellyHeartTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "一枚饱满的红色爱心纹身，位于她的";
         if(param1 == 0)
         {
            kellyCollarboneIntro();
            outputText("[say: 这、这其实真的很漂亮，[master]！]你结束后，凯莉低头看着，满心欢喜地说道。[say: 谢谢你！]");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1153,_loc2_);
         }
         else if(param1 == 1)
         {
            kellyShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1154,_loc2_);
         }
         else if(param1 == 2)
         {
            kellyLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1155,_loc2_);
         }
         else if(param1 == 3)
         {
            kellyButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1156,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function kellyFullTribalTats() : Boolean
      {
         if(numKellyTribalTats() == 4)
         {
            return true;
         }
         return false;
      }
      
      public function kellyDickWonTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"我斗过鸡巴，结果鸡巴赢了\"以细小字样纹在她的";
         if(param1 == 0)
         {
            kellyCollarboneIntro();
            outputText("[pg][say: 哦，[master]，]你完成后，凯莉看着你永久刻在她胸口的字样，带着气恼又毫不掩饰的欲念叹了口气。[say: 有必要写得这么大吗？]你用无比讲道理的语气说，纹身大小取决于它背后事实的分量；对此她无言以对。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1153,_loc2_);
         }
         else if(param1 == 1)
         {
            kellyShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1154,_loc2_);
         }
         else if(param1 == 2)
         {
            kellyLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1155,_loc2_);
         }
         else if(param1 == 3)
         {
            kellyButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1156,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function kellyCollarboneIntro() : void
      {
         outputText("你命令她跪在你面前，一动也别动。那名半人马照做了，安安静静地保持不动。你把手指蘸进墨水，小心翼翼地在她身上画下图案，然后用纸将其封定。");
      }
      
      public function kellyButtIntro() : void
      {
         outputText("你命令她站着一动不动。你把手指蘸进墨水，在她光滑而结实的马屁股上仔细画下图案，再用纸封印上去；她虽然照做了，却还是忍不住焦躁地跺着蹄子。");
         outputText("[pg][say: 你画了什么，[master]？]你完成后，她试探着问道。你强忍着不笑，说一边脸颊上写的是“打”，另一边写的是“我”。[say: 真好笑，[master]。哈哈。你、你不是真的这么画了吧？嗷！]");
         outputText("[pg]现在想想，当你把发红的手从她那宽阔得令人难以抗拒、如今已经纹上图案的栗色臀部上移开时，你才意识到自己错过了一个机会。");
      }
      
      public function kellyBrandSelect(param1:int) : void
      {
         var slot6:int;
         var _g5:FarmCorruption;
         var slot5:int;
         var _g4:FarmCorruption;
         var slot4:int;
         var _g3:FarmCorruption;
         var slot3:int;
         var _g2:FarmCorruption;
         var slot2:int;
         var _g1:FarmCorruption;
         var slot1:int;
         var _g:FarmCorruption;
         clearOutput();
         outputText("你要在她的" + slotNames[param1] + "上画什么？");
         menu();
         _g = this;
         slot1 = param1;
         addButton(0,"部落纹",function():void
         {
            _g.kellyTribalTattoo(slot1);
         });
         _g1 = this;
         slot2 = param1;
         addButton(1,"爱心",function():void
         {
            _g1.kellyHeartTattoo(slot2);
         });
         _g2 = this;
         slot3 = param1;
         addButton(2,"专属",function():void
         {
            _g2.kellyPropertyOfTattoo(slot3);
         });
         _g3 = this;
         slot4 = param1;
         addButton(3,"头号小母马",function():void
         {
            _g3.kellyNo1FillyTattoo(slot4);
         });
         if(get_silly())
         {
            _g4 = this;
            slot5 = param1;
            addButton(4,"鸡巴赢了",function():void
            {
               _g4.kellyDickWonTattoo(slot5);
            });
         }
         if(param1 == 1)
         {
            _g5 = this;
            slot6 = param1;
            addButton(5,"马蹄铁",function():void
            {
               _g5.kellyHorseshoeTattoo(slot6);
            });
         }
         addButton(14,"返回",kellySlotSelect);
      }
      
      public function jojoTribalTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "一道部落风格的纹身，由蜿蜒而情色的线条组成，横贯他的";
         if(param1 == 0)
         {
            jojoCollarboneIntro();
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1141,_loc2_);
         }
         else if(param1 == 1)
         {
            jojoShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1142,_loc2_);
         }
         else if(param1 == 2)
         {
            jojoLowerbackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1143,_loc2_);
         }
         else if(param1 == 3)
         {
            jojoButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1144,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function jojoSissySlutTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"娘炮荡妇\"纹在他的";
         if(param1 == 0)
         {
            jojoCollarboneIntro();
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1141,_loc2_);
         }
         else if(param1 == 1)
         {
            jojoShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1142,_loc2_);
         }
         else if(param1 == 2)
         {
            jojoLowerbackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1143,_loc2_);
         }
         else if(param1 == 3)
         {
            jojoButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1144,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function jojoShouldersIntro() : void
      {
         outputText("你命令他背对着你跪下，一动也别动。那只鼠魔照做了，安安静静地保持不动。你把手指蘸进墨水，小心翼翼地在他身上画下图案，然后用纸将其封定。");
         outputText("[pg][say: 谢、谢谢，[master]，]他说。他停顿了一下。[say: 我、我能不能知道这是——？]你揉了揉他可爱的耳朵，告诉他当然不行。");
      }
      
      public function jojoPropertyTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"[Name]的所有物\"纹在他的";
         if(param1 == 0)
         {
            jojoCollarboneIntro();
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1141,_loc2_);
         }
         else if(param1 == 1)
         {
            jojoShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1142,_loc2_);
         }
         else if(param1 == 2)
         {
            jojoLowerbackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1143,_loc2_);
         }
         else if(param1 == 3)
         {
            jojoButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1144,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function jojoMommysBoyTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"妈咪的男孩\"纹在他的";
         if(param1 == 0)
         {
            jojoCollarboneIntro();
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1141,_loc2_);
         }
         else if(param1 == 1)
         {
            jojoShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1142,_loc2_);
         }
         else if(param1 == 2)
         {
            jojoLowerbackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1143,_loc2_);
         }
         else if(param1 == 3)
         {
            jojoButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1144,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function jojoLowerbackIntro() : void
      {
         outputText("你命令他脸朝下横趴在你的[legs]上，像是正要挨一顿打屁股。鼠魔照做了，一动不动地待着；你把手指蘸进墨水，小心地在他身上画下图案，然后用纸将其封上。");
         outputText("[pg][say: 谢、谢谢，[master]，]他说。他停顿了一下。[say: 我、我能不能知道这是——？]你揉了揉他可爱的耳朵，告诉他当然不行。");
      }
      
      public function jojoHeartTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "他的";
         if(param1 == 0)
         {
            jojoCollarboneIntro();
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1141,_loc2_);
         }
         else if(param1 == 1)
         {
            jojoShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1142,_loc2_);
         }
         else if(param1 == 2)
         {
            jojoLowerbackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1143,_loc2_);
         }
         else if(param1 == 3)
         {
            jojoButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1144,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function jojoFullTribalTats() : Boolean
      {
         if(numJojoTribalTats() == 4)
         {
            return true;
         }
         return false;
      }
      
      public function jojoCollarboneIntro() : void
      {
         outputText("你命令他跪在你面前，一动也别动。那只鼠魔照做了，安安静静地保持不动。你把手指蘸进墨水，小心翼翼地在他身上画下图案，然后用纸将其封定。");
         outputText("[pg][say: 谢、谢谢，[master]，]当他低头看见你永久刻在他胸口上的东西时说道。你揉了揉他可爱的耳朵，告诉他不用客气。");
      }
      
      public function jojoCockGoesHereTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"鸡巴插这里\"刺在他的";
         if(param1 == 0)
         {
            jojoCollarboneIntro();
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1141,_loc2_);
         }
         else if(param1 == 1)
         {
            jojoShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1142,_loc2_);
         }
         else if(param1 == 2)
         {
            jojoLowerbackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1143,_loc2_);
         }
         else if(param1 == 3)
         {
            jojoButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1144,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function jojoButtIntro() : void
      {
         outputText("你命令他脸朝下趴在你的[legs]上，就像马上要挨一顿屁股似的。那只鼠魔照做了，一动不动地待着；你把手指蘸进墨水，在他身体最柔软的部位仔细画下图案，然后用纸封住墨迹。");
         outputText("[pg][say:谢、谢谢，[master]，]他说。他停顿了一下。[say:我能不能知道这是——？]你俏皮地拍了一下他的新纹身，告诉他当然不行。");
      }
      
      public function jojoBrandSlotSelect() : void
      {
         slotSelectMenu("jojo",jojoBrandSelect);
      }
      
      public function jojoBrandSelect(param1:int) : void
      {
         var slot6:int;
         var _g5:FarmCorruption;
         var slot5:int;
         var _g4:FarmCorruption;
         var slot4:int;
         var _g3:FarmCorruption;
         var slot3:int;
         var _g2:FarmCorruption;
         var slot2:int;
         var _g1:FarmCorruption;
         var slot1:int;
         var _g:FarmCorruption;
         clearOutput();
         outputText("你要在他的" + slotNames[param1] + "上画些什么？");
         menu();
         _g = this;
         slot1 = param1;
         addButton(0,"部落纹",function():void
         {
            _g.jojoTribalTattoo(slot1);
         });
         _g1 = this;
         slot2 = param1;
         addButton(1,"爱心",function():void
         {
            _g1.jojoHeartTattoo(slot2);
         });
         _g2 = this;
         slot3 = param1;
         addButton(2,"归属",function():void
         {
            _g2.jojoPropertyTattoo(slot3);
         });
         _g3 = this;
         slot4 = param1;
         addButton(3,"娘炮贱货",function():void
         {
            _g3.jojoSissySlutTattoo(slot4);
         });
         if(get_player().hasCock() && param1 == 2)
         {
            _g4 = this;
            slot5 = param1;
            addButton(4,"鸡巴插这里",function():void
            {
               _g4.jojoCockGoesHereTattoo(slot5);
            });
         }
         if(get_player().hasVagina())
         {
            _g5 = this;
            slot6 = param1;
            addButton(5,"妈妈的乖儿子",function():void
            {
               _g5.jojoMommysBoyTattoo(slot6);
            });
         }
         addButton(14,"返回",jojoBrandSlotSelect);
      }
      
      public function investmentRefinery() : void
      {
         var _g1:FarmCorruption;
         var money:Boolean;
         var _g:FarmCorruption;
         clearOutput();
         whitneySprite();
         if(!whitneyCorrupt())
         {
            outputText("你说你想造一台机器，把你的追随者产出的体液浓缩成真正的变身药剂。惠特尼打了个寒战，但她也没什么立场反对。");
            outputText("[pg][say: 那就是精炼厂了？我想搭个类似蒸馏器的东西，再从那基础上改造，应该不算太难。不过这得花钱，尤其是你还想让谁都能拿它处理各种东西。你给我1500枚宝石的话，我可以看看能做到什么程度。]");
         }
         else
         {
            outputText("你说你想造一台机器，把你的追随者产出的体液浓缩成真正的变身药剂。");
            outputText("[pg][say: 精炼厂，[master]？真是个美妙的想法。]这只犬女闭上眼，沉入一阵淫靡的遐想。你耐心等着，直到她终于叹息着睁开眼，回过神来面对你。[say: 我想搭个类似蒸馏器的东西，再从那基础上改造，应该不算太难。不过这得花钱，尤其是你还想让谁都能拿它处理各种东西。你给我1500枚宝石的话，我可以看看能做到什么程度。]");
         }
         menu();
         if(get_player().get_gems() >= 1500)
         {
            addButton(0,"就这么办",doRefineryInvestment);
         }
         else
         {
            _g = this;
            money = true;
            addButton(0,"就这么办",function():void
            {
               _g.turnDownInvestment(money);
            });
         }
         _g1 = this;
         addButton(1,"不了",function():void
         {
            _g1.turnDownInvestment();
         });
      }
      
      public function investmentMilktank() : void
      {
         var _g1:FarmCorruption;
         var money:Boolean;
         var _g:FarmCorruption;
         clearOutput();
         whitneySprite();
         if(!whitneyCorrupt())
         {
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,870) > 0 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1089) == 1)
            {
               outputText("你告诉惠特尼，你想让她给[bathgirlName]安排一套密集的促生剂和催乳剂疗程，并建一个小型游泳水槽来安置她。");
               outputText("[pg][say: 什、什么？]犬女惊愕地说道。[say: 就是那个在牛棚工作的漂亮小可爱？她告诉我你治好了她。她那么开心，可、可现在你想……让她变回去？]");
               outputText("[pg]没错，你一本正经地说道。你需要她产出更多牛奶。惠特尼看起来像是要拒绝，但当她盯着你那双一眨不眨的眼睛，并想起了一些事情后，她低头看着自己的脚，痛苦地叹了口气。[say: 我大概能做到。因为她信任你，所以也信任我，而且——400颗宝石，]她含糊地说完。");
            }
            else
            {
               outputText("你告诉惠特尼，你想让她在农场建一个游泳池，然后到你的营地去，把你花大价钱弄来的奶奴带走并安置进去。犬女慢慢消化着这番话。");
               outputText("[pg][say: 400颗宝石，]她最后说道。");
            }
         }
         else if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,870) > 0 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1089) == 1)
         {
            outputText("你告诉惠特尼，你想让她给[bathgirlName]安排一套密集的促生剂和催乳剂疗程，并建一个小型游泳水槽来安置她。");
            outputText("[pg][say: [Master]，你可真坏，]犬女毫不掩饰地愉快低语道。[say: 把那个傻婊子灌满生长激素，直到她脑子里只剩下自己那对又大又多汁的奶子——哦，众神啊，快给我宝石，400颗就够了，我现在就想开工！]");
         }
         else
         {
            outputText("[pg]你告诉惠特尼，你想让她先在农场建好一个游泳水槽，然后再来你的营地，把你花大价钱弄来的产奶奴隶带走，安置到里面。");
            outputText("[pg][say: 当然，[master]，]惠特尼说道，一想到又有一个奴隶要受她摆布，她脸上便慢慢浮起笑容。[say: 400颗宝石就能办成。]");
         }
         menu();
         if(get_player().get_gems() >= 400)
         {
            addButton(0,"就这么办",doMilktankInvestment);
         }
         else
         {
            _g = this;
            money = true;
            addButton(0,"就这么办",function():void
            {
               _g.turnDownInvestment(money);
            });
         }
         _g1 = this;
         addButton(1,"不了",function():void
         {
            _g1.turnDownInvestment();
         });
      }
      
      public function investmentMenu() : void
      {
         var _g:FarmCorruption;
         menu();
         if(!get_player().hasKeyItem("Breast Milker - Installed At Whitney\'s Farm") && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1124) == 0)
         {
            addButton(0,"乳房挤奶器",investmentBreastMilker);
         }
         if(!get_player().hasKeyItem("Cock Milker - Installed At Whitney\'s Farm") && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1125) == 0)
         {
            addButton(1,"阴茎挤奶器",investmentCockMilker);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1094) == 0 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1126) == 0)
         {
            addButton(2,"精炼厂",investmentRefinery);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1109) == 0 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1127) == 0)
         {
            addButton(3,"避孕措施",investmentContraceptive);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1123) == 0 && get_game().milkWaifu.milkSlave() && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1128) == 0)
         {
            addButton(4,"储奶罐",investmentMilktank);
         }
         if(!whitneyCorrupt())
         {
            addButton(14,"返回",dogeNotCorruptYetMenu);
         }
         else
         {
            _g = this;
            addButton(14,"返回",function():void
            {
               _g.dogeCorruptedMissionComplete();
            });
         }
      }
      
      public function investmentContraceptive() : void
      {
         var _g1:FarmCorruption;
         var money:Boolean;
         var _g:FarmCorruption;
         clearOutput();
         whitneySprite();
         if(!whitneyCorrupt())
         {
            outputText("你问惠特尼，她知不知道玛瑞斯有没有天然的避孕措施。");
            outputText("[pg][say: 你是说有些鲨鱼人用的那玩意儿？当然知道。森林里和湖边的壤土地带会一丛丛地长出来。不过那一带基本没人用，毕竟他们全都跟彼此陷在生孩子的军备竞赛里。] 你说你想让她划出一块地来种这个。[say: 你想要的话可以。不过我需要种子，还要很多堆肥——我说过了，这东西只长在非常潮湿的土里。750颗宝石大概就能办成。]");
         }
         else
         {
            outputText("你问惠特尼，她知不知道玛瑞斯有没有天然的避孕措施。");
            outputText("[pg][say: 你是说有些鲨鱼人用的那玩意儿？当然知道。森林里和湖边的壤土地带会一丛丛地长出来。不过那一带基本没人用，毕竟他们全都跟彼此陷在生孩子的军备竞赛里。] 你说你想让她划出一块地来种这个。[say: 如果你想要的话，[master]。不过我需要种子，还要很多堆肥——我说过了，这东西只长在非常潮湿的土里。750颗宝石大概就能办成。]");
         }
         menu();
         if(get_player().get_gems() >= 750)
         {
            addButton(0,"去做",doContraceptiveInvestment);
         }
         else
         {
            _g = this;
            money = true;
            addButton(0,"就这么办",function():void
            {
               _g.turnDownInvestment(money);
            });
         }
         _g1 = this;
         addButton(1,"不了",function():void
         {
            _g1.turnDownInvestment();
         });
      }
      
      public function investmentCockMilker() : void
      {
         var _g1:FarmCorruption;
         var money:Boolean;
         var _g:FarmCorruption;
         clearOutput();
         whitneySprite();
         if(!whitneyCorrupt())
         {
            outputText("你说你想造一台精液提取器，能让你自己用的那种。惠特尼皱起眉头，但看起来并没有像你预想的那样被这个主意吓到。");
            outputText("[pg][say: 我手头倒是有些备用的采集部件，不过你要这个的话，大部分东西都得专门订，]她说道。[say: 要是你能拿出1000枚宝石，我就能把需要的东西弄来，造好再装上。]");
         }
         else
         {
            outputText("你说你想造一台精液提取器，能让你自己用的那种。惠特尼听出了其中的意味，咬住了嘴唇。");
            outputText("[pg][say: 我手头倒是有些备用的采集部件，不过你要这个的话，大部分东西都得专门订，[master]，]她说道。[say: 要是你能拿出1000枚宝石，我就能把需要的东西弄来，造好再装上。]");
         }
         menu();
         if(get_player().get_gems() >= 1000)
         {
            addButton(0,"就这么办",doCockMilkerInvestment);
         }
         else
         {
            _g = this;
            money = true;
            addButton(0,"就这么办",function():void
            {
               _g.turnDownInvestment(money);
            });
         }
         _g1 = this;
         addButton(1,"不了",function():void
         {
            _g1.turnDownInvestment();
         });
      }
      
      public function investmentBreastMilker() : void
      {
         var _g1:FarmCorruption;
         var money:Boolean;
         var _g:FarmCorruption;
         clearOutput();
         whitneySprite();
         if(!whitneyCorrupt())
         {
            outputText("你说你想装一台乳房挤奶器，最好是你也能用的那种。惠特尼皱起眉头，但似乎并没有像你预想的那样被这个主意吓到。");
            outputText("[pg][say:我手头倒有些备用零件，但你要那玩意儿的话，大部分东西都得专门订购，]她说。[say:只要你能拿出 1,000 颗宝石，我就能把你需要的东西弄来、组装好，再安装上。]");
         }
         else
         {
            outputText("你说你想装一台乳房挤奶器，最好是你也能用的那种。惠特尼的目光落到你的[chest]上。");
            outputText("[pg][say:想更亲近大自然吗，[master]？]她狡黠地笑着说。[say:我手头倒有些备用零件，但你要的话，大部分东西都得专门订购。只要你能拿出 1,000 颗宝石，我就能把你需要的东西弄来、组装好，再安装上。]");
         }
         menu();
         if(get_player().get_gems() >= 1000)
         {
            addButton(0,"就这么办",doBreastMilkerInvestment);
         }
         else
         {
            _g = this;
            money = true;
            addButton(0,"就这么办",function():void
            {
               _g.turnDownInvestment(money);
            });
         }
         _g1 = this;
         addButton(1,"不了",function():void
         {
            _g1.turnDownInvestment();
         });
      }
      
      public function heartTattoo(param1:int) : void
      {
         clearOutput();
         whitneySprite();
         var _loc2_:String = "一枚饱满的红色爱心纹身，位于她的";
         if(param1 == 0)
         {
            collarboneIntro();
            outputText("[pg][say: 你的手指真灵巧，[master]，]她一边赞叹地抚摸着你画下的东西，一边说道。[say: 不过我想我早就知道了。]");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1129,_loc2_);
         }
         else if(param1 == 1)
         {
            shouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1130,_loc2_);
         }
         else if(param1 == 2)
         {
            lowerbackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1131,_loc2_);
         }
         else if(param1 == 3)
         {
            buttIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1132,_loc2_);
         }
         tattooMerge();
      }
      
      public function hasTattoo(param1:String) : Boolean
      {
         var _loc5_:int = 0;
         var _loc2_:StringMap = FarmCorruption.tattooFlagMap;
         var _loc3_:Array = param1 in StringMap.reserved ? _loc2_.getReserved(param1) : _loc2_.h[param1];
         if(_loc3_ == null)
         {
            throw new Error("无法确定正确的NPC标志。");
         }
         var _loc4_:int = 0;
         while(_loc4_ < int(_loc3_.length))
         {
            _loc5_ = int(_loc3_[_loc4_]);
            _loc4_++;
            if(_loc5_ in KFLAGS.flags.h)
            {
               return true;
            }
         }
         return false;
      }
      
      public function hasFreeTattooSlot(param1:String) : Boolean
      {
         var _loc5_:int = 0;
         var _loc2_:StringMap = FarmCorruption.tattooFlagMap;
         var _loc3_:Array = param1 in StringMap.reserved ? _loc2_.getReserved(param1) : _loc2_.h[param1];
         if(_loc3_ == null)
         {
            throw new Error("无法确定正确的NPC标志。");
         }
         var _loc4_:int = 0;
         while(_loc4_ < int(_loc3_.length))
         {
            _loc5_ = int(_loc3_[_loc4_]);
            _loc4_++;
            if(!(_loc5_ in KFLAGS.flags.h))
            {
               return true;
            }
         }
         return false;
      }
      
      public function happyEndingMerge() : void
      {
         outputText("[pg]等你把最后一点都发泄出来后，你从她身上解开纠缠，滑到一旁沉下身去，大口喘气，心脏怦怦直跳。在这东西闷热的环境里，果然不能太快就折腾得太激烈——现在你的额头渗出汗珠，视线也在你仰望天花板时短暂地晃了几秒，你只能等着眉心处跳动的脉搏平复下来。在一片幸福的恍惚中，你听着惠特尼的呼吸也逐渐恢复正常，感觉到她在泡沫下重新把双臂环上你的身体。");
         outputText("[pg][say: 现在彻底放松了吗？]她用低低的、带着挑逗的声音问道。[say: 还是说，我还得再给你全身按摩一遍？]");
         outputText("[pg]诸神啊……要是能永远待在这里，一边享受抹油按摩，一边把她干到神志不清，那该有多美妙。不过你也知道，要是你没把其余时间都拿去别处拼命折腾自己，这样的享受也不会有现在一半的美好。你把她拉进怀里，舒服地挠了挠她耳后，告诉她，她的[master]已经彻底放松下来了，而且她是个好女孩。她的尾巴在水里啪嗒啪嗒啪嗒啪嗒地甩着。");
         outputText("[pg]你又短暂享受了一会儿热意，以及奴隶身体贴近你的感觉，随后起身，用毛巾擦干身体，离开了这里。走出前门时，洁净感、轻快的步伐，以及在体内回荡的自制力，都让你颇为享受。");
         var _loc1_:IMap = KFLAGS.flags;
         FlagDict_Impl_.arrayWriteInt(_loc1_,1163,FlagDict_Impl_.arrayReadInt(_loc1_,1163) + 1);
         get_player().orgasm("Generic");
         dynStats(DynStat.Sens(-1));
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function getOrgyRoom() : void
      {
         clearOutput();
         whitneySprite();
         outputText("这是一笔不小的投资，但她描述的那些安排确实勾起了你的兴趣。你慢慢转过身，轻轻一摆头，示意那块她每周放置农场收益的石头。惠特尼脸上绽开灿烂的笑容，双手攥紧了裙子。");
         outputText("[pg][say: 你不会后悔的，[master]，我保证！]");
         var _loc1_:Player = get_player();
         _loc1_.set_gems(_loc1_.get_gems() - 2200);
         showStats();
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1164,1);
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function getItemObj(param1:int) : Consumable
      {
         var _loc2_:int = param1;
         if(_loc2_ == 1097)
         {
            return get_consumables().SUCMILK;
         }
         if(_loc2_ == 1099)
         {
            return get_consumables().INCUBID;
         }
         if(_loc2_ == 1104)
         {
            return get_game().sophieBimbo.get_eggTypes()[get_game().sophieBimbo.eggColors.indexOf(FlagDict_Impl_.arrayReadString(KFLAGS.flags,1103))];
         }
         if(_loc2_ == 1111)
         {
            return get_consumables().HRBCNT;
         }
         return null;
      }
      
      public function getBrandingStuff() : void
      {
         clearOutput();
         whitneySprite();
         var _loc1_:Player = get_player();
         _loc1_.set_gems(_loc1_.get_gems() - 500);
         showStats();
         outputText("你不停抚弄她那小小鼓起的肉粒，直到她发出一声无言的欢叫，喷出一大股令人满足的淫液，把你的手都浸湿了。她靠在你胸前喘息时，你把一只手在她衣服上擦干净，另一只手把钱塞进她的" + (whitneyDefurred() || get_noFur() ? "手" : "爪子") + "里。");
         outputText("[pg][say: 去办成吧，]你凑在她耷拉的耳朵边低声说道，随后转身离开。");
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1134,1);
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function followersAtFarmMenu() : void
      {
         menu();
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1081) == 1 && !get_game().sophieBimbo.bimboSophie())
         {
            addButton(0,"索菲",get_game().sophieFollowerScene.followerSophieMainScreen);
         }
         addButton(14,"返回",farmMenu);
      }
      
      public function followersAtFarm() : Boolean
      {
         if(numFollowersAtFarm() > 0)
         {
            return true;
         }
         return false;
      }
      
      public function firstWhitneyDomPleasure() : void
      {
         outputText("你对此多少有些忐忑，但你已经费了不少心思，把惠特尼塑造成一个相当独特的奴隶；若不试试看你在她身上引出的支配欲究竟有多深，似乎也有些扫兴。你告诉她，你想要稍微放松一下。");
         outputText("[pg][say: 当然，[master]。放松，]惠特尼低声说道。她把手臂缠上你的胳膊，最后两个字咬得意味深长。[say: 也许您愿意进我的屋子里坐坐？我做了一两处，嗯，调整，想让您看看。]她虽然相当娇小，但你忽然意识到，一辈子的体力劳动让她变得多么有力；那感觉就像一小捆滚烫的绳索缠在你的手臂上，牵着你踏上木板台阶，穿过惠特尼农舍的门。");
         outputText("[pg]她前面的房间差不多和你预想的一样——家具稀少却温馨，随处可见擦亮的木头和磨亮的铁器——但惠特尼并没有兴趣带你参观。她领你上楼，打开卧室的门，露出一个咧到很开的、满是牙齿的笑容，示意你往里看看。");
         outputText("[pg]你花了好一会儿才真正把眼前的一切消化完。除非惠特尼一直以来都是个秘密的犬系女王，否则她为了在自己那狂热的想法里“照顾”你，收集这些所需之物的速度可真算不上慢。她的床上覆盖着一团团复杂缠绕的皮带和金属镣铐，旁边桌上放着眼罩、绳索和口塞，而梳妆台上则整齐堆放着一片真正令人警觉的假阳具、肛塞和蜡烛之城。房间的装潢和惠特尼家其他地方一样，是朴素的纯白与木棕；也正因如此，那套装点其间、完备得令人不安的BDSM器具显得更加惊人。你惊讶地问她这些东西都是从哪儿弄来的。");
         outputText("[pg][say: 不许问，]她声音低哑地说道。她在你身后锁上门，传来一声清晰的咔哒声，随后她走向你，目光一刻不移地盯着你的眼睛，刻意侵入你的私人空间，近到你能在她说话时感受到她嘴唇的动作。[say: 只要你在这四面墙里，你就属于我；属于我的东西，没得到允许就不准说话。现在你在这儿了，[name]，而你完完全全归我一个人。我需要满足，而你会把它给我，用</i>我<i>想要的方式。]她以一声低沉而饥渴的咆哮结束了这番话，泛红的眼睛垂向你的身体，已经在她堕落的想象里把它这样那样地摆弄起来。");
         outputText("[pg]有那么一瞬间，怒意在你心中升起，你想要因为她竟敢这样对你说话而教训她——但不，不对。这正是你自己要求的。偶尔让别人掌控一切，感觉竟是如此放松。她和你或许都曾半开玩笑地用过这个词，但此刻在你心中逐渐明朗的这种接受感，正是它本来的意思——放松。当她用力推上你的胸口时，你顺从她急不可耐的动作，向后倒在床上；仅仅是这样，允许自己被另一个人压倒性的性欲所引导，被关在这间房间的圣所里，就已经让你感到非常美妙。");
         outputText("[pg][say: 脱掉，]她简短地命令道。你温顺地照做，同时看着她也开始脱衣。她迅速扯下自己朴素的工作服，仿佛那些衣服让她很烦躁；她并不是因为想在你面前表演什么，而只是压倒性地渴望开始。你忽然觉得浑身很热，又有些发颤。");
      }
      
      public function firstVaginaOralTrainingStageTwo() : void
      {
         clearOutput();
         whitneySprite();
         outputText("解开你[armor]的下半部分，你带着一贯亲切的微笑告诉她，是时候再上一课了。这一次，你注意到跪在你面前的犬女有了些许不同；她平日里那种紧张不安的劲头似乎已经消失了，只是静静地、坚定地盯着你的胯间。你坐稳身子，分开你的[hips]，稍作停顿后，没有再给出任何指示。");
         outputText("[pg]你的信任立刻得到了回报。惠特尼清楚地知道该怎么做，她把一只手伸进内衣里，平稳地注视着你的[vagina]，一边抚弄自己一边有些急促地喘着气，随后张开嘴，将那条滚热、略显粗糙的舌头贴上你的性器。她只小心地舔了几下，掠过那些她知道会让你滴水的敏感处，便张大嘴，让舌头在你湿热的肉里扭动、探寻。她上下摆动着脑袋，先卷弄你粉嫩的内壁，再退出来，近乎膜拜般舔遍你的阴唇，全然不需要你的鼓励，你也发出一声深深的赞许。诸神在上，她终于连你的[clit]都找到了；她围着它绕了几圈，又愉悦地在上面抚平舔过，让它从包皮下明显鼓了出来。她含着你发出呜咽，舌头动得更快，深深挺入，用嘴操弄着你。要是她继续这样下去，你很快就要高潮了……");
         outputText("[pg]你费了些力气，把一只有力的手按在她肩上，无声地示意她停下。她退开时，你的[vagina]还滴着润滑的液体，你也同惠特尼眼中深切的担忧一样感到挫败。");
         outputText("[pg][say: 对不起，主人。我做错什么了吗？]");
         outputText("[pg][say: 完全没有，]你呻吟着闭上眼，在心里命令那股热意稍微平息下来。[say: 你学得很好，也进步了很多。但既然你已经掌握了基础，就该学会如何更完整地侍奉我。现在——继续拨弄你那淫荡的小穴，我来教你。]你等到惠特尼脸上的不安消散，被深沉的欲望取代，身体也随着手上的动作一颤一颤后，才开始讲解。");
         outputText("[pg][say: 首先，每次给我舔之前，你都必须先从这里开始。]你让一只手慢慢滑过自己的[chest]，你的乳头");
         if(get_player().lactationQ() > 0)
         {
            outputText("微微渗着液");
         }
         else
         {
            outputText("、半硬着");
         }
         outputText("，都是因为你早已被挑起了情欲。[say: 好骚货都知道，在有资格品尝女主人的小穴之前，必须先侍奉她的乳房，让她的乳头和肌肤都沾满奴隶的崇拜，亮得让所有人都看见。让我看看你做得怎么样。]");
         outputText("[pg]稍微停顿后，惠特尼站起身，双臂环住你的腰，俯身凑向你的一颗[nipples]。当你感觉到她扁平的舌头滑过你的柔软处，又掠过你的");
         if(get_player().hasFuckableNipples())
         {
            outputText("淫靡褶皱");
         }
         else
         {
            outputText("敏感点");
         }
         outputText("，轻柔地揉捏，并用唾液浸润它们时，你叹了口气。考虑到她一开始舔阴时那么笨拙，如今她在这方面却好得惊人。[say: 每一寸都舔到……很好。稍微吮一吮……非常好！]她含住你的一颗乳头，并");
         if(get_player().hasFuckableNipples())
         {
            outputText("将舌头探进其敏感的内侧。");
         }
         else
         {
            outputText("极其轻柔地咬了咬它。");
         }
         if(get_player().lactationQ() > 0)
         {
            outputText("这温柔的揉捏已经足以让你饱含乳汁的乳头往她嘴里滴出奶水。惠特尼起初微微一惊，但显然很快就喜欢上了那味道，因为她开始吸吮你丰满的乳房，想要更多。你允许她再喝上一口，才轻轻把她拉开。");
            outputText("[pg][say:那不是给你的，]你轻声说道。[say:每次你可以喝这么多，但不能再多了。你要靠让我高潮来解渴，明白吗？]惠特尼看起来有些恍惚，但等你说完时，她已经把注意力集中在你身上了。");
            outputText("[pg][say:可是它太……我、我明白了，女主人。]");
         }
         outputText("[pg]你愉悦地叹了口气，又随意地向下指了指。");
         outputText("[pg][say:既然你明白了，我们来学另一个部分。这个要更细致一点，所以认真照我的指示做。]惠特尼再次蹲下。她的手还塞在内裤里，微微喘着气，脸颊泛红。你鼓励地朝她笑了笑。[say:你用舌头找到了我的阴蒂，现在我要你用手指找到它。动作要好，又要慢。]");
         outputText("[pg]惠特尼小心翼翼地探进你的[hips]之间，她光滑温热的手指滑过你的[vagina]。她摸索着你已经被她刚才的动作弄湿的阴唇，起初有些笨拙，但随着她逐渐摸清形状，也越来越有信心，最后慢慢按上你的[clit]。");
         outputText("[pg]她至少还算知道自己在做什么，一边抚弄你，一边也把手指勾进自己体内，但一开始仍然笨拙得令人烦躁，不是找不准角度，就是把指尖太用力地撞上你的敏感点。你恼火地低斥一声后，她的触碰又变得太轻，像是怕弄疼你。不过到最后，她总算渐渐掌握了诀窍，慢慢绕着你的阴蒂打圈，再轻轻用手指拂过它，每一下都让它从包皮下更加鼓胀地探出来。她甚至还一边这么做，一边把食指插进你体内，舒服地勾刮着你的阴道壁，直到你的整个女性器都像是舒展开来，因快感而泛着光。");
         outputText("[pg][say:很好，]你嗓音低哑地说道，费了点力气才让声音保持平稳，任由美妙的快感如脉络般穿过你的胯间。[say:现在才是真正的考验。两只手都保持原位，继续舔我的小穴。]惠特尼偷空休息了一瞬，她的双手此刻多半已经有点发酸，随后她把头探到自己手下方，又将舌头伸回你的甬道。你深深叹息，闭上眼睛，珍珠般的柔嫩肉壁再次被甜美而绞紧的温热包裹，同时那份顺滑的压力仍在持续抚弄你的[clit]。");
         outputText("[pg]麻烦再次出现了。你让你的狗女孩同时做三件强度很高的事，她勉强维持着平衡，却摇摇晃晃，常常在嘴被小穴包住时，就忘了继续抚弄你或她自己。你一直盯着她，在她跟不上时低声给出指示和鼓励，只是随着从四面八方涌向你性器的热度越来越强，这也变得越来越困难。");
         outputText("[pg]最终，你再也压不住欲望。你抓住她的头，开始用力顶向她抽动的舌头。她任由你使用她的嘴，鼻间嘶嘶地喘着气，同时努力让手指继续湿滑地动作；你轻声低吟，自己强硬的顶动逼得她的双手又快又乱地移动，在你急切鼓胀的敏感点上掠过，让你更加疯狂地抽送在她舌头上。");
         outputText("[pg][say:高潮吧，贱狗，]你咬牙说道，同时冲向自己的顶点。惠特尼的呻吟被闷住，你的[vagina]颤抖起来，随后随着你抽紧的[clit]一同狂喜地收缩，");
         if(get_player().wetness() <= 2)
         {
            outputText("弄湿了你奴隶的手和嘴");
         }
         else
         {
            outputText("把你奴隶的脸和手臂都彻底浸透");
         }
         outputText("，喷出的女精随之溅满其上。她在你身下发颤，眼睛上翻，自己的高潮也从小穴深处扎根涌起；令你格外满意的是，尽管她已经沉浸在远远超过你的臣服快感之中，她仍然设法吞下了射进她嘴里的每一滴精液");
         if(get_player().wetness() >= 5)
         {
            outputText("而这可不容易，因为你感觉自己像是把整整一加仑都灌进了她喉咙里。等你差不多结束时，你照旧站起身，把最后一点喷在她的头发和衣服上");
         }
         outputText("。");
         outputText("[pg]等终于结束时，你长长地、低低地呼出一口气，感到强烈的满足感在体内发亮。你迷迷糊糊地低头看着自己的奴隶，她正粗哑地喘着气，双眼仍然闭着。你不由得注意到，她偶尔会冲动地舔舔嘴唇，仿佛还在寻找某种美味的味道。");
         outputText("[pg][say:天啊，那真是太——很不得了，女主人，]她终于说道。[say:我……我做得好吗？]");
         outputText("[pg]你揉了揉她软垂耳朵后面，告诉她她有进步了，但——你特意加重语气——她还是相当健忘。你紧盯着她，看她小声道歉，然后开始为你清理，舌头顺滑而美妙地绕着你湿透的阴道和你[hips]柔软的下侧舔动，把她找到的每一丝气味与汗水都舔干净。她舔舐你仍微微发疼的阴蒂时，显露出一种你觉得以前并没有的急切；你甚至觉得她在结束时压住了一声失望的呜咽。你温柔地笑了笑，起身打发她离开。");
         get_player().orgasm("Vaginal");
         dynStats(DynStat.Sens(-1));
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function firstVaginaOralTrainingStageThree() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你朝惠特尼微笑着，开始脱下你的……你停了下来，皱眉低头看她。她刚才是不是呜咽了一声？她一动不动，睁着那双又大又深的棕色眼睛，专注地仰望着你。你没有说话，假装对头顶的天空感兴趣，继续脱衣，而且动作放得很慢，小心而刻意地把每一件[armor]放到地上。这一次绝不可能听错——当你分开[hips]，露出自己的[vagina]时，惠特尼从喉咙深处发出呻吟，跪姿中不自在地扭动着，目光深深落进你的胯间。你柔和地笑了笑，坐下身，张开[legs]，然后等待。");
         outputText("[pg]等你坐稳后，这名犬女立刻把手探进内裤里，沉重的呼吸卡在喉间，目不转睛地盯着你。她急切地抽动了没几秒，便猛地向前一颤，舌头伸出，迫不及待地想要开始。她贴上你的腹部时浑身散发着热意，将嘴贴在你的[chest]上。她闭着眼，无声地让那条温热、法兰绒般柔软的舌头在你的柔软上滚动探寻，用唾液涂遍每一寸肌肤，偶尔还用牙齿轻轻含住你的皮肤，让血色浮上表面，只为了让你更享受她的舔舐；");
         if(!get_player().hasFuckableNipples())
         {
            outputText("她把你的每一颗[nipples]含入口中，贴近地吮吸舔弄");
         }
         else
         {
            outputText("她的舌头探向你每一颗小穴乳头，舔舐卷弄那敏感的粉色，直到它们因渴求而湿润");
         }
         outputText("。这个过程美妙而充满感官的挑逗，而她一边细致舔弄你的柔软，一边发出轻柔又充满欲望的呻吟，更让这一切令人满足。");
         if(get_player().lactationQ() > 0)
         {
            outputText("这很快就让你乳房里的液态暖意涌到顶点，乳汁从你的乳头上自在地凝成珠。惠特尼急切地舔舐、吮吸着咽下去，但让人满意的是，她还记得你的命令，只吮了一口就不情愿地停了下来。");
         }
         outputText("她向下沉去，离开你的乳头");
         if(!get_player().hasFuckableNipples())
         {
            outputText("坚硬如石，并且");
         }
         outputText("闪闪发亮，你的[vagina]也迫不及待地渗出湿意。");
         outputText("[pg]她一边继续把自己挑逗得浑身发热，一边将滚烫的小手指滑进你的大腿之间，找到你的[vagina]，慢慢开始玩弄起来；一根柔软的手指勾弄着你的[clit]，另一根则深深没入你的甬道，在你粉红的软肉里轻轻滑动、打转，用小心又挑逗的动作把那里弄得肿胀湿润。当你因她对你性器的伺候而发出赞许的呻吟时，她便俯身下去，把舌头探进你湿热而吮吸般的温暖之中。她开始动作时，你轻轻叹息；她舔舐着你的入口，探寻并卷入你的阴道，同时灵巧的手指还在继续挑弄她自己和你。");
         outputText("[pg]现在她已经对此驾轻就熟，精准地按压你褶皱中那些她知道会让你滴液、战栗的地方，交替照料你的[clit]和[vagina]。前一刻，她还用力弹弄你的小豆，同时用舌尖轻柔地点着你的入口；下一刻，她又深深舔进你的甬道，卷弄着你的敏感点，而手指只是温柔地停留在你的阴蒂周围。她断断续续发出的叹息穿过你的性器，与那里本就深深搏动的快感交融在一起，让你不由得沉溺其中，闭上眼，忘了该继续教导，完全迷失在你的母狗那柔软、精准又令人销魂的动作浪潮里，耳边只剩她的叹息和舔吸声。");
         outputText("[pg]直到这时，你终于遇到了一个问题。包住你小穴的湿热吮吸的嘴，以及按在你阴蒂上的手指停了片刻，伴随着一声深沉的呻吟；随后它们又重新开始，却在十秒后再次停下。你困惑地低头看去，看着你的母狗舔了你一会儿后，终于发现了问题所在：你试图把快感与服侍你在她心中连接起来的努力，最终奏效得过了头。惠特尼一只手在自己湿透的小穴上啪嗒啪嗒地抚弄着，给你舔穴已经让她兴奋到每隔一小会儿就必须彻底停下，免得违背你的命令直接高潮。她闭着眼，全心全意地专注于取悦你；当她又一次停下来靠在你粉红的肉上休息时，她因纯粹的挫败而低哼，身体里的热意怎么也降不下来。训练的最后一部分在你心中那片沉陷的猩红深处自行展开，你缓缓露出笑容。");
         outputText("[pg][say:停下。]你低声说道。随之传来一声不情愿的湿响。惠特尼那双棕色的大眼睛在你的[chest]下方过了好一会儿才聚焦到你身上，像是被小穴弄得晕晕乎乎。");
         outputText("[pg][say:对不起，]她含糊地说着，看起来是真的感到羞愧。[say:我忍不住——现在真的太刺激了。我说过的，主人，我说过我不会再有什么——]你温柔地嘘声制止了她。");
         outputText("[pg][say:把你的两只手都抱到我的大腿上。对，就是这样。]你低头对你的奴隶微笑，她的双臂现在已经紧紧环住你的[hips]。[say:现在回到你的主要任务上。]当你的[vagina]再一次被口腔的软肉包裹住时，你发出一声深深赞许的轻哼。犬女只花了几秒就适应了新的姿势，用灵巧的舌头同时取悦你的阴蒂和性器；她细瘦的双臂夹紧你的臀部，舌头则在你的性器里滑入，又环绕着每一处游走。");
         if(get_player().getClitLength() >= 4)
         {
            outputText("她借着新的支撑点，将你鼓胀的女阴茎整个含入口中，热切地吮吸起来；她一边做一边低哼，让狂喜的快感在你体内震颤开来。");
         }
         outputText("[pg]尽管她娴熟的动作很容易让你彻底迷失，但你暂时仍保持着清醒，密切注视着跪在你面前、全心全意取悦你的犬女。你甚至不必看她，就知道你的计划正完美奏效。压抑的哼声、舔吸声和呻吟声充满了你下方的空气；惠特尼的心智如今已经把性释放与自我贬低、取悦你深深联系在了一起，以至于她只是跪在地上、把嘴埋进你的小穴里，根本不需要任何帮助，就已经湿漉漉地悸动起来。");
         outputText("[pg]她的模样和声音以与席卷你性器的快感同样令人窒息的强度淹没你的感官，将你推向无法抗拒的高峰。你用[legs]把她的脑袋死死锁在自己湿透的性器上，开始用沉重的挺动使用她的嘴。当你开始这样使用她时，她发出深沉的呻吟；即使你在操她的脸，她也依旧做着最正确的事：在你向内顶入时把舌头刺进你的深处，而在你抽离时又美妙地滑回你的入口，用那条布匹般柔软肌肉的根部抵住你的阴蒂。");
         outputText("[pg]当你飞向那灿烂而狂喜的巅峰时，你已经找不到语言；你将头向后仰去，尽可能把自己埋进她里面，额头渗出汗珠，叫喊着骑乘她的舌头迎来高潮，在阴蒂与阴道同时攀上顶点的感觉中绷起脖颈");
         if(get_player().wetness() >= 5)
         {
            outputText("，用温热的雌性认可一次又一次浸湿她的嘴和脸");
         }
         outputText("。你下方传来一连串尖细而窒息的 squeal，她的身体在你周围颤抖；你不用看也知道，惠特尼也高潮了，只因为能把主人灌进她嘴里的每一滴带着麝香气息的甘美汁液全数吞下，就让她在涎水横流的喜悦中达到了顶点。");
         if(get_player().wetness() >= 5)
         {
            outputText("在狂喜的惯性之中，你从她嘴边抬起身，把最后的液体喷在她的头发和衣服上。犬女因自己猛烈的高潮而涨红了脸，仍尽全力用嘴去接住你飞溅的液滴。");
         }
         outputText("[pg]当你最后一次绷紧之后，你神圣般地叹息，漂浮在被舔穴后的迷蒙余韵里，意识高高荡起、失去形体。你闭上眼，而不用任何吩咐，惠特尼便用她扁平的舌头清理你的小穴，让舌头美妙地在你湿透的阴道周围探寻，把她在你褶皱和大腿内侧找到的每一缕淫液都舔干净，令人舒适得几乎发软。她一边做，一边发出瘾君子般低沉而幸福的呻吟，甚至又把舌头探回你已经释放过的[vagina]里，寻找最后一丝液体的痕迹。");
         outputText("[pg]诸神啊……光是这些声音和感觉，她轻轻舔弄你小穴的触感，以及她终于从你身上哄出最后一滴落到饥渴舌尖上时那声小小的喘息，就让你想再来一次……要不是她已经如此熟练地把你彻底榨干的话。你在她让你更加发酸之前把她拉起来，将她结实娇小的身体按进你闪亮的[chest]里，骄傲又满足地凝视着你的舔穴勇者。");
         outputText("[pg][say: 我想我明白了，]她低声说，晕乎乎地朝你咧嘴一笑，棕色的眼眸深处泛着躁动的红。");
         outputText("[pg]你揉了揉她的耳后，告诉她差不多了；她还有最后一课要学。你又紧紧抱住她滚烫的身体片刻，然后放她踉踉跄跄地离开。");
         get_player().orgasm("Vaginal");
         dynStats(DynStat.Sens(-1));
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function firstVaginaOralTraining() : void
      {
         clearOutput();
         whitneySprite();
         outputText("犬女慢慢照你的要求去做，俯下身，张开嘴，用平坦的舌头把嘴贴上你的[vagina]。她笨拙地一只手伸在内裤里，向前蹭了蹭，用一条纤细而有力的手臂环住你的[hips]之一，哼了一声稳住自己，然后舔上你珠光般的性器，用小心的舌尖滑动和轻扫探索着它。");
         outputText("[pg]你因那美妙的感觉而叹息，在她用湿热的舌头扫过每一寸够得到的地方时，明确地让她知道什么能取悦你。她的动作很笨拙，似乎找不到你的[clit]");
         if(get_player().getClitLength() > 3)
         {
            outputText("，尽管它实际上都快戳到她眼睛了");
         }
         outputText("，但她的舔弄还是很快让你湿润起来，急切地悸动着。可她并没有好好探入你的甬道，只是不停用舌头舔弄你的入口，动作越来越快。你皱起眉头；这感觉是不错，却远远不够满足，而她已经沉浸在这件事里，闭着眼舔舐你的胯间，像只狗在舔自己的……");
         outputText("[pg][say: 停下，]你坚定地说。她抬头看着你，一脸困惑。[say: 我不是你的屁股，也不需要清理。慢慢来……]你等到她的舌头再次滑过你的阴唇，才轻轻把臀部向前转去。[say: 然后现在，往我里面顶。就是这样！]她滚烫的舌头被你温热的肉壁包裹住，在你的甬道内壁上摩擦出美妙的感觉，让你忍不住喘息。她尖利的牙齿不适地蹭过你小穴周围的肌肤，但在你几句低声指示后便不再碍事；你开始慢慢引导她的舌头深入你的湿润之中，收紧内壁把它夹住，每一次都让它探得更深。");
         outputText("[pg]除了那只在内裤里摸索的手，她身体的其他部位都像是僵住了一样；而你的阴蒂被排除在口舌快感之外，已经因得不到满足而胀得发疼。不过没关系，迟早会轮到它的。现在，有她柔软的嘴唇，还有淹没你小穴的美妙快感；随着欲望将你攥得更紧，她温热的手也握住了你的大腿。她开始在你体内深处移动并卷动那条略显粗糙的软肉，含着你的性器发出呻吟，声音越来越响，直到她……");
         outputText("[pg][say: 停下！]你又一次严厉地喊道。惊讶的棕色眼睛抬头望向你，停在你小穴里的舌头也僵住了。[say: 奴隶不能在主人之前爽到，]你用不容置疑的语气说道。[say: 只有你表现得足够好，让我高潮了，你才有资格享受同样的特权。现在……继续舔，继续用手弄。试着同时做。好好地，慢慢来。]");
         outputText("[pg]你让她重新找回节奏，先是撩拨入口，接着又感性地探入你的甬道，越陷越深，让你的兴奋在她唇上凝成湿润的珠滴。令人满意的是，在你的明确指示下，她总算能让嘴巴和埋在自己小穴里的那只手同时动作；偶尔传来的含混呻吟，也让你的肉壁随之泛起令人愉悦的震颤。");
         outputText("[pg]血液在体内高唱起来，你终于松开欲望的缰绳，抓住她的头，急切地把她往你的[vagina]上顶去；那吸吮般柔软温热的感觉把你推向高潮。她很难适应你突然改变的节奏——你身下不时传来几声奇怪的\"啊！\"和\"呃！\"——但你已经顾不上了，反正她迟早得习惯。你挺直背，带着近乎陶醉的神情闭上眼，奔向顶点；你的[clit]在惠特尼嘴上方胀起，小穴先是颤抖，随后收缩，快感攫住了你的全身。");
         outputText("[pg][say: 你现在可以高潮了，贱狗，]在一阵令人满足的余韵低谷中，你声音沙哑地吐息道。");
         if(get_player().wetness() >= 5)
         {
            outputText("那狗女人被你每次收缩时灌进她嘴里的阵阵芳香淫液呛得咳嗽连连、含混喘息，更多液体从她鼻子里喷溅出来，又顺着下巴往下淌，把她胸前弄得一片狼藉；但这并没有阻止她疯狂地在内裤里动着手，拼命拨弄自己的阴蒂，同时努力应付你那湿得惊人的小穴。她本就已经在边缘，没过多久，眼睛便向上翻起，身体绷紧又颤抖，嘴里满是你的小穴和它的味道。那景象令你十分满意，于是你站到她上方，把最后几股带着麝香气息的兴奋液体喷在她脸上和衣服上。她几乎没有注意到，只是喘着气，陶醉地继续用手弄着自己。");
         }
         else
         {
            outputText("那狗女人被你滴进她嘴里的润滑液呛得咳嗽连连、含混喘息，即使你仍继续把自己往她嘴里推进，也有一些液体从她鼻子里滴了出来；但这并没有阻止她疯狂地在内裤里动着手，拼命拨弄自己的阴蒂，同时努力应付你小穴迫切的索求。她本就已经在边缘，没过多久，眼睛便向上翻起，身体绷紧又颤抖。");
         }
         outputText("[pg]最后，你们都平复下来。你低头看着自己的奴隶，享受着事后的空虚与恍惚；她目光失焦，似乎整个人都飘到了别处。很明显，她在舔小穴这件事上还是个彻头彻尾的新手，但一想到接下来要把她调教成专家，这份挑战便让你欲望翻涌。仿佛听见了你的想法一般，惠特尼眨了眨眼，抬头看向你，精液从她下巴上滴落，笑容有些不稳。");
         outputText("[pg][say: 呼。抱歉，我刚才做得不太好，主人，]她说道。[say: 你其他仆人肯定比我做得好多了。]");
         outputText("[pg]你告诉她别傻了——她很有潜力。不过她还有很多事必须记住，比如一个荡妇做完后，就该把自己伺候过的小穴清理干净。狗女孩\"啊！\"了一声，立刻又俯身凑向你愉悦酸胀、微微肿起的性器。等她把你湿润的胯间舔干净，完成这件令人享受的任务后，你才让她离开。");
         get_player().orgasm("Vaginal");
         dynStats(DynStat.Sens(-1));
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function firstOralTraining() : void
      {
         outputText("你低头对着新到手的奴隶咧嘴一笑。对一只名副其实的母狗来说，这个姿势确实很合适；不管她是不是有意摆出来的，她都做得完美无缺——渴望的眼神，缓缓摇动的尾巴，挺直的背与脖颈。你脑海中不由浮现出一块饼干放在她鼻尖上的诱人画面……但更迫切的念头很快将它驱散。看着跪在地上的狗女孩，肉欲的冲动一路沉到你的胯间。她专注地看着你慢慢脱下[armor]，露出");
         if(get_player().hasCock())
         {
            outputText("[eachCock]");
         }
         if(get_player().hasCock() && get_player().hasVagina())
         {
            outputText("以及");
         }
         if(get_player().hasVagina())
         {
            outputText("[vagina]");
         }
         outputText("。你用沙哑的声音告诉她，是时候让她学会如何侍奉你了。");
         outputText("[pg][say: 我——我想那么做，[master]，]她紧绷地回答。她似乎不知道该看哪里，目光在你的视线和你那充满压迫感的" + (get_player().hasCock() ? "[cock biggest]" : "丰润小穴") + "之间来回游移，最后还是落回你的眼睛上。[say: 我想尽我所能侍奉你，可是我……不知道能不能……只是，我其实从来没怎么——我是说，有过一两次，但我从来都不太……]你愈发高涨的欲望让你有些不耐烦，甚至想用一场痛快的颜面性交堵住她那怯生生的喋喋不休……但还是算了。要让没经验的奴隶发挥出最好水平，有远比这更好的办法。");
         outputText("[pg]你用温和的语气告诉她不用担心。你会确切地教她该如何取悦她的[master]，以及这又会如何反过来带给她前所未有的快感。再上几堂课，你自信地告诉她，她就会成为最出色、最不知羞耻的");
         if(get_player().hasCock())
         {
            outputText("吸屌高手");
         }
         else
         {
            outputText("舔穴高手");
         }
         outputText("[pg][say: 我、我会试试的，[master]，]她说道。你伸手下去，托住她的下颌。");
         outputText("[pg][say: 不，]你坚定地说道。");
         if(get_silly())
         {
            outputText("[say: 要么做，要么不做。没有试试。]");
         }
         else
         {
            outputText("[say: 你会做到的。]");
         }
         outputText("那个犬女的嘴角浮现出决心。");
         outputText("[pg][say: 是的，[master]。我会试——我会做到的。]她深吸一口气，把视线转向" + (get_player().hasCock() ? "[eachCock]" : "[vagina]") + "，那模样简直像是要踏上一场马拉松。");
         outputText("[pg][say: 首先，]你一边坐稳，一边说道，[say: 把一只手伸进你的内裤里。找到你那又湿又舒服的小穴。]你看着她，嘴角忍不住泛起一丝笑意；她满脸通红，在你面前挪动着身子。[say: 你知道该怎么做吧？在农场那些寂寞的夜晚……很好。慢慢来，放轻松。眼睛往下看。]说最后一句时，你的语气格外坚决，同时把你的[hips]张得更开。惠特尼轻轻咽了咽口水，一边抚弄自己那颗小小的肉粒，一边盯着你的" + (get_player().hasCock() ? "[eachCock]" : "[vagina]") + "；因为你这个新来的、紧张兮兮的奴隶所展现出的模样，那里已经" + (get_player().hasCock() ? "半硬起来" : "湿润起来") + "。[say: 很好，]你低声说道。[say: 现在……伸过来，开始舔。]");
      }
      
      public function firstCockOralTrainingStageTwo() : void
      {
         clearOutput();
         whitneySprite();
         outputText("解开[armor]的下半部分，你带着一贯温和的笑容告诉她，该上下一课了。你注意到这次跪在你面前的狗女人有些细微的不同；她平日里那股紧张劲似乎已经不见了，只是安静而坚定地注视着你的[cock biggest]。你坐稳身子，张开你的[hips]，停顿片刻，没有再给出任何指示。");
         outputText("[pg]你的信任立刻得到了回报。惠特尼清楚地知道自己该做什么，她把一只手伸进内裤里，目光平稳地落在[eachCock]上，一边轻轻喘着气抚弄自己，让情绪慢慢升起；随后她张开嘴，把灼热、略带粗糙的舌头贴上你的龟头。她只小心地舔了几下，扫过那些她知道会让你涨得滚烫的敏感点，便张大嘴，用湿热的口腔包住你的[cockHead biggest]。她上下摆动脑袋时，你发出一声深深的赞许；无需你鼓励，她便沿着你的肉棒上下动作，将越来越多的长度吞进她那迎接你的嘴里。");
         outputText("[pg]众神在上，她甚至学会了同时使用舌头；那舌头愉悦地摩擦着你肉棒的下侧，在动作间舔弄着裸露的根部，那不断变化的触感与她柔软、吸紧的脸颊截然不同。她含着你发出呜咽，开始更快地移动脑袋，收紧嘴巴，像是在用你操弄自己。要是她继续这样下去，你很快就要射出来了……");
         outputText("[pg]你费了点力气，才把一只手稳稳按在她肩上，无声地示意她停下。你胀大的[cock biggest]从她嘴里弹了出来，而惠特尼眼中的担忧也同样深重，透着挫败。");
         outputText("[pg][say: 对不起，[master]。我做错什么了吗？]");
         outputText("[pg][say: 完全没有，]你呻吟着闭上眼，默默让体内的热度稍稍平息。[say: 你学得很好，也已经进步了很多。但既然你已经掌握了基本功，就该学会如何完整地服侍我了。现在——继续拨弄你那荡妇小穴，我来教你。]你等到惠特尼脸上的焦虑融化，被深沉的欲望取代，身体也随着手上的动作轻轻抽动起来，才开始讲解。");
         if(get_player().hasVagina() && get_player().balls > 0)
         {
            outputText("[pg][say: 首先，每次开始之前，你都必须先照顾好这些。]你抬起[cock biggest]，很轻易就把[balls]暴露在她面前。[say: 一个好荡妇知道，女主人的蛋蛋需要先好好擦亮，她才有资格吞下女主人的肉棒。让我看看你做得怎么样。]");
            outputText("[pg]稍微停顿了一下后，惠特尼把脸埋进你的胯间，埋得太深，你已经看不见她的表情了。你感觉到她扁平的舌头在你敏感的卵蛋上游走，轻轻揉弄，又把唾液涂满其上，不由得叹了口气。你心想，这任务总算是再适合她那条舌头不过了，差点没忍住发出一声失控的傻笑。[say: 每一寸都舔到……很好。含住它们……非常好！]她把你其中一颗蛋完全含入口中，极其轻柔地拉扯着，令美妙的感觉在你胯间阵阵震颤，你不由得微微喘了一声。");
            outputText("[pg][say: 哦，你还挺有天赋的。既然你已经掌握了这个，接下来就学学另一个环节。不过这可比当个乖乖舔蛋的小家伙要精细一点，所以要仔细听我的指示。]惠特尼从[eachCock]旁探出视线。她的手还塞在内裤里，微微喘着气，双颊泛红。你鼓励地朝她笑了笑。[say: 在它们后面，你会找到我的小穴。我觉得既然你跪在那里取悦自己，至少也该对你的女主人回以同样的礼貌，对吧？一开始慢一点，轻一点。]");
            outputText("[pg]惠特尼小心翼翼地探入你的[hips]之间，越过[eachCock]和被口水舔得发亮的[balls]，直到她光滑温暖的手指按上你的[vagina]。你的阴唇已经被她先前侍弄你男性器的动作弄得湿润，她起初笨拙地摸索着，但随着逐渐了解它的形状，也变得越来越有信心，慢慢推入你湿润的穴中。");
            outputText("[pg]她在这方面至少还算有点头绪，一边探索你的[vagina]，一边用手指抠弄自己。不过一开始她仍然笨得令人恼火，不是找不准角度，就是用指尖太用力地撞到你的[clit]。等你恼怒地低吼过后，她的触碰又变得太轻，像是怕弄疼你似的。");
            outputText("[pg]不过最后她总算开始摸到门道，先缓慢地绕着你的阴蒂打圈，再轻轻用手指从上面抚过，每一次都让它从包皮下鼓出得更明显。她甚至还设法把食指探入你体内，一边美妙地勾弄你的阴道内壁，直到你的整个雌性性器都像是在快感中舒展开来，湿亮发光。");
            outputText("[pg][say: 很好，]你沙哑地说，费了些力气才让自己的声音保持平稳，美妙的感觉正像脉络一样在你胯间蔓延，[say: 现在才是真正的考验。两只手都保持原位，然后继续回来吸我的肉棒。]惠特尼偷得片刻休息，她的手这会儿想必已经有些酸了，随后才退回来，专注于你的[cock biggest]。你的[cockHead biggest]再次被甜美而绞紧的温热包裹，同时还有柔滑的压力继续抚弄你的[clit]和[vagina]，你深深叹了口气，闭上了眼。");
            outputText("[pg]麻烦再一次出现了。你让你的狗女孩同时做三件激烈的事，而她摇摇晃晃地维持着这种平衡，通常不是忘了继续抠弄你，就是嘴里含着肉棒时忘了抠弄自己。你盯着她，在她跟不上时低声给出指示和鼓励，尽管随着热意不断淹没你的男性与女性性器，这也变得越来越困难。");
            outputText("[pg]最后，你再也压不住欲火。你抓住她的头，开始深深顶进她的" + (get_player().biggestCockLength() < 8 ? "嘴里" : "喉咙里") + "。她任由你使用她的嘴，呼吸从鼻腔里嘶嘶漏出，还努力让手指继续湿滑地抽弄；你轻声低吟，你粗暴的动作迫使她的双手快速而凌乱地移动，掠过你急切鼓胀的敏感小粒，让你更加疯狂地抽送进她湿热、像在吮吸般的温暖之中。");
            outputText("[pg][say: 射吧，贱货。]你咬着牙说，自己也冲上高潮。你听见惠特尼闷闷的呻吟，你的马眼扩张开来，将精液泵进她喉咙深处；你的[vagina]随之颤抖，并在高潮中紧紧收缩，仿佛与你的男性器一同陷入狂喜，你愉悦地大声喘笑，" + (get_player().wetness() <= 2 ? "用雌性淫液打湿你奴隶的手" : "用雌性淫液彻底浸透你奴隶的手臂") + "。她含着你浑身发颤，眼睛上翻，自己的高潮也在小穴深处扎根；让你极为满意的是，尽管她已经沉浸在遥远的屈从快感之中，仍然设法吞下了你射出的每一滴精液");
            if(get_player().cumQ() >= 1500)
            {
               outputText("——这可不是什么容易的事，毕竟那感觉就像你把足足一加仑的量都射进了她的喉咙。等你差不多结束时，和往常一样，你把最后几道乳白精液喷在她的脸和衣服上");
            }
            outputText("。");
            outputText("[pg]等终于结束时，你长长地、低低地呼出一口气，感到强烈的满足感在体内发亮。你迷迷糊糊地低头看着自己的奴隶，她正粗哑地喘着气，双眼仍然闭着。你不由得注意到，她偶尔会冲动地舔舔嘴唇，仿佛还在寻找某种美味的味道。");
            outputText("[pg][say: 天啊，刚才真是太棒——太不得了了，女主人，]她最后说道。[say: 我……我做得好吗？]你揉了揉她软塌塌的耳朵后面，告诉她她确实越来越好了，不过——你特意强调——她还是相当健忘。你仔细看着她低声道歉，然后开始清理你。她先用舌头美妙地舔过你湿淋淋的小穴，把找到的每一滴体液都舔干净，接着又抬起身去舔你还在渗出的[cock biggest]。她舔舐你龟头时表现出的那份急切，是你觉得先前没有见过的；而且你觉得她结束时，甚至还压下了一声失望的呜咽。你轻轻一笑，站起身，让她离开了。");
         }
         else if(get_player().hasVagina() && get_player().balls == 0)
         {
            outputText("[pg][say: 这可比单纯当个乖乖含棒的小家伙要精细一点，所以要仔细听我的指示。]惠特尼从[eachCock]旁探出视线。她的手还塞在内裤里，微微喘着气，双颊泛红。你鼓励地朝她笑了笑。[say: 在我的[dickplural]后面，你会找到我的小穴。我觉得既然你跪在那里取悦自己，至少也该对你的女主人回以同样的礼貌，对吧？一开始慢一点，轻一点。]");
            outputText("[pg]惠特尼小心翼翼地探入你的[hips]之间，越过[eachCock]，直到她光滑温暖的手指按上你的[vagina]。你的阴唇已经被她先前侍弄你男性器的动作弄得湿润，她起初笨拙地摸索着，但随着逐渐了解它的形状，也变得越来越有信心，随后慢慢推入你湿润的穴中。");
            outputText("[pg]她在这方面至少还算有点头绪，一边探索你的[vagina]，一边用手指抠弄自己，不过一开始她仍然笨得令人恼火，不是找不准角度，就是用指尖太用力地撞到你的[clit]。等你恼怒地低吼过后，她的触碰又变得太轻，像是怕弄疼你似的。");
            outputText("[pg]不过最后她总算开始摸到门道，先缓慢地绕着你的阴蒂打圈，再轻轻用手指从上面抚过，每一次都让它从包皮下鼓出得更明显。她甚至还设法把食指探入你体内，一边美妙地勾弄你的阴道内壁，直到你的整个雌性性器都像是在快感中舒展开来，湿亮发光。");
            outputText("[pg][say: 很好，]你沙哑地说，费了些力气才让自己的声音保持平稳，美妙的感觉正像脉络一样在你胯间蔓延。[say: 现在才是真正的考验。两只手都保持原位，然后继续回来吸我的肉棒。]惠特尼偷得片刻休息，她的手这会儿想必已经有些酸了，随后才退回来，专注于你的[cock]。你的[cockHead biggest]再次被甜美而绞紧的温热包裹，同时还有柔滑的压力继续抚弄你的[clit]和[vagina]，你深深叹了口气，闭上了眼。");
            outputText("[pg]麻烦再一次出现了。你让你的狗女孩同时做三件激烈的事，而她摇摇晃晃地维持着这种平衡，通常不是忘了继续抠弄你，就是嘴里含着肉棒时忘了抠弄自己。你盯着她，在她跟不上时低声给出指示和鼓励，尽管随着热意不断淹没你的男性与女性性器，这也变得越来越困难。");
            outputText("[pg]最后，你再也压不住欲火。你抓住她的头，开始深深顶进她的" + (get_player().biggestCockLength() < 8 ? "嘴里" : "喉咙里") + "。她任由你使用她的嘴，呼吸从鼻腔里嘶嘶漏出，还努力让手指继续湿滑地抽弄；你轻声低吟，你粗暴的动作迫使她的双手更快也更凌乱地移动，掠过你急切鼓胀的敏感小粒，让你更加疯狂地抽送进她湿热、像在吮吸般的温暖之中。");
            outputText("[pg][say:射吧，母狗，]你咬牙说着，自己也冲向高潮。惠特尼含混的呻吟传入你耳中；你的马眼扩张开来，将精液泵进她喉咙。你的[vagina]随即颤抖、收紧，在高潮中与你的男性性器一同沉醉地呼应，" + (get_player().wetness() <= 2 ? "弄湿了你奴隶的手" : "把你奴隶的手臂彻底浸透") + "，淌满女体精液。她含着你浑身发颤，眼睛上翻，也在自己的小穴里找到了高潮；而最令你满足的是，尽管她已经沉入遥远的屈从快感之中，却依旧设法吞下了你射出的每一滴精液");
            if(get_player().cumQ() >= 1500)
            {
               outputText("——这可不是什么容易的事，毕竟那感觉就像你把足足一加仑的量都射进了她的喉咙。等你差不多结束时，和往常一样，你把最后几道乳白精液喷在她的脸和衣服上");
            }
            outputText("。");
            outputText("[pg]等终于结束时，你长长地、低低地呼出一口气，感到强烈的满足感在体内发亮。你迷迷糊糊地低头看着自己的奴隶，她正粗哑地喘着气，双眼仍然闭着。你不由得注意到，她偶尔会冲动地舔舔嘴唇，仿佛还在寻找某种美味的味道。");
            outputText("[pg][say: 天啊，那真是太——太厉害了，女主人，]她终于开口说道。[say: 我……我做得好吗？]你揉了揉她软塌塌的耳后，告诉她确实有进步了，不过——你特意加重语气——她还是相当健忘。你仔细看着她低声道歉，然后开始清理你。她先用舌头在你湿透的阴道周围美妙地舔舐，把能找到的每一滴体液都舔干净，随后才抬起身，来到你还在渗液的 [cock biggest] 前。她舔舐你的龟头时，表现出一种你觉得以前没有的热切；等她舔完时，你甚至觉得她还压下了一声失望的呜咽。你轻轻一笑，站起身来，让她离开了。");
         }
         else if(!get_player().hasVagina() && get_player().balls > 0)
         {
            outputText("[pg][say:首先，每次开始之前，你都得先练这个。]你抬起[cock]，很容易就把[balls]暴露在她面前。[say:一个好骚货知道，主人的卵蛋得先好好伺候干净，她才有资格吞下他的肉棒。让我看看你做得怎么样。]");
            outputText("[pg]惠特尼稍稍停顿了一下，随后把脸深深埋进你的胯间，深到你已经看不见她的表情。你感觉到她平坦的舌头在你敏感的卵蛋上游走，轻轻揉弄着它们，又用唾液将其浸湿，不由得叹了口气。至少这项任务很适合她的舌头，你这么想着，费了好大劲才忍住一阵荒唐的笑。[say:每一寸都舔到……很好。稍微含着吸一会儿……非常好！]她把你其中一颗蛋蛋整个含入口中，极其轻柔地牵扯着，你不由得轻喘一声，美妙的感觉在你胯间嗡嗡震荡。");
            outputText("[pg][say:噢，你很有天赋嘛。]");
            if(int(get_player().cocks.length) == 1)
            {
               outputText("[pg]你向后靠去，惬意地打量着她。[say:把另一只手放在这里——对，就是这样——然后你就可以继续了。]惠特尼用另一只手抓住你[ass]的一边，趁机休息了片刻；那只埋在她小穴里的手这会儿无疑已经有些酸了。随后她又往后退开，把注意力集中到你的[cock biggest]上。你的[cockHead biggest]再一次被甜美而紧裹的温暖包住，同时你身后也被柔滑的压力握住，你深深叹息，闭上了眼睛。");
               outputText("[pg]你盯着她，在她动作慢下来时低声给出指示和鼓励，不过随着你的性器被热意不断淹没，这也变得越来越困难；她的手指偶尔会压上你[asshole]周围柔软的部位，那是一种轻微却坚实得令人愉悦的触感，与你肉棒深陷其中的口腔那种柔软快感形成对比，反而让 pleasure 更深了一层。");
               outputText("[pg]最后，你再也压不住欲望。你抓住她的头，开始深深插进她的" + (get_player().biggestCockLength() < 8 ? "嘴里" : "喉咙里") + "。她任由你使用她的嘴，呼吸从鼻腔里嘶嘶挤出，还努力让手指继续湿滑地抽弄；你低声哼着，自己猛烈的动作逼得她的手稍稍压进你的屁股，让你更加疯狂地泵入她湿热、榨取般的温暖之中。");
               outputText("[pg][say: 射吧，婊子，]你咬着牙说，同时也冲上了自己的高潮。惠特尼含混的呻吟传入你耳中，你的马眼张开，将精液泵进她喉咙深处；她在你身下颤抖，眼睛上翻，手指在小穴里摸索着，也迎来了自己的高潮。让你无比满意的是，尽管她沉溺在远胜于你的臣服快感之中，仍然设法吞下了你射出的每一滴精液");
               if(get_player().cumQ() >= 1500)
               {
                  outputText("——这可不是什么容易的事，毕竟那感觉就像你把足足一加仑的量都射进了她的喉咙。等你差不多结束时，和往常一样，你把最后几道乳白精液喷在她的脸和衣服上");
               }
               outputText("。");
            }
            else
            {
               outputText("[pg]你向后靠去，惬意地打量着她。[say:现在进行第二部分。这个比单纯当个会舔蛋的小乖货要更讲技巧一点，所以我要你认真听。]你稍稍挪动臀部，示意自己的[cock biggest2]。[say:用手握住那根。既然你跪在那里取悦自己，我想你至少也该给你的主人同样的照顾，嗯？一开始慢一点、轻一点。]");
               outputText("[pg]短暂的停顿后，她慢慢开始揉动你；你那根被冷落的第二根肉棒，很快就在她温暖而光滑的掌心里硬了起来。虽然她对自己的小穴很有经验，可手里握着男性器官时，她又一次显得笨拙而生疏。她先是小心翼翼地捧着你，仿佛手里握着一枚导弹；等你让她握得贴近些，她又捏得太紧。不过到最后，她还是逐渐摸到了窍门，以不错的节奏套弄你，直到你的[cock biggest2]在丝绒般的摩擦下胀起、急切而滚烫。");
               outputText("[pg][say: 很好，]你嗓音低哑地说，费了些力气才让声音保持平稳，诱人的快感正沿着你的胯间蔓延。[say: 接下来才是真正的考验。两只手都别动，回去继续含我的鸡巴。]惠特尼偷得片刻休息，她的双手这会儿无疑已经有些酸了，然后才退开些，把注意力集中到你的[cock biggest]上。你的[cockHead biggest]再度被甜美而绞紧的温热包裹，顺滑的压力也继续缠绕着你的第二根肉棒，你深深叹息，闭上了眼。");
               outputText("[pg]困难再一次出现了。你让你的狗女孩同时做三件刺激的事，而她这场平衡表演做得摇摇晃晃；嘴里含满肉棒时，她经常不是忘了继续揉你，就是忘了继续揉自己。你盯着她，在她动作慢下来时低声给出指示和鼓励，不过随着你那淫乱的男性性器被热意不断淹没，这也变得越来越困难。");
               outputText("[pg]最终，你再也压不住欲望。你抓住她的头，开始深深挺进她的" + (get_player().biggestCockLength() < 8 ? "嘴里" : "喉咙里") + "。她任由你使用自己的嘴，只能从鼻中发出喘鸣，同时努力让两处挑逗的手指都继续动作；你发出愉悦的低吟，自己猛烈的动作逼得她放在你[cock biggest2]上的那只手更快、更凌乱地抽动，紧紧榨弄你那急迫胀起的肉棒，让你更加疯狂地在她湿热而榨取般的温暖中抽送。");
            }
            outputText("[pg][say: 射吧，婊子，]你咬着牙说，同时也冲上了自己的高潮。惠特尼含混的呻吟传入你耳中，你的马眼张开，将精液泵进她喉咙深处；她在你身下颤抖，眼睛上翻，手指在小穴里摸索着，也迎来了自己的高潮。让你无比满意的是，尽管她沉溺在远胜于你的臣服快感之中，仍然设法吞下了你射出的每一滴精液");
            if(get_player().cumQ() >= 1500)
            {
               outputText("——这可不是什么容易的事，毕竟那感觉就像你把足足一加仑的量都射进了她的喉咙。等你差不多结束时，和往常一样，你把最后几道乳白精液喷在她的脸和衣服上");
            }
            outputText("。");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("被她握在手里的第二根肉棒也和第一根一样急切地射出精液，双重高潮夹击得你额头渗出汗珠；它慷慨的释放在她的裙子上涂开一片。");
            }
         }
         else if(!get_player().hasVagina() && get_player().balls == 0)
         {
            if(int(get_player().cocks.length) > 1)
            {
               outputText("[pg][say: 这可比单纯当个会含鸡巴的乖孩子要讲究一点，所以我要你认真听。]你微微动了动腰，示意自己的[cock biggest2]。[say: 把手握到这上面。既然你跪在那儿取悦自己，至少也该给你的主人同样的照顾，对吧？一开始慢一点，轻一点。]");
               outputText("[pg]短暂的停顿后，她开始慢慢摩挲你，你轻叹一声，那根被冷落的第二阴茎很快就在她温暖光滑的掌心里硬了起来。虽然她对自己的小穴很有经验，可手里握着男性器官时，她依旧笨拙又生涩；一开始小心翼翼得像握着一枚导弹，等你让她握紧一点时，又一下子攥得太用力。不过最后她还是渐渐摸到了门道，用不错的节奏套弄着你，直到你的[cock biggest2]在那天鹅绒般的摩擦中胀大、发烫，急不可耐。");
               outputText("[pg][say: 很好，]你嗓音低哑地说，费了些力气才让声音保持平稳，诱人的快感正沿着你的胯间蔓延。[say: 接下来才是真正的考验。两只手都别动，回去继续含我的鸡巴。]惠特尼偷得片刻休息，她的双手这会儿无疑已经有些酸了，然后才退开些，把注意力集中到你的[cock biggest]上。你的[cockHead biggest]再度被甜美而绞紧的温热包裹，顺滑的压力也继续缠绕着你的第二根肉棒，你深深叹息，闭上了眼。");
               outputText("[pg]麻烦再一次出现了。你让你的犬娘同时做三件激烈的事，她这场平衡表演做得摇摇晃晃，嘴里塞满鸡巴时，往往不是忘了继续揉你，就是忘了继续揉自己。你一直盯着她，在她撑不住时低声给出指示和鼓励，只是随着灌满你下流男性性器的热意不断增强，这也变得越来越困难。");
               outputText("[pg]最后，你再也压不住欲望。你抓住她的头，开始深深插进她的" + (get_player().biggestCockLength() < 8 ? "嘴里" : "喉咙里") + "。她任由你使用她的嘴，呼吸从鼻腔里带着嘶哑挤出，还努力让两边挑逗的手指继续动作；你低声哼着，自己猛烈的抽送逼得她放在你[cock biggest2]上的手越撸越快、越发凌乱，紧紧绞弄你急剧胀起的肉棒，让你更加疯狂地泵入她湿热、榨取般的温暖之中。");
            }
            if(int(get_player().cocks.length) == 1)
            {
               outputText("[pg][say: 把另一只手放在这里——对，就是这样——然后你就可以继续了。]惠特尼的另一只手抓住你[ass]的一边，稍稍偷了片刻休息；她那只埋在小穴里的手此刻无疑已经有些酸了。随后她退开些，把注意力集中到你的[cock]上。你的龟头再度被甜美而绞紧的温热包裹，顺滑的压力也握住了你的臀部，你深深叹息，闭上了眼。");
               outputText("[pg]你一直盯着她，在她撑不住时低声给出指示和鼓励，只是随着灌满你性器的热意不断增强，这也变得越来越困难；她的手指偶尔会按到你[asshole]的软肉上，那是一种轻微却明确的硬实触感，反倒衬得你嘴中沉溺的柔软快感更加深切。");
               outputText("[pg]最后，你再也压不住欲望。你抓住她的头，开始深深插进她的" + (get_player().biggestCockLength() < 8 ? "嘴里" : "喉咙里") + "。她任由你使用她的嘴，呼吸从鼻腔里嘶嘶挤出，还努力让手指继续湿滑地抽弄；你低声哼着，自己猛烈的动作逼得她的手稍稍压进你的屁股，让你更加疯狂地泵入她湿热、榨取般的温暖之中。");
               outputText("[pg][say: 射吧，婊子，]你咬着牙说，同时也冲上了自己的高潮。惠特尼含混的呻吟传入你耳中，你的马眼张开，将精液泵进她喉咙深处；她在你身下颤抖，眼睛上翻，手指在小穴里摸索着，也迎来了自己的高潮。让你无比满意的是，尽管她沉溺在远胜于你的臣服快感之中，仍然设法吞下了你射出的每一滴精液");
               if(get_player().cumQ() >= 1500)
               {
                  outputText("——这可不是什么容易的事，毕竟那感觉就像你把足足一加仑的量都射进了她的喉咙。等你差不多结束时，和往常一样，你把最后几道乳白精液喷在她的脸和衣服上");
               }
               outputText("。");
            }
         }
         if(!get_player().hasVagina())
         {
            outputText("[pg]等终于结束时，你长长地、低低地呼出一口气，感到强烈的满足感在体内发亮。你迷迷糊糊地低头看着自己的奴隶，她正粗哑地喘着气，双眼仍然闭着。你不由得注意到，她偶尔会冲动地舔舔嘴唇，仿佛还在寻找某种美味的味道。");
            outputText("[pg][say: 诸神啊，那真是太棒——呃，真是……主人，]她最后说道。[say: 我……我做得好吗？]你揉了揉她耷拉耳朵后面的地方，告诉她她正在进步，不过——你刻意强调了这一点——她还是相当健忘。你看着她小声道歉，然后又俯身去清理你还在流淌的[cock biggest]");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("和[cock biggest2]");
            }
            outputText("。她舔舐你鸡巴[headplural]时表现出的热切，是你觉得以前并不存在的；你甚至觉得她结束时还压住了一声失望的呜咽。你轻轻一笑，起身穿好衣服，打发她离开。");
         }
         get_player().orgasm("Generic");
         dynStats(DynStat.Sens(-1));
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function firstCockOralTrainingStageThree() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你对惠特尼微微一笑，开始脱下你的……你停住动作，皱着眉低头看她。她刚才是不是呜咽了一声？她完全一动不动，用那双大而深的棕色眼睛专注地盯着你。你没有说话，假装对头顶的天空很感兴趣，继续慢慢脱衣，一件一件小心而刻意地把你的[armor]放到地上。这一次绝不会看错——当你的[cock biggest]终于晃入视野时，惠特尼从喉咙深处发出一声呻吟，跪着的姿势让她不安地扭动起来，目光深深钉在你的胯间。你柔和地笑了笑，坐下身，张开你的[hips]，然后等待。");
         if(!get_player().hasVagina())
         {
            outputText("[pg]你刚刚坐稳，犬女就立刻把手伸进自己的内裤里，盯着你的[cock biggest]，沉重的呼吸卡在喉咙间。她急切地抽动了不过几秒，就猛地向前一颤，舌头伸了出来，迫不及待地想要开始。");
            if(get_player().balls > 0)
            {
               outputText("你幸福地叹息着，那条温暖、平坦、像法兰绒一样的舌头铺过你的[balls]，覆盖每一寸。每颗敏感的卵蛋都被你的奴隶含入口中，轻柔地吮吸，直到它们因积蓄的热意而嗡嗡发胀。她细致爱抚着它们，而从你双腿间飘上来的柔软淫荡呻吟，更让这份疼爱变得格外美妙。");
            }
            outputText("[pg]她抬起头，直到与半勃起的肉棒齐平，然后用漫长、细致又精妙的舔舐让它彻底硬挺起来。她的舌头沿着整根肉棒游走，接着又绕着龟头打转，按压着那些她知道会让你变得沉重紧绷、渴求难耐的敏感点。");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("在她用美妙的感觉沐浴你的[cock biggest]时，她又伸手握住你的[cock biggest2]，时而放松、时而收紧，沿着棒身上下滑动，直到它也和她正在舔弄的那根一样硬如磐石。她已经不再难以同时做三件事了——湿润的粗糙感与干爽的顺滑感完美交织，而她仍继续抚弄自己，让你在那不断变化、淹没你过盛肉棒的快感中张开了嘴。");
            }
            outputText("[pg]当她终于用嘴包住你挺出的顶端时，你忍不住愉悦地呻吟出声。她做得极其缓慢，让薄唇一点点沿着你的肉棒滑下，同时凹陷双颊，用错落有致的吸力，将越来越多的[cock biggest]包裹进吮吸与湿热之中。她的脑袋上下起伏，立刻找到了性感的节奏：当嘴退回你圆鼓鼓的顶端时，她的舌头便向下滑去；当她把你的肉棒深深吞入口中时，舌头又向上回卷。她用这种交替的动作，将一阵阵纯粹的狂喜送进你的胯间。");
            outputText("[pg]你闭上眼睛，心满意足地向后靠去，任由快感不可阻挡地积聚。也正是在这里，你终于遇到了一个问题。包裹着肉棒的湿润吸吮忽然停了片刻，伴随着一声深沉的呻吟，然后又重新开始，却在十秒后再次停下。你困惑地低头看去，观察你的母狗吞吐了几次后，终于发现了问题所在：你努力在她脑中把快感与服侍你联系起来，而这件事现在终于成功得有些过头了。");
            outputText("[pg]惠特尼一只手在自己湿透的小穴上飞快抚弄，吸吮你的肉棒已经让她兴奋到每隔片刻就不得不停下来，免得违背你的命令直接高潮。她闭着眼睛，全心全意地想着取悦你；当她又一次停下，让自己在撑开双唇的胀大肉块上休息时，她因深深的挫败而低哼，体内的热意怎么也不肯平息。训练的最后一部分在你脑海中那片沉陷的猩红角落里自行展开，你慢慢咧嘴一笑。");
            outputText("[pg][say: 停下，]你低声说。伴随着一声不情愿的啵响，惠特尼松开了嘴。她那双大大的棕色眼睛越过 [eachCock]，过了好一会儿才聚焦到你身上，已经被肉棒弄得晕乎乎的。");
            outputText("[pg][say: 对不起，]她低声咕哝，看上去竟然真的很羞愧。[say: 我不能——现在实在太爽了。我告诉过你，[master]，我说过我根本不会——]你温和地让她安静下来。");
            if(int(get_player().cocks.length) > 2)
            {
               outputText("[pg][say: 把另一只手放到这上面。]她慢慢把手指从内裤里抽出来，环住你的[cock biggest3]。那股又热又湿的压力如今套住了你这团下流肉棒丛中的又一根，你为此叹息出声。[say: 同时弄这两根——对，就是这样……]她很快就超出了你的期待，迅速找到稳定的节奏，用顺滑而精准的握法同时抽动你的肉棒。重新把注意力集中到[eachCock]上后，她很快忘掉了自己的怀疑，轻易又滑回了臣服的恍惚状态。");
            }
            else
            {
               outputText("[pg][say: 把手放在这里。]她慢慢把手指从内裤里抽出来，环住你的[cock biggest]根部。那股又热又湿的压力如今套在你被唾液润亮的肉棒最底端，你为此叹息出声。[say: 就在那里动……对，就是这样……]她很快就找到稳定的节奏，你不禁叹息");
               if(int(get_player().cocks.length) > 1)
               {
                  outputText("用顺滑而精准的握法同时抽动你的两根肉棒");
               }
               outputText("。");
            }
            outputText("[pg][say: 现在回到你的主要任务上。]当你的[cock biggest]再次被口腔的软肉包裹时，你发出一声深深赞许的轻哼。她的舌头沿着你的棒身上下滑动，仍是那种娴熟而交替的摆动");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("与此同时，你的[cock biggest2]");
               if(int(get_player().cocks.length) > 2)
               {
                  outputText("和[cock biggest3]");
               }
               outputText("在她抽动的手中因快感而鼓胀、颤动");
               if(int(get_player().cocks.length) > 2)
               {
                  outputText("");
               }
            }
            outputText("。尽管她娴熟的动作几乎能让你彻底沉沦，你此刻还是勉强稳住心神，紧盯着跪在你面前的犬女；她现在已经全心全意地只为取悦你了。");
            outputText("[pg]你甚至不用看她，也知道你的计划进行得完美无缺。你身下充满了含混的闷哼、吮吸声和呻吟声；惠特尼的意识已经把性释放与取悦你深深绑定在了一起，以至于她只是跪在那里，嘴和双手被你的肉棒塞满，就已经湿得滴落、阵阵抽动，根本不需要任何额外刺激。");
            outputText("[pg]她的模样和声音淹没了你的感官，就像包裹着你男性象征的快感一样令人窒息。你向上挺动，达到一种无法抗拒的高潮，抓住她的头，开始深深地插入她紧致吸吮的" + (get_player().biggestCockLength() < 8 ? "嘴里" : "喉咙里") + "。当你开始这样使用她时，她发出了深深的呻吟，即使你在操她的脸，她也做得很完美，当你向外拔出时，她凹陷脸颊，甜美地吸吮你退出的肉棒，然后完全放松嘴巴，让你在果断地向内刺入时，能以最好的角度进入她" + (get_player().biggestCockLength() < 8 ? "口腔后部" : "食道") + "那美丽、紧致的温暖中。");
            outputText("[pg]当你冲上那灿烂而狂喜的高潮时，已经说不出话来；你把头向后仰去，尽可能把肉棒埋进她体内，额头渗出汗珠。每一股精液喷进她喉咙时，你都发出不成声的低吼。你身下传来一连串尖细而窒息的叫声，她的身体在你周围颤抖；不用看你也知道惠特尼也高潮了，只因为她的主人把浓稠的种子 thrust 进她嘴里，而她正满心欢喜地吞下每一滴。");
            if(int(get_player().cocks.length) > 1 || get_player().cumQ() >= 1500)
            {
               outputText("[pg]");
            }
            if(int(get_player().cocks.length) > 1)
            {
               outputText("她也一刻没忘记那根肉棒");
               if(int(get_player().cocks.length) > 2)
               {
                  outputText("");
               }
               outputText("还被她攥在手里；她榨弄着");
               if(int(get_player().cocks.length) > 2)
               {
                  outputText("它们");
               }
               else
               {
                  outputText("它");
               }
               outputText("力道丝毫不亚于你操弄她嘴巴的力度，而");
               if(int(get_player().cocks.length) > 2)
               {
                  outputText("它们抽动着");
               }
               else
               {
                  outputText("它抽动着");
               }
               outputText("同样急切地喷出精液，随着你的");
               if(int(get_player().cocks.length) == 2)
               {
                  outputText("双重");
               }
               else if(int(get_player().cocks.length) == 3)
               {
                  outputText("三重");
               }
               else
               {
                  outputText("超凡");
               }
               outputText("高潮攫住你时，狂乱也随之将你吞没；");
               if(int(get_player().cocks.length) > 2)
               {
                  outputText("它们弄脏了");
               }
               else
               {
                  outputText("它涂满了");
               }
               outputText("她的裙子，沾满");
               if(int(get_player().cocks.length) > 2)
               {
                  outputText("它们的");
               }
               else
               {
                  outputText("它的");
               }
               outputText("丰沛精液。");
            }
            if(get_player().cumQ() >= 1500)
            {
               outputText("等你差不多射完时，你像往常一样抽出来，把最后几道乳白的精液喷在她脸上和衣服上。犬女还沉浸在自己强烈的高潮里，满脸通红，却仍尽力用嘴去接住它们。");
            }
            outputText("[pg]当你最后一次绷紧身体后，你幸福地叹息一声，在口交后的余韵里轻飘飘地失去了形状。你闭上眼睛，惠特尼无需吩咐便" + (int(get_player().cocks.length) == 1 ? "用扁平的舌头清理你的 [cock biggest]，舔净你还在渗液的龟头，惬意地安抚着你酸胀的肉棒" : "用扁平的舌头清理你所有的阴茎，逐一舔净你每个还在渗液的龟头，惬意地安抚着你酸胀的肉棒") + "。她一边清理你，一边发出瘾君子般低沉而沉醉的呻吟，甚至还轻轻套弄你射过的 [prickplural]，想把最后一点也挤出来。天啊……光是这些声音和触感，还有她轻舔你 [cock biggest] 顶端时的温柔触感，以及她终于哄出最后一滴落到自己饥渴舌尖上时那一声短促喘息，都让你想要再来一次……要不是她刚刚已经把你彻底榨干了。你在她让你的肉棒更加酸胀之前把她拉起来，将她结实娇小的身体按进你的 [chest]，得意而满足地注视着你这位勇者级的口交好手。");
            outputText("[pg][say: 我想我明白了，]她低声说道，晕乎乎地朝你咧嘴一笑，棕色眼眸深处泛着跳动的红晕。你揉了揉她的耳后，告诉她她几乎掌握了；不过还有最后一课要学。你又紧紧抱住她滚烫的身体片刻，然后才让她摇摇晃晃地离开。");
         }
         else if(get_player().hasVagina())
         {
            outputText("[pg]等你坐定后，犬女立刻把手埋进自己的内裤里，沉重的呼吸卡在喉咙间，目不转睛地盯着你的 [cock biggest]。她急切地套弄了没几秒，就猛地向前一颤，舌头伸出，迫不及待地想要开始。这一次，她表现出了惊人的主动性，先深深埋进你的胯间，把嘴唇和探寻的舌头贴上你的 [vagina]。");
            outputText("[pg]她舔舐你的小穴时，你叹息出声。她先温柔地绕着你的外唇打转，然后探入其中，抚过你敏感的内壁，最后找到你的 [clit]。她满足地哼着声，将薄而湿润的舌面铺在上面，轻推又轻点，直到它渴求地鼓胀起来，你的甬道也因兴奋而滴淌不止。考虑到她在这方面还是新手，她——当她又让一道美妙的战栗掠过你全身时，你喘息了一声——她真的很厉害。等她把你弄得足够湿润后，她用温暖的手替代了自己娴熟的舌头，一边向上移动，一边轻轻用手指爱抚你的阴蒂。");
            if(get_player().balls > 0)
            {
               outputText("[pg]那条扁平温热、像绒布一样的舌头铺展在你的 [balls] 上，覆过每一寸肌肤，你幸福地叹息着。每颗敏感的睾丸都被你的奴隶含入口中温柔吮吸，直到它们在积蓄的热意中悸动胀起；而她一边仔细舔净它们，一边从你腿间传来柔软而情欲满溢的呻吟，更让这份怜爱般的侍奉变得格外美妙。");
            }
            outputText("她抬起头，直到脑袋与半勃起的阴茎齐平，然后用漫长、细致而精妙的舔舐让它彻底硬挺起来。她沿着整根肉棒舔过，再绕着你的龟头打转，按压那些她知道会让你因欲望而胀紧的敏感点。你闭上眼睛，任由来自男性与女性性器的快感交汇在一起，像一场缓慢却耀眼的化学反应，从内里将你吞没。");
            outputText("[pg]当她终于用嘴包住你挺出的顶端时，你忍不住愉悦地呻吟出声。她做得极其缓慢，让薄唇一点点沿着你的肉棒滑下，同时凹陷双颊，用错落有致的吸力，将越来越多的[cock biggest]包裹进吮吸与湿热之中。她的脑袋上下起伏，立刻找到了性感的节奏：当嘴退回你圆鼓鼓的顶端时，她的舌头便向下滑去；当她把你的肉棒深深吞入口中时，舌头又向上回卷。她用这种交替的动作，将一阵阵纯粹的狂喜送进你的胯间。");
            outputText("[pg]你闭上眼睛，乐得靠坐在那里，让快感不可阻挡地逐渐堆积。也正是在这里，你终于遇到了一个问题。包裹着你肉棒的湿润吸吮忽然停了几秒，伴随着一声深沉的呻吟，随后又重新开始，却在十秒后再次停下。你困惑地低头看去，看着你的母狗前后动了几次后，终于发现了问题所在：你试图让她在心里把快感和服侍你联系起来，而现在，这份努力显然奏效过头了。");
            outputText("[pg]惠特尼一只手在自己湿透的小穴上不断抽插，已经因为吸吮你的肉棒而兴奋到了极点，以至于每隔一会儿就不得不完全停下，免得违背你的命令直接高潮。她闭着眼，全心全意地专注于取悦你；当她再次停住，让那根撑开她双唇的鼓胀肉柱停在嘴里时，她因纯粹的挫败而低哼起来，下身的热意怎么也降不下去。她训练的最后一环，在你脑海深处那片沉陷的赤红区域里浮现出来，于是你慢慢咧嘴笑了。");
            outputText("[pg][say: 停下，]你低声说。伴随着一声不情愿的啵响，惠特尼松开了嘴。她那双大大的棕色眼睛越过 [eachCock]，过了好一会儿才聚焦到你身上，已经被肉棒弄得晕乎乎的。");
            outputText("[pg][say: 对不起，]她低声咕哝，看上去竟然真的很羞愧。[say: 我不能——现在实在太爽了。我告诉过你，[master]，我说过我根本不会——]你温和地让她安静下来。");
            if(int(get_player().cocks.length) >= 2)
            {
               outputText("[pg][say: 把另一只手放到这里。]她慢慢把手指从内裤里抽出来，握住你的 [cock biggest2]。另一根属于你这团淫乱肉棒丛的部位，被她滚热潮湿的手包住，你不由叹了口气。[say: 同时弄它们……对，就是这样……]她很快就超出了你的期待，迅速找到稳定的节奏，一边套弄你的第二根阴茎，一边用探寻的手指配合着卷入你的 [vagina]，再次让男性与女性的性兴奋交织成压倒性的感觉，在你体内不断堆积。重新把注意力集中到 [eachCock] 和小穴上后，她很快忘了自己的疑虑，轻而易举地滑回了顺从的迷醉状态。");
            }
            else
            {
               outputText("[pg][say: 把手放这儿。]她慢慢把手指从内裤里抽出来，握住你 [cock biggest] 的根部。那股湿热的压力环在你被唾液润得发亮的肉棒最底端，让你轻轻叹了口气。[say: 就在那儿弄……对，就是这样……]她很快就找到了稳定的节奏，一边揉弄你被冷落的肉棒根部，一边用探索的手指同步探入你的 [vagina]，让男女两种性器同时兴奋的压倒性快感再次在你体内积聚起来。");
            }
            outputText("[pg][say: 现在回去做你的主要任务。]你的 [cock biggest] 再次被她口腔里的软肉包裹住，舌头沿着你的肉棒上下滑动，依旧是那种熟练而交替的律动；与此同时，你的 [vagina] " + (int(get_player().cocks.length) >= 2 ? "和 [cock biggest2] 在她挑逗的双手下悸动颤抖" : "在她挑逗的双手下悸动颤抖") + "，快感让你发出深深的满意低哼。尽管她娴熟的动作轻易就能让你彻底沉溺其中，你暂时还是维持住了清醒，紧盯着跪在你面前的犬女——她此刻已经全心全意地投入到取悦你这件事里。");
            outputText("[pg]你甚至不用看她，就知道自己的计划正完美奏效。你身下充满了含混的闷哼、吞咽声和呻吟声；惠特尼的脑子已经把性释放与贬低自己、取悦你深深地联系在了一起，以至于她光是跪在地上，嘴里和手里塞满你的肉棒、埋进你的小穴，就已经湿得发颤，根本不需要任何额外帮助。");
            outputText("[pg]她的模样和声音以同样令人溺毙的强度淹没你的感官，正如快感包裹住你广阔的性器一样。你向上挺动，攀上无法抗拒的高峰，抓住她的头，开始深深插入她紧紧吸吮的" + (get_player().biggestCockLength() < 8 ? "嘴" : "喉咙") + "里。你开始这样使用她时，她发出低沉的呻吟；即使你在操她的脸，她也依旧做得恰到好处——当你往外抽出时，她收紧双颊，贪婪地吮吸你逐渐退去的肉棒；而当你要重新贯入时，她又完全放松口腔，让你能尽可能深入那美妙而紧致的温热");
            if(get_player().biggestCockLength() < 8)
            {
               outputText("她口腔深处");
            }
            else
            {
               outputText("她的喉管");
            }
            outputText("，任你坚定地向里贯入。");
            outputText("[pg]当你冲上那金色而狂喜的顶点时，你已经说不出话来；你仰起头，把尽可能多的肉棒埋进她体内，额头渗出汗珠，每一大股精液喷进她喉咙时，你都发出无言的吼声。你身下传来一连串尖细而窒息的呜咽，她的身体在你周围颤抖；不用看你也知道惠特尼也高潮了——仅仅因为能把主人插进她体内的浓稠种子一滴不剩地吞下，她就沉溺在垂涎的喜悦中泄了出来。");
            outputText("[pg]她的手指在你的[vagina]周围滑动，你的小穴也随之颤抖、收缩，一同达到高潮，");
            if(get_player().wetness() > 2)
            {
               outputText("把她的手臂都浸湿，任你的淫液汩汩流下，");
            }
            outputText("把你感受到的狂喜推升到令人神魂颠倒的高度。");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("她也没有片刻忘记那根被她握在手里的肉棒；她榨弄它的力道就像你操她的嘴一样猛烈，而它也像第一根一样急切地喷出精液。三重高潮同时攫住你，让你陷入迷乱，那根肉棒慷慨地释放着，把她的裙子涂得一片狼藉。");
            }
            if(get_player().cumQ() >= 1500)
            {
               outputText("等你差不多射完时，你照例抽了出来，把最后几道乳白的精液喷在她的脸和衣服上。狗女因自己巨大的高潮而满脸潮红，却还是尽力用嘴去接住它们。");
            }
            outputText("[pg]当你最后一次绷紧之后，你带着圣洁般的满足叹了口气，漂浮在口交后的恍惚余韵里，整个人轻飘飘的，仿佛没了形体。你闭上眼睛，而无需你开口吩咐，");
            if(int(get_player().cocks.length) == 1)
            {
               outputText("惠特尼先用扁平的舌头清理你的[vagina]，再清理你的[cock biggest]，把你还在滴液的小穴和大腿舔得发亮，然后又舔净你仍在渗出的龟头，甜美地抚慰着你酸胀的肉棒。");
            }
            else
            {
               outputText("惠特尼用扁平的舌头先清理你的[vagina]，把你还在滴液的小穴和大腿舔得发亮，然后再清理你的每一根肉棒，把仍在渗出的龟头一一舔净，甜美地抚慰着你酸胀的肉棒。");
            }
            outputText("她一边替你清理，一边发出瘾君子般低沉而陶醉的呻吟，甚至还轻轻套弄你射空的[prickplural]，好让最后一点也滴出来。诸神啊……光是这些声音和触感、她轻柔舔舐你[cock biggest]顶端的感觉，还有她好不容易诱出最后一滴落到饥渴舌尖上时那小小的喘息，就让你想再来一次……要不是她已经如此娴熟地把你彻底榨干的话。你在她让你的肉棒更加酸胀之前把她拉起来，将她结实娇小的身体按进你的[chest]，骄傲又满足地注视着你这位口交勇者。");
            outputText("[pg][say: 我想我明白了，]她低声说道，晕乎乎地朝你咧嘴一笑，棕色眼眸深处泛着跳动的红晕。你揉了揉她的耳后，告诉她她几乎掌握了；不过还有最后一课要学。你又紧紧抱住她滚烫的身体片刻，然后才让她摇摇晃晃地离开。");
         }
         get_player().orgasm("Dick");
         dynStats(DynStat.Sens(-1));
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function firstCockOralTraining() : void
      {
         clearOutput();
         whitneySprite();
         outputText("犬女缓缓照你说的做，弯下身子，张开嘴，用扁平的舌头舔舐你[cock biggest]的顶端。她一只手还伸在内裤里，动作笨拙地用另一只手握住你的根部，低哼一声稳住自己，然后让舌头沿着你敏感的下侧一路滑下；那美妙的感觉让你叹了口气，而你也清楚地告诉她怎样做才能取悦你。她用湿热的舌头舔过每一寸能够触及的地方，很快就让你彻底勃起，急切地跳动着。然而她并没有用嘴把你的顶端含进去，而是继续用舌头舔着你，越来越快。你低头皱起眉。这感觉不错，但远远不够满足，而且她已经沉浸在动作里，闭着眼睛，像条狗一样舔着你的胯间，仿佛在舔她的……");
         outputText("[pg][say: 停下，]你坚定地说道。她抬头看向你，神情有些恍惚。[say: 我不是你的屁股，也不需要你清理。慢慢来……]你等到她重新舔上你的顶端，才轻轻向前推去。[say: 现在，把我吞进去。对，就是这样！]你的[cock biggest]前端被柔软温热包裹住，你不禁叹了口气。她尖利的牙齿不舒服地刮过你胀起的皮肤，但在你低声指点几句后，那种感觉便消失了；你开始慢慢推进她吮吸着的湿热之中，每一次都更深地送入她口中。");
         outputText("[pg]她没有使用她那令人愉悦的舌头，有时也会停止自慰，沉浸在吞吐你越来越多的肉棒中" + (get_player().hasVagina() ? "；此外，你的[vagina]因为没有得到口交的快感而沮丧地渗出水珠。但这没关系。一切都会慢慢来的" : "，但这没关系；一切都会慢慢来的") + "。现在，只有她柔软的嘴唇和淹没你肉棒的美妙快感，她温暖的手紧紧握着你，随着你的冲动越来越强烈，当你触摸她的喉咙前部时，她开始含着你的肉棒呻吟，声音越来越大，当她——");
         outputText("[pg][say: 停下！]你再次厉声喊道。惊讶的棕色眼睛抬头望向你，含着你肉棒的嘴也僵住了。[say: 奴隶不能比主人先爽，]你用不容置疑的语气说道。[say: 只有当你表现得足够好，让我射出来时，你才有同样的权利。现在……继续吸，继续用手弄。试着同时做。慢一点，好好来。]你让她重新找回节奏，让她取悦你[cock biggest]的前端，而你则感受着自己更多的长度一点点沉入她口中。令人满意的是，在你明确的指示下，她确实做到了同时动嘴，也同时让那只埋在小穴里的手动作起来；偶尔传来的含糊呻吟，也让你的肉棒愉悦地震颤。");
         if(get_player().biggestCockLength() > 12)
         {
            outputText("[pg]想把尽可能多的肉棒收进你这荡妇体内的欲望，终究变得太过强烈；你开始温柔却坚持地往她喉咙里推进。你知道接下来会怎样，所以当她咳嗽、呛住时，你耐心地退出来——等她缓过来后，又重新压进去。几次之后，她总算控制住了自己的呕吐反射；当你的[cockHead biggest]沉入她喉咙那美妙的紧窄之中时，你满足地叹了口气。");
         }
         outputText("[pg]随着血液开始在体内沸腾，你放开了欲望的缰绳，抓住她的头，急切地向她口中挺动。那吮吸着、榨取着你的温热不断把你推向高潮。她显然很难适应你节奏的变化——你身下不时传来几声“呃！”和“唔！”——但你已经顾不上了，反正她迟早得习惯。你挺直背脊，带着近乎陶醉的神情闭上双眼，冲向顶点；你的[cock biggest]在惠特尼嘴里深处绷紧，随后释放出来，一股接一股的精液射进她喉咙。");
         outputText("[pg][say: 你现在可以高潮了，贱狗，]在一阵令人满足的余韵低谷中，你声音沙哑地吐息道。");
         if(get_player().cumQ() >= 1500)
         {
            outputText("[pg]犬女被你浓稠得惊人的大量精液呛得咳嗽连连、含糊作响；更多精液还在泵进她胃里，同时又从她鼻子里喷出，沿着下巴淌下。但这并没有阻止她在内裤里疯狂地动着手，拼命拨弄自己的阴蒂，同时还努力应付你这巨大的精量。她本就已经到了边缘，所以没过多久，她的眼睛便翻了上去，身体绷紧又颤抖，嘴里仍塞满你的肉棒。眼前这一幕足够赏心悦目，于是你抽出肉棒，把最后几股精液射在她脸上和衣服上。她几乎都没察觉，只是喘息着，仍然沉醉地继续抚弄自己。");
         }
         else
         {
            outputText("[pg]犬女被你浓稠的精液呛得咳嗽连连、含糊作响；即便你还在继续往她体内泵入更多，仍有一些精液从她鼻子里淌了出来。但这并没有阻止她在内裤里疯狂地动着手，拼命拨弄自己的阴蒂，同时还努力应付你这巨大的精量。她本就已经到了边缘，所以没过多久，她的眼睛便翻了上去，身体绷紧又颤抖，嘴里仍塞满你的肉棒。");
         }
         outputText("[pg]最后，你们两人都渐渐平复下来。你享受着释放后的空虚与余韵，低头看向你的奴隶；她的目光涣散，仿佛整个人都飘到了别处。显然，她在吸屌这件事上完全是个新手，但一想到接下来要把她调教成专家，这份挑战便让你兴致盎然。像是听见了你的想法，惠特尼眨了眨眼，抬头望向你，身上还滴着精液，露出一个不太稳的笑容。");
         outputText("[pg][say: 呼。对不起，[master]，我刚才做得不是很好，]她说道。[say: 你其他仆人肯定会做得比我好多了。]你告诉她别犯傻——她很有潜力。不过她还需要记住很多事，比如一个荡妇干完活之后，得把自己伺候过的肉棒清理干净。狗女孩“哦！”了一声，连忙又俯身凑向你那愉快地发胀、半硬着的[cock biggest]。等她把你仍在渗出的龟头舔干净，完成这件令人享受的工作后，你便让她离开了。");
         get_player().orgasm("Dick");
         dynStats(DynStat.Sens(-1));
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function farmValue() : int
      {
         var _loc1_:int = 0;
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1079) == 1)
         {
            _loc1_ += 3;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1080) == 1)
         {
            _loc1_ += 2;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1081) == 1)
         {
            if(get_game().sophieBimbo.bimboSophie())
            {
               _loc1_ += 4;
            }
            else
            {
               _loc1_ += 3;
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1082) == 1)
         {
            _loc1_++;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1083) == 1)
         {
            _loc1_ += 3;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1084) == 1)
         {
            _loc1_++;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1085) == 1)
         {
            _loc1_ += 2;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1088) == 1)
         {
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,725) >= 4)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1091) == 1)
         {
            _loc1_ += 2;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1089) == 1)
         {
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,870) > 0)
            {
               _loc1_ += 3;
            }
            else
            {
               _loc1_ += 7;
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1095) == 1)
         {
            _loc1_ *= 1.25;
         }
         return _loc1_;
      }
      
      public function farmProtection() : int
      {
         var _loc1_:int = 0;
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1079) == 1)
         {
            _loc1_++;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1080) == 1)
         {
            _loc1_ += 2;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1081) == 1)
         {
            if(get_game().sophieBimbo.bimboSophie())
            {
               _loc1_++;
            }
            else
            {
               _loc1_ += 2;
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1082) == 1)
         {
            _loc1_ += 4;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1083) == 1)
         {
            _loc1_ += 3;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1084) == 1)
         {
            _loc1_ += 2;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1088) == 1)
         {
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,725) >= 4)
            {
               _loc1_++;
            }
            else
            {
               _loc1_ += 2;
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1091) == 1)
         {
            _loc1_ += 2;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1089) == 1)
         {
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,870) > 0)
            {
               _loc1_++;
            }
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1086) > 0)
         {
            _loc1_ += 7;
         }
         return _loc1_;
      }
      
      public function farmMenu() : void
      {
         var _g:FarmCorruption;
         menu();
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1120) != 1)
         {
            if(!whitneyCorrupt())
            {
               addButton(0,"惠特尼",dogeNotCorruptYet);
            }
            else
            {
               _g = this;
               addButton(0,"惠特尼",function():void
               {
                  _g.dogeCorruptedMissionComplete();
               });
            }
         }
         if(!get_player().hasStatusEffect(StatusEffects.MarbleRapeAttempted) && !get_player().hasStatusEffect(StatusEffects.NoMoreMarble) && get_player().hasStatusEffect(StatusEffects.Marble) && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,463) == 0)
         {
            addButton(1,"玛布尔",get_farm().meetMarble);
         }
         if(get_player().hasStatusEffect(StatusEffects.Kelt) && !get_player().hasStatusEffect(StatusEffects.KeltOff))
         {
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,725) >= 4)
            {
               addButton(2,"凯莉",get_farm().kelly.breakingKeltOptions);
            }
            else if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,725) == 0 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1110) == 0)
            {
               addButton(2,"凯尔特",keltAChangeInManagement);
            }
            else
            {
               addButton(2,"凯尔特",get_farm().kelly.breakingKeltOptions);
            }
         }
         if(get_player().hasKeyItem("Breast Milker - Installed At Whitney\'s Farm"))
         {
            if(get_player().hasStatusEffect(StatusEffects.Milked))
            {
               outputText("[pg]<b>你的[nipples]现在太疼了，没法挤奶。你得等一阵子。</b>");
            }
            addButton(3,"被挤奶",get_farm().getMilked);
         }
         if(get_player().hasKeyItem("Cock Milker - Installed At Whitney\'s Farm") && get_player().cockTotal() > 0)
         {
            addButton(4,"榨精",get_farm().cockPumping);
         }
         addButton(5,"农场",corruptingTheFarmExplore);
         if(slavesAtFarm())
         {
            addButton(6,"奴隶",slavesAtFarmMenu);
         }
         if(loversAtFarm())
         {
            addButton(7,"情人",loversAtFarmMenu);
         }
         if(followersAtFarm())
         {
            addButton(8,"追随者",followersAtFarmMenu);
         }
         setExitButton();
      }
      
      public function dontTestBranding() : void
      {
         clearOutput();
         whitneySprite();
         outputText("也许以后再说吧，你这么说道。惠特尼看起来很失望。");
         outputText("[pg][say: 好吧。我会把它放到谷仓里，要是哪天你突然想，呃，给几头牲口打上标记，它就在那儿。不过先提醒你，[master]，那墨水可不便宜——每打一个标记都要50颗宝石。]");
         outputText("[pg]你告诉她她做得很好，然后转身离开。");
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function dontGetBrandingStuff() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你抚弄着她那小小鼓起的肉粒，直到判断她已经快到顶点时，才把手彻底抽开。也许下次吧，你漫不经心地说道。");
         outputText("[pg][say: 哦，[master]，]惠特尼呻吟道，语气里满是恼火，双手夹在大腿之间。");
         if(whitneyDom())
         {
            outputText("[say: 你之后会为这个付出代价的，我发誓！]");
         }
         outputText("你咧嘴一笑，转身离开。");
         dogeCorruptedMissionComplete();
      }
      
      public function dontDeFurDoge() : void
      {
         clearOutput();
         whitneySprite();
         outputText("[say: 我告诉过你，有件事你必须去做，用来证明你已经完全理解了自己的新现实，]你说道，目光直直逼视着她。惠特尼的嘴唇开始要说些什么，但你粗暴地打断了她。[say: 我想你知道那是什么。]她眨了几下眼，脸上渐渐浮现出明悟，随后一言不发地转身朝自己的屋子走去。趁她离开时，你大步走向柴堆，去取你自己接下来需要的东西。");
         outputText("[pg]惠特尼看到那把架在你肩上的手斧时停下了脚步；她把自己手里拿着的东西攥得更紧了。");
         outputText("[pg][say: 把它给我，]你轻声说道。惠特尼又僵了好一会儿，眼睛死死盯着那把斧头，你一瞬间还以为自己又得去拿那颗宝石了。然而，她长长地、颤抖着叹了口气，最终还是主动把东西递给了你。你接过她的弩时，手与她的手碰在一起；她浑身滚烫。");
         outputText("[pg]你花了点时间端详这件武器。它其实相当不错。看起来平衡性很好，木料打磨得光亮，弦也保养得油润，弩矢锋利，一看就品质不凡——你注意到它的握柄上刻着“特尔阿德雷守卫”。你小心地把它放到地上，然后走向惠特尼。你站到她身后，握住她的手腕，身体坚定地贴上去时，她绷紧了身体，却没有反抗。你们就这样维持了很久，你的呼吸拂在她耳边，享受着她贴在你[chest]和手臂上的体温与怦怦脉搏，还有你的胯部抵着她紧实屁股的触感，等着她放松下来。等她终于放松时，你把小斧塞进她手里。她握住斧柄，你只遇到一点点抗拒，就用自己的手推着她的手腕向上举起。等斧头悬在她头顶上方时，你便不再用力，只是仍旧握着她的手腕。");
         outputText("[pg][say: 现在……这座农场属于谁？]你在她耳边低声说道。惠特尼僵在你一点点推出来的姿势里，仿佛过了一个世纪，而你们两人就像一幅预示着暴力即将降临的画面。终于，她发出一声尖锐的喘息，斧头轰然劈下，带着木头碎裂的巨响砸在弩上，力道大得让斧刃嵌进了握柄一半。");
         outputText("[pg][say: 你，]她低声咕哝道。她低头看着，然后用脚把斧刃拔了出来。[say: 它属于你。]你再次握住她的手腕，把斧头举过她的头顶。");
         outputText("[pg][say: 那我是谁？]你低声问道。短暂的一秒停顿后，斧头呼啸着劈落。这一次的打击更加精准，弩的大半个握柄都飞进了高高的草丛里。");
         outputText("[pg][say: [Master]，]她这次说得更响了些。[say: 你是这座农场的[master]，而且、而且你也是我的[master]！]你紧紧抱住她，用你的");
         if(get_player().hasCock())
         {
            outputText("胯部顶磨着");
         }
         else
         {
            outputText("臀胯贴着");
         }
         outputText("她结实的屁股，她发出一声呻吟，呼吸开始变得急促而浅短，心脏在你的皮肤旁狂跳不止。虽然你仍握着她，但已经不需要你做什么，斧头便再次举了起来。");
         outputText("[pg][say: 很好，]你说道，继续把自己灼热而平稳的呼吸压进她耷拉着的耳朵里。[say: 那么，如果我是[master]，你又是什么？]斧头像一道灰色的影子掠过空中，接着弩弦断裂，弩矢被砸碎，弩托也被砸凹了。");
         outputText("[pg][say: 我是……我是你的奴隶！]她喊了出来。[say: 我什么都没有，如果能属于你，我、我也不想拥有任何东西！]她突然挣脱你的掌控，满怀恨意地扑向那件武器的残骸，嚎叫着、低吼着一次又一次举起斧头。在她毁掉自己旧日生活、毁掉对抗你的最后防线的疯狂净化中，碎木四处飞溅。你站在一旁看着这一幕，脸上露出灿烂的笑容。有时候你真是太能干了。");
         outputText("[pg]当惠特尼转身看向你时，她因用力而喘息不止，脸颊涨红，头发和衣服都凌乱不堪；她的眼中多了某种新的东西。那双曾经平静如水的榛色眼睛，如今被点燃了，交织着深沉而赤红的欲望。你让这只犬女在堕落的氛围中浸泡了太久，以至于到了现在，似乎只要拨动正确的开关就够了。");
         outputText("[pg][say: 这让[master]满意了吗？]她咧嘴笑着说道。");
         outputText("[pg][say: 非常满意，]你一边继续打量她，一边回答。你意识到，在她的转变过程中，你让支配与顺从的倾向都浮出了她的心理表层；虽然现在你毫无疑问已经是她和她农场的总主人，但在她如今脆弱的状态下，只需要几句话、几个动作，就能让她在性方面对你表现出其中任意一种倾向。");
         menu();
         addButton(0,"塑造成受方",makeDogeSubby);
         addButton(1,"塑造成攻方",makeDogeDommy);
      }
      
      public function dogeNotCorruptYetMenu() : void
      {
         menu();
         addButton(0,"外貌",whitneyAppearanceNotCorrupt);
         addButton(1,"繁荣",prosperityGoNotCorrupt);
         if(availableInvestments())
         {
            addButton(2,"投资",investmentMenu);
         }
         addButton(14,"返回",rootScene);
         if(whitneyCorruption() <= 60 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1115) == 0)
         {
            addButton(14,"返回",dogeNotCorruptLeaveFirstTime);
         }
         else if(whitneyCorruption() <= 90 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1118) == 0)
         {
            addButton(14,"返回",dogeNotCorruptLeave6190);
         }
      }
      
      public function dogeNotCorruptYet() : void
      {
         clearOutput();
         whitneySprite();
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1114,1);
         if(whitneyCorruption() < 30 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1112) > 30 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1113) == 0)
         {
            outputText("惠特尼正扛着一袋谷物往储粮仓走去，你向她打招呼。她完全无视了你；从你身边轻快走过时，她脸上带着冷冷的胜利神情，双颊也涨得通红。你注意到她又找回了自己的弩，还把它背在了背上。看着她时，你的眼睛会微微发疼，仿佛她正站在太阳前方。你皱着眉盯着她离去的背影。你得想办法处理这事。");
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1113,1);
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1115) == 0)
            {
               doNext(dogeNotCorruptLeaveFirstTime);
            }
            else
            {
               doNext(get_camp().returnToCampUseOneHour);
            }
            return;
         }
         if(whitneyCorruption() <= 30)
         {
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1114,1);
            outputText("你在牛栏里找到了惠特尼，她正坐在那里用手给自己的一头奶牛挤奶；她的弩靠在一只桶边。你一走近，她便猛地抬头，然后缓缓伸手去拿武器。你立刻停下脚步，她也随之停住，手僵在握把上。你向前迈了一步，她便把弩拿了起来，手指搭上扳机，脸上完全没有表情。你急忙后退了几步，她这才放下弩，又平静地继续挤奶。");
            outputText("[pg]你恼火地挥了挥手，然后离开了；既然她想这样，那就随她吧。如果她还要和你以及你的追随者们一起干上一段时间，她迟早得放松下来。");
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1115) == 0)
            {
               doNext(dogeNotCorruptLeaveFirstTime);
            }
            else
            {
               doNext(get_camp().returnToCampUseOneHour);
            }
            return;
         }
         if(whitneyCorruption() >= 31 && whitneyCorruption() <= 60)
         {
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1116) == 0)
            {
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1116,1);
               outputText("你再次走向惠特尼，这一次她正提着装满牛奶的桶，往装瓶站走去。她看见你过来，便加快了脚步。不过你这次注意到她没带弩，这让你胆子大了些。");
               outputText("[pg][say: 你不可能一辈子都无视我！]你喊道。[say: 至少让我跟你谈谈农场的事吧！我也在这地方投入了心血，还不断往这里派人帮忙，可农场主却连她到底需要什么都不肯告诉我！]惠特尼渐渐停下脚步。过了好一会儿，她叹了口气，放下桶，转过身来。");
               outputText("[pg][say: 好吧，]她嘟囔道。你注意到她的眼睛发红，眼角也有些生疼似的。[say: 我也受够这种把戏了。我没法假装你和你的仆人们不存在，所以我想我也只能面对现实了，不管这现实有多该死地难受，然后跟你谈谈这里头的来龙去脉。]她不由自主地颤了一下，随后才不情愿地抬眼看向你。[say: 你想谈什么？]");
            }
            else
            {
               outputText("你大步走向惠特尼时，她放下手头的活，脸上带着认命般的不快。");
               outputText("[pg][say: 什么事？]");
            }
            dogeNotCorruptYetMenu();
            return;
         }
         if(whitneyCorruption() >= 61 && whitneyCorruption() <= 90)
         {
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1117) == 0)
            {
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1117,1);
               outputText("你在她那间小屋的门廊台阶上找到了惠特尼，小屋和储粮仓连在一起。她身旁放着一本书，但她只是坐在那里沐浴着阳光，闭着眼睛。等她睁开眼，看见你站在那儿时，她对你露出一个淡淡的微笑；这是你很久以来第一次见她这么做。她的目光和那张瘦长脸庞的线条中，有种难以言明的东西：也许是惴惴不安，又零星裹着几分羞怯。");
               outputText("[pg][say: 你好，[name]，]她轻声说道。[say: 有什么心事吗？]");
            }
            else
            {
               outputText("你走近惠特尼时，她放下手头的活，对你露出一个有些茫然的微笑。你再次从她那僵硬而拘束的动作和表情中，感到那种令人不适的混合情绪：焦虑、不快，还有兴奋。");
               outputText("[pg][say: 你好，[name]。你想要什么吗？]");
            }
            dogeNotCorruptYetMenu();
            return;
         }
         if(whitneyCorruption() >= 91 && whitneyCorruption() <= 119)
         {
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1119) == 0)
            {
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1119,1);
               outputText("这些日子，农场周围弥漫着一种闷热而撩人的气氛。空气比应有的更暖，拂过田野的微风带着一股麝香般诱人的气味，难以抗拒地钻进你的鼻腔，压到你的喉咙深处。当你在门廊上找到惠特尼时，你忍不住觉得她看起来比近来放松了许多；也许在这样的环境下，实在很难一直绷紧神经。");
               outputText("[pg][say: 是啊，[name]，]她说道，声音轻得你几乎听不见。[say: 我能为你做什么？]你谨慎地问她，对你给农场带来的变化有什么看法。");
               outputText("[pg][say: 你是对的，]她又用那种低得不可思议的声音说道，随后清了清嗓子，用更响亮的语气继续说下去，话语一股脑地涌了出来。[say: 你刚来这里，要求分走农场一份的时候，我恨透了你，比我这些年来恨过的任何东西都更恨。有人要接管我家的农场，接管我这么多年辛辛苦苦打理的一切，而在我看来，那几乎纯粹是出于恶意……我幻想过杀了你，你知道吗？趁你忙着别的事时，一箭射穿你的脖子。我想，唯一阻止我的就是恐惧：害怕你强大到不知怎的还能活下来。那时候的我可真是痛苦……但后来有那么一刻，我就想，去他妈的，你懂吧？如果我连鼓起勇气反抗你都做不到，那我整天痛苦愤怒下去又有什么意义？而我越是放下那些……]");
               outputText("[pg]她说话的时候，你把手伸进口袋，这一次刻意放慢动作，取出了一颗宝石。惠特尼的目光立刻被它吸引，她也停顿下来；你一边用手指慢慢转动那颗小小的、闪烁着万花筒般光彩的宝石，一边轻轻示意她继续。[say: ……如今这里就是变得有趣多了。农场感觉像是活了过来，我赚的钱也多多了，而且……我越是放开心思，越是放下那些旧日的仇恨，我就越能思考，越能感受。诸神啊，我正在感受到许多已经多年没有过的东西。我看着你指使你的追随者们，那感觉很有力量；我让他们按我的意愿行事，那感觉也很对，就好像我正在掌控并塑造这个世界，而不是只是躺在那里，看着它从我身边流过。感觉就像……像是……]");
               outputText("[pg][say: 就像你正在醒来一样，]你说。你把宝石来回转动，细小而刺眼的光束四散开来，照进这个犬类兽化人的眼中。她嘴巴微张，呼吸浅促。[say: 就像自从我掌控这里之后，你才醒来，看见了生活所能给予的一切，看见了</i>我<i>所能给予的一切，看见了当你臣服于我的意志时，眼前会展开怎样的天地。比起你困在过去那种琐碎而狭隘的生活里时，这座农场如今已经好了不知多少倍。你刚才亲口告诉了我这些。而且就像这座农场一样，你越是向我敞开自己，</i>你<i>也就变得越来越真实。]");
               outputText("[pg]你觉得这只小狗现在已经很接近了，非常接近完全敞开心灵、彻底品尝现实的滋味。她只需要再做一件事，来证明自己的决心……");
               outputText("[pg][say: 那是什么，]惠特尼木然地问。你微微一笑，轻轻让旋转的宝石停下，然后把它收回你的[inv]里。你说，等你真正准备好的时候，你自然会知道那是什么。说完，你转身离开，把她留在门廊上，身子有些恍惚地摇晃着，目光飘向很远、很远的地方。只要你能让她继续沉浸在你为这座农场营造出的氛围里，你想，她很快就会准备好迎来你计划的最后阶段。");
               doNext(rootScene);
               return;
            }
            outputText("惠特尼一看见你走近，就急切地放下了手头的活。");
            outputText("[pg][say: 你想要什么，[name]？]她笑着说。她眼中有一种几乎压抑不住的兴奋；你觉得她大概还没意识到，自己的短尾巴正摇得飞快。");
            dogeNotCorruptYetMenu();
            return;
         }
         if(whitneyCorruption() == 120)
         {
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1095) == 0)
            {
               FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1095,1);
               outputText("这次你不需要特地去找惠特尼；你刚到农场，几乎立刻就有一个" + (get_noFur() ? "金发" : "沙色毛皮") + "的身影急匆匆地朝你赶来。她脸上满是强烈的兴奋，胸口剧烈起伏，显然不只是因为赶路。");
               outputText("[pg][say: [name]，我能不能……我能不能跟你谈谈？我真的需要跟你谈谈。]你知道她真正想要的是什么。你微微一笑，取出宝石，再次开始缓缓转动它，顺时针，然后逆时针……惠特尼的眼中映满了闪烁的光芒。");
               outputText("[pg][say: 你永远不会离开这里，对吧？]她气息不稳地说。[say: 我、我开始想一些事情，好多美妙的</i>事情<i>，然后我……我担心等你停下来之后，那些东西也会停下。你答应我，你不会不再来这里，好吗？]你冷淡地说，你是否会继续参与这里的事，取决于她是否愿意一五一十地告诉你，她到底在想些什么。惠特尼停顿了片刻，然后继续说了下去。她的嘴唇干得厉害，让你几乎也忍不住想跟着咽口水。");
               outputText("[pg][say: 一开始只是个玩笑——我开始像你那样对你的追随者下命令。你来这里来得够多了，要模仿你的话和语气很容易。那可把他们吓了一跳！可后来我……我开始幻想真的拥有他们，虐待他们，殴打他们，然后还要他们感谢我赐给他们这个荣幸。因为他们活该，不是吗？他们本来就是为这个存在的。你就是这么想的，而神啊……这样想起来实在太对了，仿佛一下子打开了好多可能性。可后来，我又开始用一种新的方式去想……]她无意识地舔了舔嘴唇。[say: 你在附近的时候，还是那种玩笑似的，我会看着你，小声叫你某个称呼，然后</i>那个<i>……每次我这么做之后，我都得走开，得找个安静的地方，然后……]她说不下去了。");
               outputText("[pg]你一边仍然转动着宝石，一边轻声问她叫了你什么。惠特尼发出了一种你很熟悉、却从没听她发出过的声音；那是从喉咙深处挤出来的、细细的高声呜咽。你再次温和却坚定地问她，她用的是什么词。");
               outputText("[pg][say: ……[Master]，]她轻声说。你胜利地笑了。是时候进入你这场高风险商业合并的最后阶段了" + (get_noFur() ? "" : "，不过如今你对这个犬类兽化人的掌控已深，只要你愿意，就能让她为你改变") + "。");
               menu();
               if(get_noFur())
               {
                  addButton(0,"改变她",deFurDoge);
                  addButton(1,"不改变",dontDeFurDoge);
               }
               else
               {
                  addButton(0,"继续",dontDeFurDoge);
               }
            }
         }
      }
      
      public function dogeNotCorruptLeaveFirstTime() : void
      {
         clearOutput();
         whitneySprite();
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1115,1);
         outputText("当你转身准备离开时，感觉有什么东西拽住了你的[armor]。你回过头，对上惠特尼那双探寻般的眼睛。");
         outputText("[pg][say: 你……你是怎么做到的？]她断断续续地问。[say: 你怎么能强迫别人变成你的……你的傀儡，你的牲口？你不会觉得恶心吗？]你不以为意地耸耸肩，说你的后宫里几乎所有人都曾对你的人身自由、你的性器以及该如何利用它们来满足自己的私欲有过打算；只不过你的意志和欲望比他们更强。你通过惨痛的经验发现，这就是这个世界的规则，而那些不这么想的人，不过是更残酷者眼中的猎物。你又盯着她的眼睛看了一会儿，然后转身大步离去。");
         doNext(rootScene);
      }
      
      public function dogeNotCorruptLeave6190() : void
      {
         clearOutput();
         whitneySprite();
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1118,1);
         outputText("[say: 我知道你想干什么，]你谈完正事、转身准备离开时，犬女突然说道。[say: 你以为只要让我和你的奴隶一起干活，用你的影响力和恶魔魔法污染这里，就能把我也变成你的傀儡。邪恶渗透之类的玩意儿。]她苦涩地笑了起来，那笑声里几乎带着一丝歇斯底里。也许你是在自欺欺人，但你觉得其中似乎还夹杂着一种脆弱而扭曲的兴奋。[say: 事情不是那样的。你做这门生意，只是在我身边摆满了你的残酷、腐化和恶意能对普通人造成什么影响的例子。我能抵抗它，而且我一定会。]");
         outputText("[pg]你不以为意地耸耸肩，从钱袋里取出一颗宝石，用同样刻意装出的随意姿态在指尖旋转起来。你说，这和腐化无关；你并没有和恶魔勾结，你有灵魂。你想做的，只是让这座农场变得最好，并让她的心灵向新的可能、新的思考方式敞开。随着你有节奏地转动，宝石在阳光下闪闪发亮。你觉得她一个人待得太久了；已经太固执于自己的老一套，以至于任何改变她世界的东西，她都会视为威胁，哪怕那其实是为了她好。她应该睁开眼睛，敞开心灵，看看你正在给她的田地带来怎样的成功；也许只要她放下成见，接受你凭借更广阔的经验确实懂得更多，她就能明白生活可以有多么富足。你捏住宝石让它停下，然后看向惠特尼。她又盯着那件漂亮的小东西看了一会儿，才摇摇头，把视线抬向你，神情有些恍惚。你转身离开，暗自微笑。");
         doNext(rootScene);
      }
      
      public function dogeCorruptedMissionComplete(param1:Boolean = true) : void
      {
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1135) == 1 && param1)
         {
            brandingAvailableTalk();
            return;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1162) == 2 && param1)
         {
            orgyRoomTalk();
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1162,1);
            return;
         }
         if(param1)
         {
            clearOutput();
            whitneySprite();
         }
         if(whitneyDom() && param1)
         {
            outputText("你还没来得及把惠特尼的名字叫完，她就已经站到了你面前。");
            outputText("[pg][say: 是，[master]？]她声音沙哑地说道，饥渴地盯着你的眼睛。她始终处在一种紧绷的精力之中，像是正费尽力气，才勉强压住想要抓住你的冲动。[say: 是谈正事？还是寻欢？]");
         }
         else if(param1)
         {
            outputText("你还没来得及把惠特尼的名字叫完，她就已经跪在了你面前。她的尾巴摇晃着，那双深情的棕色眼睛仰望着你，里面燃着无底的欲望。");
            outputText("[pg][say: [Master]？]");
         }
         menu();
         addButton(0,"外貌",whitneyAppearanceCorrupt);
         if(availableInvestments())
         {
            addButton(1,"投资",investmentMenu);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1133) == 1 || FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1134) < 1)
         {
            addButton(2,"烙印",brandingMenu);
         }
         if(whitneyDom())
         {
            addButton(3,"享乐",whitneyDomPleasure);
         }
         else
         {
            addButton(3,"享乐",whitneySubPleasure);
         }
         orgyRoomRouter();
         addButton(14,"返回",rootScene);
      }
      
      public function doRefineryInvestment() : void
      {
         clearOutput();
         whitneySprite();
         var _loc1_:Player = get_player();
         _loc1_.set_gems(_loc1_.get_gems() - 1500);
         showStats();
         outputText("你默默递过去一大袋宝石。惠特尼把它收了起来。");
         outputText("[pg][say: 我会试着把……那个……在几天内准备好，到时候你再回来吧。]");
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1126,1);
         doNext(rootScene);
      }
      
      public function doMilktankInvestment() : void
      {
         clearOutput();
         whitneySprite();
         if(!whitneyCorrupt())
         {
            outputText("你把宝石塞进你的监工手里，转身一言不发地离开。你脑中浮现出那对巨大、柔软得令人愉悦的棕色乳房，还有奢华的奶浴；这绝对物有所值。");
         }
         else
         {
            outputText("你把宝石塞进你的监工手里，转身一言不发地离开。你脑中浮现出那对巨大、柔软得令人愉悦的棕色乳房，还有奢华的奶浴；这笔钱绝对花得值。");
         }
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1128,1);
         var _loc1_:Player = get_player();
         _loc1_.set_gems(_loc1_.get_gems() - 400);
         doNext(rootScene);
      }
      
      public function doContraceptiveInvestment() : void
      {
         clearOutput();
         whitneySprite();
         var _loc1_:Player = get_player();
         _loc1_.set_gems(_loc1_.get_gems() - 750);
         showStats();
         if(!whitneyCorrupt())
         {
            outputText("你把钱交了过去。惠特尼把它收了起来。");
            outputText("[pg][say: 这东西长得不慢，但还是得花点时间，]她说道。[say: 我明天就播种，一周后你就可以开始采了。]");
         }
         else
         {
            outputText("你把钱交了过去。惠特尼把它收了起来。");
            outputText("[pg][say: 这东西长得不慢，但还是得花点时间，[master]，]她说道。[say: 我明天就播种，一周后你就可以开始采了。]");
         }
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1127,1);
         doNext(rootScene);
      }
      
      public function doCockMilkerInvestment() : void
      {
         clearOutput();
         whitneySprite();
         var _loc1_:Player = get_player();
         _loc1_.set_gems(_loc1_.get_gems() - 1000);
         showStats();
         if(!whitneyCorrupt())
         {
            outputText("你默默递过去一大袋宝石。惠特尼把它收了起来。");
            outputText("[pg][say: 要是你们明天回来，应该就能弄好了。]");
         }
         else
         {
            outputText("你默默递过去一大袋宝石。惠特尼把它收了起来。");
            outputText("[pg][say: 明天应该就能弄好了，[master]！]");
         }
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1125,1);
         doNext(rootScene);
      }
      
      public function doBreastMilkerInvestment() : void
      {
         clearOutput();
         whitneySprite();
         var _loc1_:Player = get_player();
         _loc1_.set_gems(_loc1_.get_gems() - 1000);
         showStats();
         outputText("你默默递过去一大袋宝石。惠特尼把它收了起来。");
         outputText("[pg][say: 要是你们明天回来，应该就能弄好了。]");
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1124,1);
         doNext(rootScene);
      }
      
      public function deFurDoge() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你把那颗宝石收起来，贴近惠特尼，迎着她的目光，轻轻用食指和拇指贴上她的下颌线。她没有躲开；在你触碰她时，她发出一声颤抖的叹息。");
         outputText("[pg][say: 我很高兴，你终于愿意接受我能为你做的一切，也明白了我们的关系究竟是什么，]你说道。[say: 而且我已经准备好教你各种各样的东西了。不过……]你极轻地捏住她的吻部，惠特尼身体一绷，目光无法从你眼中移开。[say: 这样可不行。在我看来，会走路、会说话的动物是一种异类。你知道异类会有什么下场，对吧，惠特尼？]她没有回答；她已经深深陷在你的影响之下，陷在你的话语之中。[say: 但你是个聪明姑娘。一个一辈子都在和变身药剂打交道的姑娘。所以我明天会再来，而你会变得不一样，变成一种更合适的形态。到时候，我们再好好谈谈你那令人期待的新未来。好吗？]");
         outputText("[pg][say: 是，]惠特尼极轻地说道。你温柔地对她笑了笑，松开了手。");
         outputText("[pg][say: 乖女孩。]你转身离开。");
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1120,1);
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1121,1);
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function corruptingTheFarmExplore() : void
      {
         menu();
         addButton(0,"探索",get_farm().exploreFarm);
         addButton(1,"工作",get_farm().workFarm);
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1092) >= 7 || FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1097) > 0 || FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1099) > 0 || FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1104) > 0 || FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1111) > 0)
         {
            addButton(2,"收取",collectTheGoodies);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,2732) > 0)
         {
            addButton(3,"马厩",get_farm().stablesMenu).hint("去看看惠特尼的马。");
         }
         addButton(14,"返回",farmMenu);
      }
      
      public function corruptFollowers() : int
      {
         var _loc1_:int = 0;
         if(get_game().jojoScene.campCorruptJojo())
         {
            _loc1_++;
         }
         if(get_game().amilyScene.amilyCorrupt())
         {
            _loc1_++;
         }
         if(get_game().izmaScene.izmaFollower())
         {
            _loc1_++;
         }
         if(get_game().sophieBimbo.bimboSophie())
         {
            _loc1_++;
         }
         if(get_game().vapula.vapulaSlave())
         {
            _loc1_++;
         }
         if(get_game().ceraphScene.ceraphIsFollower())
         {
            _loc1_++;
         }
         if(get_game().latexGirl.latexGooFollower())
         {
            _loc1_++;
         }
         return _loc1_;
      }
      
      public function collectionAvailable() : Boolean
      {
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1092) >= 7)
         {
            return true;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1097) > 0)
         {
            return true;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1099) > 0)
         {
            return true;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1104) > 0)
         {
            return true;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1111) > 0)
         {
            return true;
         }
         return false;
      }
      
      public function collectTheGoodies() : void
      {
         var flag3:int;
         var _g3:FarmCorruption;
         var flag2:int;
         var _g2:FarmCorruption;
         var flag1:int;
         var _g1:FarmCorruption;
         var flag:int;
         var _g:FarmCorruption;
         var _loc1_:* = null as Player;
         var _loc2_:* = null as Function;
         clearOutput();
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1092) >= 7)
         {
            outputText("你漫步来到辣椒地边缘的大石头旁，看到一个小麻布袋塞在石头的褶缝下面，不由得笑了笑。你把它捞起来，打开数了数，里面有" + FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1093) + "颗宝石。[pg]");
            if(farmValue() < 25)
            {
               outputText("你皱起眉头——这么大一摊生意，收入似乎少得可怜。也许你可以跟惠特尼谈谈这事。[pg]");
            }
            _loc1_ = get_player();
            _loc1_.set_gems(_loc1_.get_gems() + FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1093));
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1093,0);
            FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1092,0);
            get_game().output.showStats();
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1097) > 0 || FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1099) > 0 || FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1104) > 0 || FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1111) > 0)
         {
            outputText("你的“农夫”们在分派给他们的女管事监督下忙得不可开交。一小包货物和宝石一起藏好了，只等你来取。[pg]");
         }
         menu();
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1097) > 0)
         {
            outputText("<b>" + FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1097) + "x");
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1097) == 1)
            {
               outputText("瓶女魅魔乳。");
            }
            else
            {
               outputText("瓶女魅魔乳。");
            }
            outputText("</b>\n");
            _g = this;
            flag = 1097;
            _loc2_ = function():void
            {
               _g.takeItems(flag);
            };
            addButton(0,getItemObj(1097).get_shortName(),_loc2_);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1099) > 0)
         {
            outputText("<b>" + FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1099) + "x");
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1099) == 1)
            {
               outputText("瓶男魅魔药剂。");
            }
            else
            {
               outputText("瓶男魅魔药剂。");
            }
            outputText("</b>\n");
            _g1 = this;
            flag1 = 1099;
            _loc2_ = function():void
            {
               _g1.takeItems(flag1);
            };
            addButton(1,getItemObj(1099).get_shortName(),_loc2_);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1104) > 0)
         {
            outputText("<b>" + FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1104) + "x");
            outputText("枚大型" + FlagDict_Impl_.arrayReadString(KFLAGS.flags,1103) + "蛋");
            if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1104) > 1)
            {
               outputText("");
            }
            outputText("。");
            outputText("</b>\n");
            _g2 = this;
            flag2 = 1104;
            _loc2_ = function():void
            {
               _g2.takeItems(flag2);
            };
            addButton(2,getItemObj(1104).get_shortName(),_loc2_);
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1111) > 0)
         {
            outputText("<b>" + FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1111) + "x");
            outputText("包草药避孕药。");
            outputText("</b>\n");
            _g3 = this;
            flag3 = 1111;
            _loc2_ = function():void
            {
               _g3.takeItems(flag3);
            };
            addButton(3,getItemObj(1111).get_shortName(),_loc2_);
         }
         addButton(14,"返回",rootScene);
      }
      
      public function collarboneIntro() : void
      {
         outputText("你命令她跪在你面前，一动也别动。你那苗条而赤裸的犬娘照做了，安安静静地保持不动。你把手指蘸进墨水，小心翼翼地在她身上画下图案，然后用纸将其封定。");
      }
      
      public function cockOralTrainingStageTwo() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你一言不发，解开[armor]的下半部分，带着淡淡的笑意露出你的[cock biggest]。无需任何指示，惠特尼便开始行动；她的手探进内裤里，满足地叹息一声，眼睛专注于面前的任务，同时用纤细身体紧绷而急促的抽动，稳稳挑起胯间的热意。");
         if(!get_player().hasVagina())
         {
            outputText("[pg]");
            if(get_player().balls > 0)
            {
               outputText("[pg]她照你吩咐的那样开始，俯下身去舔弄你的[balls]，温热湿润的舌头无声地在你的睾丸周围游走探索，细细舔遍每一寸，还不时把它们含入口中，贴近地吮吸照料。");
            }
            if(int(get_player().cocks.length) > 1)
            {
               outputText("等她准备好了，便握住你的[cock biggest2]，先试探性地套弄了一下，随后开始轻柔而缓慢地撸动；她清楚记得该怎样握住、怎样顺着那粗大的形状摆弄，为接下来的正餐做准备。");
            }
            outputText("[pg]她抬起身，将你的[cock biggest]吞入口中，用湿热的吮吸包裹住它；光是看着她急切自慰的模样，你就已经硬了起来。她开始动作，你叹了口气，看着她的脑袋上下起伏，把你越来越多的长度纳入她那张迎接你的嘴里。不过还是有些生涩；");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("她太急着把嘴唇继续往你的[cock biggest]深处压下去，又忙着摆弄自己的阴蒂，偶尔会忘了手里还握着那根胀起的长度，你不得不低声提醒她集中注意。");
            }
            else
            {
               outputText("她仍会偶尔忘了埋在自己嘴里的那根长度，只顾着热切地摆弄自己的阴蒂，你不得不低声提醒她集中注意。");
            }
            outputText("尽管如此，涌向你胯间的那股虔诚快感已经近乎娴熟，你发现自己渐渐沉溺其中，闭上眼，忘了继续指导，彻底迷失在你这只母狗柔软、精准而陶醉的动作里，耳边尽是她的轻叹与吮吸声。");
            outputText("[pg]当高潮开始积聚，被你的奴隶那温热的膜拜撩拨得如此强烈时，你恍惚得几乎忘了下令。然而精液涌起之际，你偶然低头一看，正对上那双深情望回来的棕色眼睛，于是想了起来。");
            outputText("[pg][say: 射吧。]你勉强说道，随即闭上眼，全身投入其中。你身体绷紧，马眼张开，把精液猛地灌进她喉咙里；你听见惠特尼含混的呻吟，她在你身下颤抖，眼睛上翻，同时手指在自己的小穴里探索，攀上了属于她的高潮。令你极为满意的是，尽管她已经沉浸在远超你想象的臣服快感之中，她仍然设法吞下了你射出的每一滴精液");
            if(get_player().cumQ() >= 1500)
            {
               outputText("——这可不是什么容易的事，毕竟那感觉就像你把足足一加仑的量都射进了她的喉咙。等你差不多结束时，和往常一样，你把最后几道乳白精液喷在她的脸和衣服上");
            }
            outputText("。");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("被她握在手里的第二根肉棒也和第一根一样急切地射出精液，双重高潮夹击得你额头渗出汗珠；它慷慨的释放在她的裙子上涂开一片。");
            }
            outputText("[pg]当你最后一次绷紧之后，你带着圣洁般的满足叹了口气，漂浮在口交后的恍惚余韵里，整个人轻飘飘的，仿佛没了形体。你闭上眼睛，而无需你开口吩咐，");
            if(int(get_player().cocks.length) == 1)
            {
               outputText("惠特尼便用平展的舌头清理你的[cock biggest]，一边哼着声，一边把你仍在渗液的龟头舔干净，舒服地安抚着你酸胀的肉棒。");
            }
            else
            {
               outputText("惠特尼先用平展的舌头清理你的[cock biggest2]，再清理你的[cock biggest]，一边哼着声，一边把你每个仍在渗液的龟头舔干净，舒服地安抚着你酸胀的肉棒。");
            }
            outputText("[pg][say: 你喜欢吗，[master]？]她说道，声音里带着一点晕乎乎的尾音。她看起来有些醉意，眼皮半垂。[say: 我觉得我……我觉得我已经掌握了。]她已经相当熟练了，但你本能地知道，她还没有达到自己所能做到的最好。你迎着她的目光，告诉她做得不错——但最顶尖的口交高手永远不会停止寻找让自己变得更好的方法。你的犬娘微微皱起眉，接受了这一点。");
            outputText("[pg][say: 我、我明白了，[master]。下一次一定会是最棒的一次！]");
         }
         else if(get_player().hasVagina())
         {
            if(get_player().balls > 0)
            {
               outputText("[pg]她照你吩咐的那样开始，俯下身去舔弄你的[balls]，温热湿润的舌头无声地在你的睾丸周围游走探索，细细舔遍每一寸，还不时把它们含入口中，贴近地吮吸照料。");
            }
            outputText("等她把自己也弄得兴奋起来后，便把发烫的小手指滑进你两腿之间，找到了你的[vagina]，开始缓缓玩弄。一根柔软的手指勾逗着你的[clit]，另一根则深深探入你的通道，在你的女性性器内外轻柔滑动，直到那里急切地沁出淫液，主动为她小心而挑逗的动作敞开。");
            outputText("[pg]当你因她对你女性性器的照料发出赞许的低吟时，她抬起身，将你的[cock biggest]吞入口中，用湿热的吮吸包裹住它；光是看着她急切自慰的模样，你就已经硬了起来。她开始动作，你叹了口气，看着她的脑袋上下起伏，把你越来越多的长度纳入她那张迎接你的嘴里。不过还是有些生涩；她偶尔会忘了手还埋在你的[vagina]里，你不得不低声提醒她集中注意。尽管如此，涌向你胯间的那股虔诚快感已经近乎娴熟，你发现自己渐渐沉溺其中，闭上眼，忘了继续指导，彻底迷失在你这只母狗柔软、精准而陶醉的动作里，耳边尽是她的轻叹与吮吸声。");
            outputText("[pg]当高潮开始积聚，被你的奴隶那温热的膜拜撩拨得如此美妙时，你恍惚得几乎忘了下令。然而精液涌起之际，你偶然低头一看，正对上那双深情望回来的棕色眼睛，于是想了起来。");
            outputText("[pg][say: 射吧。]你勉强说出口，闭上眼睛，全身心投入其中。惠特尼含混的呻吟传入你耳中；你的身体绷紧，马眼张开，把精液一股股灌进她的喉咙。她含着你浑身发颤，眼珠上翻，手指在自己的小穴里探弄着，也攀上了自己的高潮。让你无比满意的是，尽管她已经沉在遥远的臣服快感里，仍然把你射出的每一滴精液都吞了下去。你的[vagina]夹着她的手指发颤，同时迎来高潮；双重高潮带来的压倒性感受让你仰起脖颈，用温热的女性认可浸湿了她不断抽动的手指。");
            outputText("[pg]当你最后一次绷紧身体后，你幸福地叹息一声，在口交后的余韵里轻飘飘地失去了形状。你闭上眼睛，惠特尼无需吩咐便先用扁平的舌头清理你的小穴，让舌头在你湿透的阴道周围美妙地探寻，舔去每一道流出的淫液，然后才抬起身，来到你还在渗液的 [cock biggest] 前。她一边哼着声，一边舔净你渗液的龟头，惬意地安抚着你酸胀的肉棒。");
            outputText("[pg][say: 你喜欢吗，女主人？]她说，声音里带着一点晕乎乎的感觉。她看上去有些醉了，瞳孔放大。[say: 我觉得我……我觉得我掌握了。]她已经变得相当熟练，但你本能地知道，她还没有达到自己真正的极限。你凝视着她的眼睛，告诉她做得很好——但最优秀的舔屌者永远不会停止寻找让自己更进一步的方法。你的犬娘微微皱眉，接受了这一点。");
            outputText("[pg][say: 我、我明白了，主人。下次一定会是最好的一次！]");
         }
         get_player().orgasm("Dick");
         dynStats(DynStat.Sens(-1));
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function cockOralTrainingStageThree() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你看着跪在面前的犬女，露出一抹坏笑，任由沉默慢慢拉长。她几乎按捺不住期待地望着你，不停用舌头舔过嘴唇，短短的尾巴一下下抽打着裙摆，而你则慢条斯理地脱下[armor]下半部分。和之前一样，你的动作慢得近乎折磨；你细细品味着身下传来的压抑呻吟与呜咽。");
         outputText("[pg]当你终于坐定，将[cock biggest]托到她眼前时，惠特尼最后一丝克制也崩溃了。她毫不掩饰地喘着气，舌头垂在外面，贪婪地盯着那件令她堕落的工具。你让它轻轻擦过她的脸");
         if(int(get_player().cocks.length) >= 2)
         {
            outputText("，同时让你的另一根肉棒");
         }
         if(int(get_player().cocks.length) > 2)
         {
            outputText("");
         }
         if(int(get_player().cocks.length) >= 2)
         {
            outputText("在它后面展开并晃动起来");
         }
         if(get_player().hasVagina() && int(get_player().cocks.length) >= 2)
         {
            outputText("以及");
         }
         if(get_player().hasVagina())
         {
            outputText("，不紧不慢地露出你湿润的[vagina]");
         }
         if(int(get_player().cocks.length) >= 2 && get_player().hasVagina())
         {
            outputText("与此同时");
         }
         outputText("，让你浓重的麝香味在她周围弥漫开来。");
         outputText("[pg][say: 诸神啊，]她呻吟着，目光无法移开，重重地咽了口唾沫。");
         outputText("[pg][say: 该教你最后一件事了，]你轻声说道。你在心里欣赏着眼前辛苦调教出的成果，表面上却不露半点情绪。[say: 我手下有很多需要被干的荡妇，可我的时间没那么多。所以，如果你想享受我赐给你的东西，如果你想做一条不知羞耻的母狗，除了跪下吸我的鸡巴、边喝我的精液边呻吟着湿透自己之外别无所求，那你就得开口请求。态度要好。]");
         outputText("[pg][say: 是！]那条尾巴摇得更厉害了。");
         outputText("[pg][say: 好。把双手伸到身前，弯起来。背挺直。很好。现在跟我念：求您了，[master]，我可以吸您的鸡巴吗？]");
         outputText("[pg][say: 求您了，[master]，我可以吸您的鸡巴吗，]惠特尼急切地说道，话语几乎连成一片；她跪在你面前乞求时，那双深情又渴求的眼睛始终没有离开你。你向后靠了靠，花了点时间考虑。");
         outputText("[pg][say: 很好，]你冷淡地说道。[say: 不过下次要说得更清楚。开始吧。]");
         if(!get_player().hasVagina())
         {
            outputText("[pg]她猛地向前一颤，伸出舌头，急切得近乎无法自持。");
            if(get_player().balls > 0)
            {
               outputText("你幸福地叹息着，那条扁平、温热、绒布般的舌头铺上你的[balls]，覆盖每一寸肌肤；每一颗敏感的卵球都被你的奴隶含入口中，温柔地吮吸，直到它们在积蓄的热意中悸动鼓胀。她顺从地舔净它们时，从你两腿间传来的柔软淫荡呻吟，更让这份充满爱意的服侍美妙无比。");
            }
            outputText("她抬起身，直到脑袋与你半勃起的鸡巴齐平，然后用漫长、细致而妙不可言的舔舐让它彻底硬起。她的舌头沿着你的整根肉棒舔过，随后绕着你的[cockHead biggest]打转，压上那些她知道会让你被欲望胀得紧绷的敏感点。她一边这么做，一边稳稳握住根部，时不时用力一攥，与她在你鼓胀龟头上的格外轻柔舔弄形成鲜明对比。");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("[pg]当她用美妙的快感沐浴你的[cock biggest]时，她又用手环住你的[cock biggest2]，握力时松时紧，沿着柱身上下滑动，直到它也变得和她正在舔弄的那根一样坚硬如石。");
            }
            if(int(get_player().cocks.length) > 2)
            {
               outputText("最后，她将另一只手缠上你的[cock biggest3]，转动手腕，以同样滑动而周到的动作轻轻揉弄。} 变幻的愉悦淹没你那丛生的肉棒，让你忍不住张开了嘴。");
            }
            outputText("[pg]当她终于用嘴包住你挺出的顶端时，你忍不住愉悦地呻吟出声。她做得极其缓慢，让薄唇一点点沿着你的肉棒滑下，同时凹陷双颊，用错落有致的吸力，将越来越多的[cock biggest]包裹进吮吸与湿热之中。她的脑袋上下起伏，立刻找到了性感的节奏：当嘴退回你圆鼓鼓的顶端时，她的舌头便向下滑去；当她把你的肉棒深深吞入口中时，舌头又向上回卷。她用这种交替的动作，将一阵阵纯粹的狂喜送进你的胯间。");
            outputText("[pg]你一直盯着下方正不停吞吐的奴隶，但其实完全没有必要。她现在很清楚自己在做什么，双手与嘴巴的每一个动作都精准无比，引导着丰沛的快感与浓烈的热意在你胯间脉动。对她来说，这样服侍你得到的快感，或许比你感受到的还要强烈。她含着你的鸡巴下沉时又呻吟又喘息，几乎就像那是你正在插入的第二个小穴，深陷在你植入她内心深处的那团腐化服从冲动之中。你咧嘴笑着，欣赏你娇小的奴隶崇拜你的身体。那倒也有趣，不是吗？把她的嘴变成一个漂亮又湿润的小穴？嗯，你做不到那个，不过……当她一边紧紧含住你几乎整根长度，一边让舌头一路滑到根部时，你不禁呻吟出声……你觉得，鉴于她如此刻苦的学习，她确实配得上一点认可的标记。");
            outputText("[pg]你抓住这些念头，将黑暗的力量灌入其中；淹没你雄性器的快感强度不断攀升，你开始向上挺动，冲向无可抗拒的高潮。你抓住她的脑袋，开始深深插入她" + (get_player().biggestCockLength() < 8 ? "嘴里" : "喉咙") + "那紧紧吮吸的深处。你费了些力气才保持清醒，打量着这名犬女；她因你猛烈撞入她湿润的口腔而发出愉悦的呜咽");
            if(get_player().balls > 0)
            {
               outputText("，你沾满唾液、亮晶晶的[balls]拍打着她的下巴");
            }
            outputText("。要说她现在还有什么不足，那就是她的嘴唇还相当薄，颜色也很淡。没有哪个擅长吸鸡巴的勇者会长着这样的嘴唇——它们应该又大又肿，像被蜜蜂蜇过一样，还该随着饥渴舌头的动作永远湿漉漉的。那该是足以让你的肉棒滑入其间的丰润娼妇肉唇。你将这些甜美而邪恶的念头深深压进自己的胯间，压进那里无可阻挡地积聚起来的灼热之中。");
            outputText("[pg]即使你正按着她的脸猛干，惠特尼也总能做出最恰到好处的反应：当你往外抽出时，她便收紧脸颊，贪婪地吮吸你逐渐退出的肉棒；而当你坚决地再次挺入时，她又会彻底放松嘴巴，让你尽可能深入那美妙而紧致的温热之中——" + (get_player().biggestCockLength() < 8 ? "她口腔深处" : "她的喉咙") + "。你在灿烂而忘我的快感中飞升，已经说不出话来；你仰起头，尽可能把肉棒埋进她体内，额头渗出汗珠，每当你把一大股精液喷泉般灌进她喉咙时，口中都只剩下无言的吼声。");
            outputText("[pg]你身下传来一连串尖细而窒闷的呜咽，她的身体在你身下颤抖着；即使不看你也知道，惠特尼也高潮了——仅仅是因为能吞下主人射进她体内的每一滴浓稠精种，就让她在涎水淋漓的喜悦中达到了顶点。");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("她也一刻没忘记那根肉棒");
               if(int(get_player().cocks.length) > 2)
               {
                  outputText("");
               }
               outputText("还被她攥在手里；她榨弄着");
               if(int(get_player().cocks.length) == 2)
               {
                  outputText("它");
               }
               else
               {
                  outputText("它们");
               }
               outputText("力道丝毫不亚于你操弄她嘴巴的力度，而");
               if(int(get_player().cocks.length) == 2)
               {
                  outputText("它抽动着");
               }
               else
               {
                  outputText("它们抽动着");
               }
               outputText("同样急切地喷出精液，随着你的");
               if(int(get_player().cocks.length) == 2)
               {
                  outputText("双重");
               }
               else if(int(get_player().cocks.length) == 3)
               {
                  outputText("三重");
               }
               else
               {
                  outputText("超凡");
               }
               outputText("高潮攫住你时，狂乱也随之将你吞没；");
               if(int(get_player().cocks.length) == 2)
               {
                  outputText("它涂满了");
               }
               else
               {
                  outputText("它们弄脏了");
               }
               outputText("她的裙子染满");
               if(int(get_player().cocks.length) == 2)
               {
                  outputText("它的");
               }
               else
               {
                  outputText("它们的");
               }
               outputText("丰沛精液。");
            }
            outputText("她突然震惊地倒吸一口气，你也立刻低头看去。她的嘴唇看起来肿了起来，而且似乎正逐渐发黑。");
            outputText("[pg]你兴奋地低吼着，继续把肉棒往她嘴里抽送；这种对你堕落力量的赤裸展现让你又涌起了新的劲头。每一股精液被你顶过她的双唇时，她的嘴唇都会更加肿胀、颜色也更深一点；在你疯狂的抽插下，她的眼睛上翻，双唇丰润起来，开始泛出湿润、深不见底的漆黑光泽。最后，你再也射不出更多了；你抽身而出，踉跄着后退，强烈的快感让你眼前金星乱冒。");
            outputText("[pg]你带着极乐般的叹息，漂浮在口交后的恍惚余韵中，轻飘飘得仿佛没有形体，只听着惠特尼慢慢恢复自己的意识。");
            outputText("[pg][say: 主、主人，你做了什么？我的嘴……它好——] 一声轻微而湿润的声响传来，紧接着是急促的吸气。片刻之后，你感到她湿润丰厚的双唇包住了你胀痛的[cock biggest]上正沁出液珠的顶端。");
            outputText("[pg]你或许没有给她第二个小穴，但很快就能看出，她那新生的丰满黑唇几乎同样敏感——至少用在你身上时是这样。惠特尼不只是心满意足地叹息着，一边替你清理");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("整个");
            }
            outputText("肉棒");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("");
            }
            outputText("，先是深深亲吻你的顶端，然后贴近舔舐；她像个荡妇一样呻吟着。她把屁股高高翘起，让舌头带着你精液的味道，在她新生的肉棒枕间四处推挤，轻柔地套弄着你已经射过的肉棒");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("");
            }
            outputText("，好让最后一点也垂涎般流出来。");
            outputText("[pg]你闭上眼，享受她那新生的嘴唇在你胯间带来的美妙触感。她搜寻着你气味的最后一丝痕迹，一边深深吐息，一边将其舔入口中，那模样仿佛你不是只是躺在那里，而是在给她世上最令人神魂颠倒的性爱。现在的她不只是个技艺高超的榨精奴，更对你上了瘾，也完全具备了让你尽情利用这两点的身体条件。");
            outputText("[pg]在她让你的肉棒更胀痛之前，你把她拉开，将她结实娇小的身体按进你的[chest]，懒洋洋地低头看着她。她眼中那股压倒性的渴求已经稍稍平息了一些，但从今以后，它再也不会真正离开她了。");
            outputText("[pg][say: 我……] 她低声说着，舔了舔自己丰润的黑唇。[say: 我想我现在明白了，主人。] 你骄傲地朝她笑了笑，然后在她耳后揉了揉，又拍了拍她的屁股，默默地让你这位训导荡妇带着昏沉踉跄的步伐离开。");
         }
         else if(get_player().hasVagina())
         {
            outputText("[pg]她猛地向前一颤，伸出舌头，急切得几乎无法自持。她把脸深深埋进你的胯间，让你先是笑出声，随后又发出轻柔的低吟；她把薄唇和探寻的舌头贴上你的[vagina]。她舔弄着你的小穴，你叹息起来；她先轻柔地绕着外侧的阴唇打转，随后探入其中，抚过你敏感的内壁，最后找到你的[clit]。她满足地轻哼着，把薄而湿热的舌面铺在上面，不断推弄、轻点，直到它因渴求而鼓胀起来，你的甬道也兴奋地滴下淫液。考虑到她完全是个新手，她——当她又送来一阵奢美的酥麻在你体内荡开时，你不禁倒吸一口气——她真的很擅长。等她把你弄得足够湿润后，她便用温暖的手取代了灵巧的舌头，轻柔地抚弄着你的阴蒂，同时向上移去。");
            if(get_player().balls > 0)
            {
               outputText("[pg]那条平坦温暖、像法兰绒一样柔软的舌头铺上你的[balls]，覆盖住每一寸肌肤时，你幸福地叹息起来。每一颗敏感的睾丸都被你的奴隶含入口中温柔吮吸，直到它们在满溢的热意中震颤胀起；她一边恭顺地替它们细细舔净，腿间还传来柔软而淫荡的呻吟，让这份爱抚变得更加美妙。");
            }
            outputText("[pg]她抬起身，直到脑袋与你半硬的肉棒齐平，接着用漫长、谨慎而精妙的舔舐让它猛烈勃起。她的舌头沿着整根肉棒滑过，又在你的顶端打转，压向那些她知道会让你因欲望而沉重绷紧的敏感点。与此同时，她稳稳握住根部，时不时用力一捏，与她在你鼓胀顶端格外柔软的一舔形成鲜明对比。");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("当她让你的[cock biggest]沐浴在美妙快感中时，她又用手环住你的[cock biggest2]，时松时紧，沿着柱身上下滑动，直到它也和她正舔弄的那根一样硬得像石头。");
            }
            outputText("你闭上眼，任由同时淹没你男性与女性性器的快感相互交缠，像一场缓慢却璀璨的化学反应，从体内将你吞噬。");
            outputText("[pg]当她终于用嘴包住你挺出的顶端时，你忍不住愉悦地呻吟出声。她做得极其缓慢，让薄唇一点点沿着你的肉棒滑下，同时凹陷双颊，用错落有致的吸力，将越来越多的[cock biggest]包裹进吮吸与湿热之中。她的脑袋上下起伏，立刻找到了性感的节奏：当嘴退回你圆鼓鼓的顶端时，她的舌头便向下滑去；当她把你的肉棒深深吞入口中时，舌头又向上回卷。她用这种交替的动作，将一阵阵纯粹的狂喜送进你的胯间。");
            outputText("[pg]你密切注视着下方不断吞吐的奴隶，但其实根本没这个必要。她现在清楚地知道自己在做什么，手与嘴的每一个动作都精准无比，带来奢侈的快感与浓烈的热意，在你的胯间一波波脉动。为你做这些，带给她的快乐甚至可能比你得到的还要更多。她含着你的肉棒下沉时呻吟、喘息，几乎就像那是被你插入的第二个小穴，被你深深种入她体内的堕落顺从冲动缠得无法自拔。你欣赏着这娇小的肉棒奴隶膜拜你的身体，不由得咧嘴一笑。把她的嘴变成一个又湿又舒服的小穴，那可真有意思，不是吗？好吧，你做不到那种程度，不过……当她一边紧紧吮住几乎整根肉棒，一边让舌头一路滑到你的根部时，你发出一声低吟……你觉得，鉴于她如此努力地学习，她确实配得上一点认可。");
            outputText("[pg]你抓住这些念头，将黑暗的力量注入其中；淹没你性器的快感强度不断攀升，你也开始向上顶弄，冲向难以抗拒的高潮。你抓住她的头，开始深深 thrust 进她那紧紧吸吮的");
            if(get_player().biggestCockLength() < 8)
            {
               outputText("嘴");
            }
            else
            {
               outputText("喉咙");
            }
            outputText("。你费了些力气才稳住自己，一边继续猛顶那狗女湿润的嘴，一边看着她因愉悦而向你呜咽");
            if(get_player().balls > 0)
            {
               outputText("，你沾满唾液、亮晶晶的[balls]拍打着她的下巴");
            }
            outputText("。要说她现在还有什么不足，那就是她的嘴唇还相当薄，颜色也很淡。没有哪个擅长吸鸡巴的勇者会长着这样的嘴唇——它们应该又大又肿，像被蜜蜂蜇过一样，还该随着饥渴舌头的动作永远湿漉漉的。那该是足以让你的肉棒滑入其间的丰润娼妇肉唇。你将这些甜美而邪恶的念头深深压进自己的胯间，压进那里无可阻挡地积聚起来的灼热之中。");
            outputText("[pg]就算你按着她的脸猛干，惠特尼也总能做出恰到好处的反应：你向外抽出时，她会收紧双颊，贪婪地吸吮你逐渐退出的肉棒；等你再次挺入时，她又会完全放松嘴巴，让你能最大限度地进入");
            if(get_player().biggestCockLength() < 8)
            {
               outputText("她口腔深处");
            }
            else
            {
               outputText("她的喉管");
            }
            outputText("那美妙而紧致的温热之中。你在冲向金色而狂喜的顶点时，已经找不到任何言语；你仰起头，尽可能把肉棒深深埋进她体内，额头渗出汗珠，每一大股精液喷进她喉咙时，你都发出吠叫般的低吼与嚎声。");
            outputText("[pg]你下方传来一连串尖细而窒息的叫声，她的身体在你身下发颤；不用看你也知道，惠特尼也高潮了，只因吞下[master]挺入她体内的每一滴浓稠精液，便让她沉溺在垂涎的狂喜之中。她的手指在你的[vagina]周围滑动游走，它也在共同的高潮中颤抖收缩");
            if(get_player().wetness() > 2)
            {
               outputText("，随着你的淫液涌出，浸透了她的手臂");
            }
            outputText("，把你感受到的快感推向令人失神的高度。");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("她一刻也没有忘记被握在掌中的那根肉棒；她像你狠狠干她的嘴一样用力榨弄它，而它也像第一根一样急切地喷出精液。你的");
               if(int(get_player().cocks.length) == 2)
               {
                  outputText("三重");
               }
               else
               {
                  outputText("超然");
               }
               outputText("高潮将你攫住，令你陷入恍惚；丰沛的射精涂满了她的裙子。");
            }
            outputText("[pg]她突然惊讶地倒吸一口气，你立刻低头看去。她的嘴唇看起来肿了起来，颜色似乎也在变深。你因狂喜而闷哼，继续把自己的肉棒抽插进她口中，眼前这场腐化力量的直观展示让你又重新涌起力气。每当你将一股精液顶过她的嘴唇，它们就会更肿、更暗一些；在你狂乱的抽插下，她双眼上翻，嘴唇变得饱满，并开始泛起湿润而深不见底的黑亮光泽。终于，你再也射不出更多东西，抽身退开时踉跄着后退，强烈的快感让你眼前金星乱冒。");
            outputText("[pg]你带着极乐般的叹息，漂浮在口交后的恍惚余韵中，轻飘飘得仿佛没有形体，只听着惠特尼慢慢恢复自己的意识。");
            outputText("[pg][say:女、女主人，你对我做了什么？我的嘴……它好——]一声细小而湿润的声响后，她猛地吸了口气。片刻之后，你感觉到双手环上你的[hips]，那湿滑无阻的丰润触感压在你正渗出液珠的[vagina]上。");
            outputText("[pg]你也许没能给她第二个小穴，但很快就能看出来，她全新而丰满的黑唇几乎同样敏感，至少在用来侍奉你时是这样。惠特尼清理你的性器时，可不只是满足地叹息而已；她让嘴唇滑过你悸动的小穴，直到那里几乎闪闪发亮，随后才转向你的[cockplural]，先深深吻住你的龟头，再贴近舔舐；她呻吟得像个娼妇。她把屁股高高翘起，舌头带着你淫液的味道，在那对新的肉棒软垫周围不断推挤，同时轻轻套弄你射空的[prickplural]，逼出最后一点残精。");
            outputText("[pg]你闭上眼，享受她那新生的嘴唇在你胯间带来的美妙触感。她搜寻着你气味的最后一丝痕迹，一边深深吐息，一边将其舔入口中，那模样仿佛你不是只是躺在那里，而是在给她世上最令人神魂颠倒的性爱。现在的她不只是个技艺高超的榨精奴，更对你上了瘾，也完全具备了让你尽情利用这两点的身体条件。");
            outputText("[pg]在她让你的肉棒更胀痛之前，你把她拉开，将她结实娇小的身体按进你的[chest]，懒洋洋地低头看着她。她眼中那股压倒性的渴求已经稍稍平息了一些，但从今以后，它再也不会真正离开她了。");
            outputText("[pg][say: 我……]她低声说着，舔了舔那对饱满的黑色嘴唇。[say: 我想我现在明白了，女主人。]你骄傲地朝她露出笑容，然后在她耳后揉了揉，又拍了拍她的屁股，默默让你这位任务女奴晕乎乎、踉踉跄跄地离开了。");
         }
         get_player().orgasm("Dick");
         dynStats(DynStat.Sens(-1));
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function cockOralTrainingStageOne() : void
      {
         clearOutput();
         whitneySprite();
         outputText("叹了口气，你脱下[armor]的下半部分，微笑着告诉她该上下一课了。看到你的[cock biggest]，惠特尼不安地绞着自己的" + (whitneyDefurred() || get_noFur() ? "双手" : "爪子") + "。你觉得她并不是不情愿，只是害怕自己做不好。所以你的指导温柔又耐心。你让她一边看着你裸露的胯间，一边重新抚弄自己；等她看起来没那么焦虑了，才让她开始舔。");
         outputText("[pg]接下来的十五分钟偶尔令人挫败，但最终还是令人满意。她似乎怎么也改不掉本能，总像舔自己的胯间那样舔你的肉棒；那感觉既舒服，看起来也挺滑稽，但你还是得相当坚决地指导她，让她真正把你含进去。她在一心二用上还有点问题，有时太沉浸于其中一边，就会停下抚弄阴蒂，或是忘了吸吮你的肉棒。");
         if(get_player().hasVagina() || int(get_player().cocks.length) > 1)
         {
            outputText("你知道她必须学会同时处理不止一件事，所以你尽可能严格，确保她能把这点做好；甚至在她太投入地拨弄自己的小豆、又一次把你忘了的时候，你还会用肉棒拍打她。你不喜欢这么做，因为被训斥的狗女孩看起来实在让人心疼，但有些事总得做。");
         }
         outputText("[pg]不过她已经掌握了基本要领；她牢牢记住了，在伺候完你之前不该让自己先泄出来。于是她一边把自己逼到边缘，一边叹息呻吟，用柔软的嘴唇沿着你胀大的肉棒上下套弄。她的动作间也带着恰到好处的摩擦与配合，尽管你仍需慢慢告诉她该怎么做，却还是一点一点把你的欲火烧得炽热。你不再说话，抓住她的头，开始用力插进她那吮吸着你的口中。");
         if(get_player().biggestCockLength() > 12)
         {
            outputText("她的呕吐反射仍让她有些吃力，但只试了几次，她就能吞下你粗大的肉棒，让你毫无阻碍地抽插进她喉咙那令人愉悦的紧窄之中。");
         }
         outputText("[pg]你挺直背，带着近乎陶醉的神情闭上眼，快感一路攀升到顶点；你的[cock biggest]在惠特尼口腔深处绷紧，随即释放出来，一股接一股地把精液射进她喉咙里。");
         outputText("[pg][say: 你现在可以高潮了，贱狗，]在一阵令人满足的余韵低谷中，你声音沙哑地吐息道。");
         if(get_player().cumQ() >= 1500)
         {
            outputText("[pg]狗女人被你无比浓稠又大量的精液呛得咳嗽喷溅，即使精液从她鼻子里喷出、沿着下巴淌下，你仍有更多射进她胃里；但这并没有阻止她在内裤里疯狂动作，拼命拨弄自己的阴蒂，同时努力承受你这庞大的射精量。她本就已经到了边缘，所以没过多久，她便眼睛上翻，身体绷紧颤抖，嘴里还塞满肉棒。那景象足够令人愉悦，于是你拔出来，把最后几股精液射在她脸上和衣服上。她几乎都没注意到，只是喘息着，仍然忘我地抚弄自己。");
         }
         else
         {
            outputText("[pg]狗女人被你浓稠的精液呛得咳嗽喷溅，即使你还在继续往她体内灌入更多，其中一些也从她鼻子里淌了出来；但这并没有阻止她在内裤里疯狂动作，拼命拨弄自己的阴蒂，同时努力承受你这庞大的射精量。她本就已经到了边缘，所以没过多久，她便眼睛上翻，身体绷紧颤抖，嘴里还塞满肉棒。");
         }
         outputText("[pg]等你射完并抽身退出后，惠特尼又陷入了做爱后的恍惚里。你不得不刻意咳嗽一声，并用那愉快地发胀的[cock biggest]戳了戳她的脸，她才想起最后的任务。你叹了口气，感受着她温暖而扁平的舌头绕着你胀大、仍在渗出的龟头打转，把你舔得相当干净。");
         outputText("[pg][say: 刚才还挺好玩的，[master]，]她完成后咧嘴笑着说道。她的表情又稍稍阴了下来。[say: 不过你确定这真有用吗？我觉得我不是这块料。]你尽可能自信地告诉她，她进步得很好，只要记住这些课程，她很快就会成为勇者级的口交高手。惠特尼慢慢点了点头，显然正拼命让自己相信你的话。");
         outputText("[pg][say: 好的，[master]，我会试——我会做到的！]");
         get_player().orgasm("Dick");
         dynStats(DynStat.Sens(-1));
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function cockOralTrainingMaxed() : void
      {
         clearOutput();
         whitneySprite();
         outputText("你让自己坐定，脱下[armor]的下半部分。惠特尼看着这一幕，忍不住一再舔着嘴唇，让那对像被蜜蜂蜇肿般丰满的黑色唇瓣湿漉漉地发亮。早在你把[eachCock]抬到她眼前之前，她就已经摆好了姿势，并因知道接下来会发生什么而半是兴奋地挺起身子：背脊挺直，双手举起，手腕弯着，棕色的眼睛里满是泛红的欲望，尾巴缓缓摇动，无声地向你乞求。");
         outputText("[pg][say: 求您了，[master]，我可以含您的肉棒吗？]你让沉重的沉默持续了片刻。");
         outputText("[pg][say: 很好，]你仁慈地说道，张开你的[hips]。[say: 你这么勤勉地当个任务女奴，我想这也算是你应得的奖赏。]");
         if(!get_player().hasVagina())
         {
            outputText("[pg]她浑身一颤，猛地向前扑来，舌头伸出，迫不及待地想要开始。");
            if(get_player().balls > 0)
            {
               outputText("当她丰满的嘴唇压上你的[balls]，随后那条温热、扁平、像绒布般的舌头铺展开来，舔遍每一寸时，你幸福地叹了口气。每一颗敏感的睾丸都先被她充满情欲地亲吻，随后被你的奴隶含入口中，温柔吮吸，直到它们因积蓄的热意而鼓胀颤动。她顺从地为它们舔舐擦拭，而从你两腿之间传来的柔软淫荡呻吟渐渐化作近乎喘泣的愉悦声，让这份充满爱意的侍奉变得更加美妙。");
            }
            outputText("[pg]她继续往上，直到脑袋与半勃起的肉棒齐平。她用漫长、细致而美妙的舔舐让它彻底硬挺起来，舌头沿着整根长度滑过，随后又绕着你的顶端打转，压向那些她清楚知道会让你因渴求而涨硬绷紧的敏感点。她一边舔，一边稳稳握住根部，时不时用力一捏，与她在你鼓胀顶端上格外轻柔的一舔形成鲜明对比。");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("她让你的[cock biggest]沐浴在美妙的快感中，同时又用手握住你的[cock biggest2]，时而放松、时而收紧，沿着棒身上下滑动，直到它也变得和她正在舔弄的那根一样坚硬如石。");
            }
            if(int(get_player().cocks.length) > 2)
            {
               outputText("最后，她又将另一只手绕上你的[cock biggest3]，转动手腕，以同样细致的滑动动作温柔地揉榨着它。");
            }
            outputText("你张开嘴，任由那不断变换的愉悦淹没[eachCock]。");
            outputText("[pg]当她终于用嘴包住你挺起的顶端时，你忍不住愉悦地呻吟起来。她的动作慢得恰到好处，让那丰满、毫无摩擦感的双唇滑过你敏感的尿道口，随后张大嘴，缓缓沿着你的棒身往下吞入；她的脸颊向内凹陷，带着错落有致的吸吮，把你的[cock biggest]越来越多地包裹进吮吸的湿热之中。她的脑袋上下起伏，立刻找到了感官的节奏：当嘴退回你鼓胀的顶端时，舌头便向下滑去；而当她把你的长度深深含入口中时，舌头又往上卷回。她利用这种交替的动作，让纯粹的狂喜一波波冲击你的胯间。如今已经不需要任何指示了，你也什么都不必做，只要享受那丰润湿滑的封口在你的肉棒上上下滑动；那是一股温暖而变幻的快感潮水，将你带入一场绵长的性愉悦之中。");
            outputText("[pg]以惠特尼如今的技巧，只要她愿意，大概随时都能让你射出来。但她和你一样，想尽可能久地持续下去，所以她吹得极其缓慢而感性。她时不时发出的饥渴呻吟让愉悦的震动传遍你的肉棒，同时尽可能把她那敏感、沉迷于精液的嘴唇裹在你的粗度上。");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("在随后那段漫长而美妙的恍惚中，你调整着她的位置");
            }
            if(int(get_player().cocks.length) == 2)
            {
               outputText("，让她先把注意力转到你的[cock biggest2]上一会儿");
            }
            else if(int(get_player().cocks.length) >= 3)
            {
               outputText("让她的注意力先转向一根肉棒，再转向另一根");
            }
            if(int(get_player().cocks.length) > 1)
            {
               outputText("，好让你每一根硬得发胀的肉棒都能享受她口中紧密吮吸的包裹。");
            }
            outputText("[pg]把她一直推到你[cock biggest]的根部，这样她鼻子呼出的沉重呼吸就能温暖你的胯部，让她在那里待一段时间，你享受着她" + (get_player().biggestCockLength() < 8 ? "嘴巴" : "喉咙") + "后部带来的美妙亲密感");
            if(get_player().balls > 0)
            {
               outputText("，以及她的舌头再次滑过你的[balls]，");
            }
            outputText("随后你把手指插进她丝滑的头发里，小心却坚定地将她一路提起，举到你闪亮的阴茎上方，那个高度正好让她只能用舌尖够到，同时命令她捧住自己粉嫩的乳房。你悠然享受着她柔软的舌头舔弄你渗出液珠的龟头，听着她欲求不满的呻吟充满耳畔，欣赏着眼前的她，试图把记忆中那个冷静、独立的犬女，和如今被你攥在拳中垂吊着、因崇拜你的阴茎而淫液直流的呜咽母狗重叠起来。");
            outputText("[pg]你一放开她，她立刻又把自己贯回你的肉棒上");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("，她的双手也重新握住你的另一根阴茎");
            }
            if(int(get_player().cocks.length) > 2)
            {
               outputText("");
            }
            if(int(get_player().cocks.length) > 1)
            {
               outputText("仿佛从未松开过一样");
            }
            outputText("带着真正的渴望拉扯揉捏着你。淹没你男性象征的令人窒息的快感不断增强，你开始向上挺动，达到一种无法抗拒的高潮，抓住她的头，开始深深地插入她紧致吸吮的" + (get_player().biggestCockLength() < 8 ? "嘴里" : "喉咙里") + "。");
            outputText("[pg]一如既往，当你用惠特尼的脸发泄时，她总能做得恰到好处：你抽出时，她收紧脸颊，贪婪地吮吸着你后退的肉棒；你果断刺入时，她又完全放软口腔，让你能尽情进入" + (get_player().biggestCockLength() < 8 ? "她口腔深处" : "她的咽喉") + "那美妙而紧致的温热之中。她丰润的唇肉带来的并不是阻力，而是一种美妙的挤压感，随着你急切胀起的长度上下滑动。");
            outputText("[pg]当你冲向那金色而销魂的巅峰时，已经说不出话来；你仰起头，把尽可能多的肉棒埋进她体内，额头渗出汗水，每一大股精液喷入她喉咙时，你都发出无言的低吼。你身下传来一连串尖细而窒息的叫声，她的身体在你周围颤抖，不用去看你也知道惠特尼也高潮了，只因为能吞下主人刺入她体内的每一滴浓稠精种，她便得到了垂涎般的欢愉。");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("她一刻也没有忘记那根阴茎");
               if(int(get_player().cocks.length) > 2)
               {
                  outputText("");
               }
               outputText("还被她攥在手里；她榨弄着");
               if(int(get_player().cocks.length) == 2)
               {
                  outputText("它");
               }
               else
               {
                  outputText("它们");
               }
               outputText("力道丝毫不亚于你操弄她嘴巴的力度，而");
               if(int(get_player().cocks.length) > 2)
               {
                  outputText("它们抽动着");
               }
               else
               {
                  outputText("它抽动着");
               }
               outputText("同样急切地喷出精液，随着你的");
               if(int(get_player().cocks.length) == 2)
               {
                  outputText("双重");
               }
               else if(int(get_player().cocks.length) == 3)
               {
                  outputText("三重");
               }
               else
               {
                  outputText("超凡");
               }
               outputText("高潮攫住你时，狂乱也随之将你吞没；");
               if(int(get_player().cocks.length) == 2)
               {
                  outputText("它涂满了");
               }
               else
               {
                  outputText("它们弄脏了");
               }
               outputText("她的裙子，沾满");
               if(int(get_player().cocks.length) == 2)
               {
                  outputText("它的");
               }
               else
               {
                  outputText("它们的");
               }
               outputText("大量射出的精液。");
            }
            outputText("终于，你再也射不出什么了。你抽身退开，踉跄着往后退去，那股冲击让你眼前直冒金星。");
            outputText("[pg]你幸福地叹息着，在口交后的恍惚余韵中轻飘飘地浮着，仿佛连形体都散去了。片刻之后，你感觉到惠特尼湿润、丰软而毫无摩擦感的嘴唇，压上了你酸胀的[cock biggest]那滴着液珠的顶端。她像个荡妇似的呻吟着，细细品味残留在唇上的你的味道，舌头在她丰润的黑唇间四处舔动，满是你精液的滋味；同时她还轻轻套弄着你已经射空的[prickplural]，把最后一点也挤得滴落出来，好让她能更加贪婪地享用。你闭上眼睛，享受她那堕落的双唇在你胯间带来的愉悦触感。她搜寻着你气味的最后一丝痕迹，一边深深吐息，一边把它们舔入口中；那呼吸深得仿佛你并不是只躺在那里，而是在给她一场足以让人神魂颠倒的性爱。");
            outputText("[pg]等到你的整个胯间都被唾液擦亮，感觉像是泛着一层明亮光泽时，你把她拉开，将她结实而娇小的身体按进你的[chest]，懒懒地低头看着她。她眼中那股压倒性的渴求稍稍平息了一些，但如今它再也不会真正离开她了。");
            outputText("[pg][say:你该说什么，母狗？]");
            outputText("[pg][say: 谢谢您，[master]，]你的监工荡妇低声呢喃着，一边舔着她多汁的黑唇，一边满眼崇拜地凝视着你。你宠爱地揉了揉她一只耷拉着的耳朵，然后在她紧实的屁股上拍了一下，把她打发走；拍的时候，你还避开了她裙子上那块相当明显的湿痕。");
         }
         else if(get_player().hasVagina())
         {
            outputText("[pg]她猛地向前一颤，舌头伸了出来，急不可耐地想要开始。你叹息着，看她舔弄你的小穴，先是轻柔地绕着你的外阴唇打转，随后探入其中，抚过你敏感的内壁，最后找到了你的[clit]。她怀着深沉的欲望呻吟，把薄薄湿润的舌面铺在上面，不断推弄、点按，直到它饥渴地鼓胀起来，而你的甬道也兴奋得滴淌不止。");
            outputText("[pg]她舔弄你时呼吸又短又急，整张嘴都贴进你的[vagina]里，让那丰满的嘴唇压在你的阴蒂上，几乎就像在和你互相摩擦一般。想到这里，你愉快地把小穴顶进那片吮吸的湿热之中，而她也立刻以一声高亢的、纯粹愉悦的喘息作为回应。尽管这感觉美妙极了，但她还有许多地方要照顾，于是你只是微微动了动臀部，便无声地示意她继续往上。她用温暖的手替代了那娴熟的舌头，轻轻抚弄你的阴蒂和湿润甬道，同时向上移动。");
            if(get_player().balls > 0)
            {
               outputText("[pg]她丰润的嘴唇贴上你的[balls]时，你幸福地叹息起来。随后，那条温暖而扁平、柔软得像法兰绒般的舌头铺展开来，舔遍每一寸；每颗敏感的球体都先被她 sensual 地亲吻，再被你的奴隶含入口中轻柔吮吸，直到它们热意满胀、突突跳动。她从你腿间传来的柔软而淫荡的呻吟渐渐化作赤裸裸的喘息与愉悦的呜咽，而她又如此谄媚地将它们舔拭得发亮，使这份爱抚变得更加美妙。");
            }
            outputText("[pg]她继续往上，直到脑袋与半勃起的肉棒齐平。她用漫长、细致而美妙的舔舐让它彻底硬挺起来，舌头沿着整根长度滑过，随后又绕着你的顶端打转，压向那些她清楚知道会让你因渴求而涨硬绷紧的敏感点。她一边舔，一边稳稳握住根部，时不时用力一捏，与她在你鼓胀顶端上格外轻柔的一舔形成鲜明对比。");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("她让你的[cock biggest]沐浴在美妙的快感中，同时又用手握住你的[cock biggest2]，时而放松、时而收紧，沿着棒身上下滑动，直到它也变得和她正在舔弄的那根一样坚硬如石。");
            }
            outputText("男女两处性器都被变幻的快感淹没，你张开嘴，任由她挑逗的手指以与生俱来的娴熟动作，让双重快意在你体内交缠翻涌；那就像一场缓慢却耀眼的化学反应，从内部将你彻底吞没。");
            outputText("[pg]当她终于用嘴包住你挺起的顶端时，你忍不住愉悦地呻吟起来。她的动作慢得恰到好处，让那丰满、毫无摩擦感的双唇滑过你敏感的尿道口，随后张大嘴，缓缓沿着你的棒身往下吞入；她的脸颊向内凹陷，带着错落有致的吸吮，把你的[cock biggest]越来越多地包裹进吮吸的湿热之中。她的脑袋上下起伏，立刻找到了感官的节奏：当嘴退回你鼓胀的顶端时，舌头便向下滑去；而当她把你的长度深深含入口中时，舌头又往上卷回。她利用这种交替的动作，让纯粹的狂喜一波波冲击你的胯间。如今已经不需要任何指示了，你也什么都不必做，只要享受那丰润湿滑的封口在你的肉棒上上下滑动；那是一股温暖而变幻的快感潮水，将你带入一场绵长的性愉悦之中。");
            outputText("[pg]以惠特尼如今的技巧，只要她愿意，大概随时都能让你射出来。但她和你一样，都想尽可能让这一切持续得更久，所以她以难以置信的缓慢与 sensual 来为你口交。她时不时发出的饥渴呻吟让愉悦的震动传遍你的肉棒；她尽可能用那敏感又沉迷精液的双唇包住你的粗度，同时还不断爱抚你的[clit]，让你湿淋淋地持续发烫。");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("在随后那漫长而美妙的恍惚中，你把她挪来挪去");
            }
            if(int(get_player().cocks.length) == 2)
            {
               outputText("，让她先把注意力转到你的[cock biggest2]上一会儿");
            }
            if(int(get_player().cocks.length) >= 3)
            {
               outputText("，先让她伺候一根阴茎，再换到另一根");
            }
            if(int(get_player().cocks.length) > 1)
            {
               outputText("，好让你每一根硬得发胀的肉棒都能享受她口中紧密吮吸的包裹。");
            }
            outputText("[pg]把她一直推到你[cock biggest]的根部，这样她鼻子呼出的沉重呼吸就能温暖你的胯部，让她在那里待一段时间，你享受着她" + (get_player().biggestCockLength() < 8 ? "嘴巴" : "喉咙") + "后部带来的美妙亲密感");
            if(get_player().balls > 0)
            {
               outputText("，还有她的舌头再次滑过你的[balls]");
            }
            outputText("，然后你把手缠进她柔顺的头发里，小心却坚定地将她一路提起，悬在你的[cock biggest]上方，抬到她刚好只能用舌头够到的高度，同时命令她捧住自己桃子般的乳房。你从容地享受着她对你渗出液珠的龟头轻柔舔舐，也听着她懊恼的呻吟灌满耳中，沉醉地看着她，试图把记忆中那个冷静、独立的犬女，和此刻被你攥在拳中呜咽悬吊、只因膜拜你的阴茎就湿得一塌糊涂的母狗重合起来。");
            outputText("[pg]你松开她，她立刻又把自己套回你的肉棒上，手指也重新滑进你湿滑的小穴");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("，另一只手也重新握住你的[cock biggest2]");
            }
            outputText("，仿佛从未离开过一般，此刻带着真切的渴求拉扯、揉捏，又在你体内蜷曲搅动。淹没般的快感不断涌入你的性器，强度越来越高，你开始向上抽送，朝着无法抗拒的高潮攀升；你抓住她的头，开始深深 thrust 进她" + (get_player().biggestCockLength() < 8 ? "紧紧吮吸的嘴里" : "紧紧吮吸的喉咙里") + "。");
            outputText("[pg]即使你按着她的脸操，惠特尼也总能做出最恰到好处的反应：当你向外抽离时，她收紧双颊，贪婪地吮吸你退开的肉茎；当你决然向内挺入时，她又完全放松口腔，让你尽可能深入那美丽而紧致的温暖" + (get_player().biggestCockLength() < 8 ? "口腔深处" : "咽喉") + "。她丰润的唇瓣毫无阻碍，只带来绝妙的柔软挤压，沿着你急切胀大的肉棒上下包裹。你在冲向金色而狂喜的高潮时已经说不出话来；你仰起头，尽可能把更多阴茎埋进她体内，额头渗出汗水，每一股精液如喷泉般灌下她的喉咙时，你都发出无言的低吼。");
            outputText("[pg]你身下传来一连串尖细而窒息的呜咽，她的身体在你周围颤抖；即使不看，你也知道惠特尼也高潮了，只因为她怀着流涎般的喜悦，将[master] thrust 进她体内的浓稠种液一滴不剩地吞下。她的手指在你的[vagina]周围滑来滑去，随后弯进里面，按上你的敏感点；它在共同的高潮中颤动收缩，");
            if(get_player().wetness() > 2)
            {
               outputText("把她的手臂都浸湿，任你的淫液汩汩流下，");
            }
            outputText("将你感受到的狂喜推上足以让人神魂颠倒的高度。");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("她一刻也没有忘记被握在手里的[cock biggest2]；她榨弄它的力道就像你操她的嘴一样凶狠，而它也同样急切地抽动着射出精液。三重高潮一同夹紧你，令你陷入迷乱；丰沛的精液涂满了她的裙子。");
            }
            outputText("最终，你再也给不出更多，只能抽身退出，强烈的高潮让你眼前星光乱晃。");
            outputText("[pg]片刻之后，你感觉到一双手环住你的[hips]，她湿润而毫无摩擦的丰满唇肉压上你仍在渗液的[vagina]。惠特尼像娼妇一样呻吟着清理你的性器，让她的嘴沿着你悸动的小穴舔抚，直到你最后一滴淫液都消失不见，才转向你的[cockplural]，先深深亲吻你的龟头，再贴近舔舐，轻轻套弄你已经射过的[prickplural]，让最后一点精液也滴淌出来。你闭上眼，享受她堕落的嘴唇在你胯间带来的美妙触感；她搜寻着你气味的每一丝残留，一边舔净，一边发出一连串深长的吐息，仿佛你不是只是躺在那里，而是在给她世上最令人神魂颠倒的性爱。");
            outputText("[pg]等到你的整个胯间都被唾液擦亮，感觉像是泛着一层明亮光泽时，你把她拉开，将她结实而娇小的身体按进你的[chest]，懒懒地低头看着她。她眼中那股压倒性的渴求稍稍平息了一些，但如今它再也不会真正离开她了。");
            outputText("[pg][say:你该说什么，母狗？]");
            outputText("[pg][say:谢谢你，[master]。]你的任务母狗低声说道，一边舔着她饱满的黑色嘴唇，一边满眼爱慕地凝望着你。你怜爱地揉了揉她耷拉的耳朵后面，然后在她紧实的屁股上拍了一下，让她离开，同时避开了她裙子上那片相当明显的湿痕。");
         }
         get_player().orgasm("Dick");
         dynStats(DynStat.Sens(-1));
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function cockOralTraining() : Function
      {
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1136) == 0)
         {
            return firstCockOralTraining;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1136) <= 3)
         {
            return cockOralTrainingStageOne;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1136) == 4)
         {
            return firstCockOralTrainingStageTwo;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1136) <= 9)
         {
            return cockOralTrainingStageTwo;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1136) == 10)
         {
            return firstCockOralTrainingStageThree;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1136) == 11)
         {
            return cockOralTrainingStageThree;
         }
         return cockOralTrainingMaxed;
      }
      
      public function champPussylickerTattoo(param1:int) : void
      {
         var _loc3_:* = null as IMap;
         clearOutput();
         whitneySprite();
         var _loc2_:String = "\"舔穴勇者\"纹在她的";
         if(param1 == 0)
         {
            collarboneIntro();
            outputText("[pg][say: 我哪还需要别人提醒这种事啊，[master]，]她低头看见那行如今刻在自己胸口、任谁都能看见的字，又恼又窘地笑着说道。");
            _loc2_ += "collarbone.";
            _loc3_ = KFLAGS.flags;
            FlagDict_Impl_.arrayWriteString(_loc3_,1129,FlagDict_Impl_.arrayReadString(_loc3_,1129) + _loc2_);
         }
         else if(param1 == 1)
         {
            shouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1130,_loc2_);
         }
         else if(param1 == 2)
         {
            lowerbackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1131,_loc2_);
         }
         else if(param1 == 3)
         {
            buttIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1132,_loc2_);
         }
         tattooMerge();
      }
      
      public function champCocksuckerTattoo(param1:int) : void
      {
         clearOutput();
         whitneySprite();
         var _loc2_:String = "\"口交勇者\"刺在她的";
         if(param1 == 0)
         {
            collarboneIntro();
            outputText("[pg][say: 我哪还需要别人提醒这种事啊，[master]，]她低头看见那行如今刻在自己胸口、任谁都能看见的字，又恼又窘地笑着说道。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1129,_loc2_);
         }
         else if(param1 == 1)
         {
            shouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1130,_loc2_);
         }
         else if(param1 == 2)
         {
            lowerbackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1131,_loc2_);
         }
         else if(param1 == 3)
         {
            buttIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1132,_loc2_);
         }
         tattooMerge();
      }
      
      public function buttIntro() : void
      {
         outputText("你命令她趴到你的[legs]上，就像马上要挨一顿屁股似的。你这身形轻盈、赤裸的狗女孩照做了；当你把手指蘸进墨水，在她身体最柔软的部位仔细画下图案，再用纸封住墨迹时，她因自己这副尴尬姿势而发出的笑声也变成了一声尖促的咕鸣。");
         outputText("[pg][say:你画了什么，[master]？]她急切地问。你笑着自己欣赏了一会儿，然后说她得去问你的其他奴隶……还得指望他们说实话。[say:哎呀别这样，告诉我那是什么嘛！是下流话，对不对？[Master]，最好别是什么会让那些奴隶笑话我的东西。噢！]你俏皮地拍了一下她的新纹身。");
      }
      
      public function brandingMenu() : void
      {
         var _g:FarmCorruption;
         clearOutput();
         whitneySprite();
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1133) == 0)
         {
            outputText("你随意地揽住惠特尼，把她拉进怀里。在引导她走上这条探询之路前，你想先让她进入合适的心境。她炽热而沉重的呼吸扑在你的[chest]上，那双燃着欲望的眼睛怎么也无法从你眼中移开；你的手顺着她背部的曲线滑下，绕到她那紧实得令人愉悦的屁股上。你问她，对烙印了解多少。");
            outputText("[pg][say:俺可不给俺的畜群烙印，[master]，]她低声说道。与此同时，你的手向上抚去，手指滑进她的裙底。[say:那是很残酷的做法，而且这附近也没有别的农场，根本没那个必要。]但她肯定知道给牲口做标记的方法吧，你继续说道。那些能让人一眼看出它们归谁所有的方法。你在某些词上加重了不太含蓄的语气，同时触碰着她湿透的小穴，轻而易举地探入两根手指。[say:兴许……兴许俺知道，[master]，]这位犬女呻吟起来，随着你的手指在她温热湿润的内里动作，她的呼吸变成一阵阵急促的喘息与嘶声。[say:有些东西……俺爷爷那会儿留下来的东西。要是你给俺500颗宝石，再给俺点时间，俺可以……去安排点事情……]");
            menu();
            if(get_player().get_gems() >= 500)
            {
               addButton(0,"就这么办",getBrandingStuff);
            }
            else
            {
               addButton(0,"就这么办",dontGetBrandingStuff);
            }
            addButton(1,"不要",dontGetBrandingStuff);
         }
         else
         {
            clearOutput();
            outputText("你的思绪转向了存放在谷仓里的那套纹身工具，以及其中精妙的魔法。你咧嘴一笑，开始考虑要召来谁打上烙印。");
            if(get_player().get_gems() < 50)
            {
               outputText("[pg]<b>你没有足够的宝石为任何一个奴隶购置新的烙印。</b>");
            }
            menu();
            if(get_player().get_gems() >= 50)
            {
               if(hasFreeTattooSlot("whitney"))
               {
                  addButton(0,"惠特尼",brandWhitney);
               }
               if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1079) == 1 && hasFreeTattooSlot("amily"))
               {
                  addButton(1,"艾米莉",brandAmily);
               }
               if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1080) == 1 && hasFreeTattooSlot("jojo"))
               {
                  addButton(2,"乔乔",brandJojo);
               }
               if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1081) == 1 && get_game().sophieBimbo.bimboSophie() && hasFreeTattooSlot("sophie"))
               {
                  addButton(3,"索菲",brandBimboSophie);
               }
               if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1084) == 1 && hasFreeTattooSlot("vapula"))
               {
                  addButton(4,"瓦普拉",brandVapula);
               }
               if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,725) >= 4 && hasFreeTattooSlot("kelly"))
               {
                  addButton(5,"凯莉",brandKelly);
               }
               if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1089) == 1 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,870) > 0 && hasFreeTattooSlot("milky"))
               {
                  addButton(6,get_game().milkWaifu.get_milkName(),brandSmallMilky);
               }
               if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1089) == 1 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,870) == 0 && hasFreeTattooSlot("milky"))
               {
                  addButton(6,get_game().milkWaifu.get_milkName(),brandBigMilky);
               }
            }
            _g = this;
            addButton(14,"返回",function():void
            {
               _g.dogeCorruptedMissionComplete();
            });
         }
      }
      
      public function brandingAvailableTalk() : void
      {
         clearOutput();
         whitneySprite();
         outputText("[say: [Master]！[Master]，你吩咐的事我办好了，]惠特尼说道。你走近时，她的尾巴正疯狂摇晃着。她眼中闪着欣喜，身边还用绳子牵着一头母牛。你坐定看着她拿出几只不起眼的黑红墨水罐，以及一叠看起来像吸墨纸的东西。");
         outputText("[pg][say: 还以为早就没人卖这玩意儿了呢，]她一边摇头说道，一边拔开一个小瓶的塞子。一股刺鼻的溶剂气味钻进你的鼻腔。[say: 不过在那集市地方，真是什么都能找着，不是吗？看好了。]她把一根长长的");
         if(whitneyDefurred() || get_noFur())
         {
            outputText("指甲");
         }
         else
         {
            outputText("爪尖");
         }
         outputText("伸进罐子里，抽出来时滴着黑色液体，然后按在母牛丰满的屁股上。那动物哞叫一声，甩了甩尾巴，算是轻微抗议，但惠特尼的手指移动时，它似乎并没有承受什么剧痛；她娴熟地用墨水描出一个大大的数字12。");
         outputText("[pg][say: 然后拿些纸按上去，把它封住……就像这样……]惠特尼用白纸盖住12时，传来一阵轻微的嘶嘶声，不过那头母牛似乎仍然几乎没有察觉。等她把纸揭下来，她示意你亲自看看。这大概是你第一次，也希望是最后一次，如此仔细地检查一头牛的屁股；但眼前所见实在让你不得不佩服——那个数字已经干了，而且显然深深嵌进厚实的肉里，你自己试着去擦，也没法轻易擦掉。这完全符合你的目的。");
         outputText("[pg][say: 只要你知道自己想要什么，手指也挪得够仔细，就能把任何东西纹在任何东西上，]惠特尼说道。[say: 这可比烙印容易多了，而且是能维持好多好多年的魔法。]她顿了顿，带着狡黠又心领神会的笑容看着你。[say: 也许你想亲自试试看，[master]？]");
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1135,0);
         menu();
         addButton(0,"是",testBranding);
         addButton(1,"否",dontTestBranding);
      }
      
      public function brandWhitney() : void
      {
         clearOutput();
         whitneySprite();
         outputText("惠特尼很清楚，当你走向她藏放你那些\"烙印\"工具的谷仓时意味着什么；等你回来时，这位狗女孩已经迫不及待地脱光了。你拿起几罐墨水，思索着该把什么纹在她身上的哪个部位。");
         var _loc1_:Player = get_player();
         _loc1_.set_gems(_loc1_.get_gems() - 50);
         showStats();
         brandSlotSelect();
      }
      
      public function brandVapula() : void
      {
         outputText("你从谷仓里取来几罐墨水和纸，微笑着告诉你的魅魔，你要给她一份奖励。");
         outputText("[pg][say: 那是什么东西，[name]？]她盯着你的工具说道。[say: 纹身用具？哇，真够粗糙的。你知道莉希丝手下有些艺术家，他们的笔能让你感受到画在身上的任何东西，所以……]你说你才不在乎莉希丝有什么，你现在就在这儿，而且要在她身上刺上你喜欢的东西。");
         outputText("[pg][say: 呵呵，我就喜欢你这么强硬的样子，[master]，]瓦普拉低声轻哼。她挑衅地眯起眼看着你。[say: 那就奖励我吧。我可是一直都乖得不得了呢。]");
         outputText("[pg]你开始考虑要在她身上哪里、刺些什么。");
         var _loc1_:Player = get_player();
         _loc1_.set_gems(_loc1_.get_gems() - 50);
         showStats();
         vapulaSlotSelect();
      }
      
      public function brandSmallMilky() : void
      {
         outputText("你从谷仓里取来几罐墨水和纸，和蔼地微笑着告诉你的前沙漠女巫奴隶，你要给她一份奖励。");
         outputText("[pg][bathgirlName]不安地看着你的纹身工具。");
         outputText("[pg][say: 皮肤上的图画？好、好吧，我想可以。]她笑了一下，打破了自己那副脆弱的若无其事。[say: 我一直挺喜欢蝴蝶的——在沙漠里很少见到它们。如果你要画点什么的话，也许可以……？]");
         var _loc1_:Player = get_player();
         _loc1_.set_gems(_loc1_.get_gems() - 50);
         showStats();
         smallMilkySlotSelect();
      }
      
      public function brandSlotSelect() : void
      {
         slotSelectMenu("whitney",brandSelect);
      }
      
      public function brandSelect(param1:int) : void
      {
         var slot6:int;
         var _g5:FarmCorruption;
         var slot5:int;
         var _g4:FarmCorruption;
         var slot4:int;
         var _g3:FarmCorruption;
         var slot3:int;
         var _g2:FarmCorruption;
         var slot2:int;
         var _g1:FarmCorruption;
         var slot1:int;
         var _g:FarmCorruption;
         clearOutput();
         whitneySprite();
         outputText("你要在她的" + slotNames[param1] + "上画什么？");
         menu();
         _g = this;
         slot1 = param1;
         addButton(0,"部落图腾",function():void
         {
            _g.tribalTattoo(slot1);
         });
         _g1 = this;
         slot2 = param1;
         addButton(1,"爱心",function():void
         {
            _g1.heartTattoo(slot2);
         });
         _g2 = this;
         slot3 = param1;
         addButton(2,"归属于",function():void
         {
            _g2.propertyTattoo(slot3);
         });
         _g3 = this;
         slot4 = param1;
         addButton(3,"头号母狗",function():void
         {
            _g3.no1Tattoo(slot4);
         });
         if(get_player().hasCock() && whitneyMaxedOralTraining())
         {
            _g4 = this;
            slot5 = param1;
            addButton(4,"吮屌高手",function():void
            {
               _g4.champCocksuckerTattoo(slot5);
            });
         }
         if(get_player().hasVagina() && whitneyMaxedOralTraining())
         {
            _g5 = this;
            slot6 = param1;
            addButton(5,"舔穴高手",function():void
            {
               _g5.champPussylickerTattoo(slot6);
            });
         }
         addButton(14,"返回",brandSlotSelect);
      }
      
      public function brandKelly() : void
      {
         outputText("你从谷仓里取来几罐墨水和纸，笑着告诉你的半人马精盆，你要给她一份奖励。");
         outputText("[pg][say: 好的，]她温顺地说道，睁着一双绿色大眼睛看着你手里的东西。[say: 不会疼吧？]你温柔地告诉她，就像你干她屁眼时一样，最初的疼痛最终都会因为随之而来的满足而变得无比值得。她脸颊泛起红晕，而你则开始考虑要在她身上哪里、刺些什么。");
         var _loc1_:Player = get_player();
         _loc1_.set_gems(_loc1_.get_gems() - 50);
         showStats();
         kellySlotSelect();
      }
      
      public function brandJojo() : void
      {
         clearOutput();
         outputText("你从谷仓里取来几罐墨水和纸，笑容灿烂地告诉你的宠物鼠，你要给他一份特别的奖励。乔乔太清楚你的奖励都是什么性质了。他闭上眼，等着最糟的情况发生，而你则开始考虑要在他身上哪里、弄些什么。");
         var _loc1_:Player = get_player();
         _loc1_.set_gems(_loc1_.get_gems() - 50);
         showStats();
         jojoBrandSlotSelect();
      }
      
      public function brandBimboSophie() : void
      {
         clearOutput();
         outputText("你从谷仓里取来几罐墨水和纸，微笑着告诉你的宠物鹰身女妖，你要给她一份奖励。");
         if(!hasTattoo("sophie"))
         {
            outputText("[pg][say: 哇哦，好酷，一个纹身工具包！]她兴奋地说道，目光立刻黏在了你手里拿着的东西上。[say: 你从哪儿弄来的，宝贝？我到处都在找这种东西呢。]她到底怎么可能……？你开始怀疑，傻妞利口酒里蕴含的魔法比你原本以为的还要深奥。");
            outputText("[pg]你摇了摇头，开始考虑要在她身上哪里、刺些什么。");
         }
         else
         {
            outputText("[pg][say: 更多超性感纹身吗，[name]？]鹰身女妖眉开眼笑。[say: 太棒了！]");
            outputText("[pg]你摇了摇头，开始考虑要在她身上哪里、刺些什么。");
         }
         var _loc1_:Player = get_player();
         _loc1_.set_gems(_loc1_.get_gems() - 50);
         showStats();
         bimboSophieSlotSelect();
      }
      
      public function brandBigMilky() : void
      {
         outputText("你从谷仓里取来几罐墨水和纸，和蔼地微笑着告诉你的前沙漠女巫奴隶，你要给她一份奖励。");
         outputText("[pg][bathgirlName]抬眼望着你眨了眨眼，随后皱起眉头，认真思索起来。");
         outputText("[pg][say: 洗澡时间？]她最后回答道。");
         var _loc1_:Player = get_player();
         _loc1_.set_gems(_loc1_.get_gems() - 50);
         showStats();
         bigMilkySlotSelect();
      }
      
      public function brandAmily() : void
      {
         clearOutput();
         outputText("你从谷仓取来几罐墨水和纸，微笑着告诉你的宠物鼠，你要给她一个奖励。");
         outputText("[pg][say:太让人兴奋了！]她吱吱叫道。[saystart]是你的");
         if(get_player().hasCock())
         {
            outputText("鸡巴");
         }
         else if(get_player().hasVagina())
         {
            outputText("小穴");
         }
         else
         {
            outputText("身体");
         }
         outputText("，[master]？那可是我最喜欢的奖励。[sayend] 你开始考虑要在她身上哪里、弄些什么。");
         var _loc1_:Player = get_player();
         _loc1_.set_gems(_loc1_.get_gems() - 50);
         showStats();
         amilyBrandSlotSelect();
      }
      
      public function bimboSophieWideLoadTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"宽大\"刺在一边屁股蛋上，\"装货\"刺在另一边。";
         bimboSophieButtIntro();
         FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1148,_loc2_);
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function bimboSophieTribalTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "一片部落风纹身，尽是蜿蜒而色情的线条，横跨她的";
         if(param1 == 0)
         {
            bimboSophieCollarboneIntro();
            outputText("[pg][say: 哇，]她看着你的画作，惊叹地说道。[say: 你也太有艺术细胞了吧，[name]，真漂亮！你还会继续在我身上画的，对吧？]你笑着告诉她，也许吧，只要她乖乖听惠特尼女主人的话，多给你下些蛋。鹰身女妖美丽的脸上浮现出无比坚定的神情。");
            outputText("[pg][say: 要是这样就能有更多超性感的纹身，我一定会拼尽全力的，宝贝！]");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1145,_loc2_);
         }
         else if(param1 == 1)
         {
            bimboSophieShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1146,_loc2_);
         }
         else if(param1 == 2)
         {
            bimboSophieLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1147,_loc2_);
         }
         else if(param1 == 3)
         {
            bimboSophieButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1148,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function bimboSophieSwallowTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "一只展着尖长双翼飞翔的燕子，纹在她的";
         if(param1 == 0)
         {
            bimboSophieCollarboneIntro();
            outputText("[pg][say: 哇，]她看着你的画作，惊叹地说道。[say: 你也太有艺术细胞了吧，[name]，真漂亮！你还会继续在我身上画的，对吧？]你笑着告诉她，也许吧，只要她乖乖听惠特尼女主人的话，多给你下些蛋。鹰身女妖美丽的脸上浮现出无比坚定的神情。");
            outputText("[pg][say: 要是这样就能有更多超性感的纹身，我一定会拼尽全力的，宝贝！]");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1145,_loc2_);
         }
         else if(param1 == 1)
         {
            bimboSophieShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1146,_loc2_);
         }
         else if(param1 == 2)
         {
            bimboSophieLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1147,_loc2_);
         }
         else if(param1 == 3)
         {
            bimboSophieButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1148,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function bimboSophieSlotSelect() : void
      {
         slotSelectMenu("sophie",bimboSophieBrandSelect);
      }
      
      public function bimboSophieShouldersIntro() : void
      {
         outputText("你命令她背对着你跪下，不许乱动。要让她老实待着并不容易，但当你终于把蘸满墨水的手指落在她金色的双翼之间时，她便进入了近乎恍惚的状态，被你手指的动作迷住，直到你把纸覆在画好的图案上，将墨水封住。");
         outputText("[pg][say: 您画了什么？]她兴奋地说着，转过身来。[say: 我能看看吗？]她又转了一圈。她摸了摸肩胛骨之间，覆着羽毛的眉头皱了起来。她又转了一圈……");
         outputText("[pg]你任由她自己琢磨去了。");
      }
      
      public function bimboSophiePropertyOfTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"[Name]的所有物\"纹在她的";
         if(param1 == 0)
         {
            bimboSophieCollarboneIntro();
            outputText("[pg][say: F……]她低头看着，念出声来。[say: Fa……等等。那是个 p 吗？P……pro……不对，我真笨！那是 R。Ro……]");
            outputText("[pg]你任由她自己琢磨去了。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1145,_loc2_);
         }
         else if(param1 == 1)
         {
            bimboSophieShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1146,_loc2_);
         }
         else if(param1 == 2)
         {
            bimboSophieLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1147,_loc2_);
         }
         else if(param1 == 3)
         {
            bimboSophieButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1148,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function bimboSophieLowerBackIntro() : void
      {
         outputText("你命令她脸朝下趴在你的[legs]上，就像马上要挨一顿屁股似的。她很难安分下来，因为这个尴尬姿势一边咕咕叫一边笑得发抖。直到你把蘸满墨水的手指按到她身上，她才终于陷入恍惚般的状态，被你手指的移动迷住；等你把纸覆在画好的图案上，将墨水封住时，她还没回过神。");
         outputText("[pg][say:你画了什么？]她兴奋地说着，转过身来。[say:我能看看吗？]她又转了一圈。她羽毛般的眉头皱了起来，伸手摸向自己的后腰。她又转了一圈……");
         outputText("[pg]你任由她自己琢磨去了。");
      }
      
      public function bimboSophieHeartTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "一枚饱满的红色爱心纹身，位于她的";
         if(param1 == 0)
         {
            bimboSophieCollarboneIntro();
            outputText("[pg][say: 哇，]她看着你的画作，惊叹地说道。[say: 你也太有艺术细胞了吧，[name]，真漂亮！你还会继续在我身上画的，对吧？]你笑着告诉她，也许吧，只要她乖乖听惠特尼女主人的话，多给你下些蛋。鹰身女妖美丽的脸上浮现出无比坚定的神情。");
            outputText("[pg][say: 要是这样就能有更多超性感的纹身，我一定会拼尽全力的，宝贝！]");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1145,_loc2_);
         }
         else if(param1 == 1)
         {
            bimboSophieShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1146,_loc2_);
         }
         else if(param1 == 2)
         {
            bimboSophieLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1147,_loc2_);
         }
         else if(param1 == 3)
         {
            bimboSophieButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1148,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function bimboSophieCollarboneIntro() : void
      {
         outputText("你命令她跪在你面前，一动也别动。要让她老老实实待着并不容易，但当你终于把浸满墨水的手指按到她身上时，她便陷入了恍惚般的状态，被你手指的动作迷住了。直到你把纸覆在画好的图案上，将墨水封定下来。");
      }
      
      public function bimboSophieCockGoesHereTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"鸡巴插这里\"刺在她的后腰上。";
         bimboSophieLowerBackIntro();
         FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1147,_loc2_);
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function bimboSophieButtIntro() : void
      {
         outputText("你命令她脸朝下趴在你的[legs]上，就像马上要挨一顿屁股似的。她很难安分下来，因为这个尴尬姿势一边咕咕叫一边笑得发抖。直到你把蘸满墨水的手指按到她身上，她才终于陷入恍惚般的状态，被你手指的移动迷住；等你把纸覆在画好的图案上，将墨水封住时，她还没回过神。你确实给自己找了一大片画布，只是这画布显然晃得厉害。");
         outputText("[pg][say:你画了什么？]她兴奋地说着，转过身来。[say:我能看看吗？]她又转了一圈。她羽毛般的眉头皱了起来，伸手摸向自己的屁股。她又转起身来……");
         outputText("[pg]你任由她自己琢磨去了。");
      }
      
      public function bimboSophieBreedingBitchTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"繁殖母狗\"刺在她的";
         if(param1 == 0)
         {
            bimboSophieCollarboneIntro();
            outputText("[pg][say: 哇，]她看着你的画作，惊叹地说道。[say: 你也太有艺术细胞了吧，[name]，真漂亮！你还会继续在我身上画的，对吧？]你笑着告诉她，也许吧，只要她乖乖听惠特尼女主人的话，多给你下些蛋。鹰身女妖美丽的脸上浮现出无比坚定的神情。");
            outputText("[pg][say: 要是这样就能有更多超性感的纹身，我一定会拼尽全力的，宝贝！]");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1145,_loc2_);
         }
         else if(param1 == 1)
         {
            bimboSophieShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1146,_loc2_);
         }
         else if(param1 == 2)
         {
            bimboSophieLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1147,_loc2_);
         }
         else if(param1 == 3)
         {
            bimboSophieButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1148,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function bimboSophieBrandSelect(param1:int) : void
      {
         var slot7:int;
         var _g6:FarmCorruption;
         var slot6:int;
         var _g5:FarmCorruption;
         var slot5:int;
         var _g4:FarmCorruption;
         var slot4:int;
         var _g3:FarmCorruption;
         var slot3:int;
         var _g2:FarmCorruption;
         var slot2:int;
         var _g1:FarmCorruption;
         var slot1:int;
         var _g:FarmCorruption;
         clearOutput();
         outputText("你要在她的" + slotNames[param1] + "上画什么？");
         menu();
         _g = this;
         slot1 = param1;
         addButton(0,"部落纹",function():void
         {
            _g.bimboSophieTribalTattoo(slot1);
         });
         _g1 = this;
         slot2 = param1;
         addButton(1,"爱心",function():void
         {
            _g1.bimboSophieHeartTattoo(slot2);
         });
         _g2 = this;
         slot3 = param1;
         addButton(2,"吞精",function():void
         {
            _g2.bimboSophieSwallowTattoo(slot3);
         });
         _g3 = this;
         slot4 = param1;
         addButton(3,"归属",function():void
         {
            _g3.bimboSophiePropertyOfTattoo(slot4);
         });
         _g4 = this;
         slot5 = param1;
         addButton(4,"配种母狗",function():void
         {
            _g4.bimboSophieBreedingBitchTattoo(slot5);
         });
         if(param1 == 3)
         {
            _g5 = this;
            slot6 = param1;
            addButton(5,"超宽载荷",function():void
            {
               _g5.bimboSophieWideLoadTattoo(slot6);
            });
         }
         if(get_player().hasCock() && param1 == 2)
         {
            _g6 = this;
            slot7 = param1;
            addButton(6,"鸡巴插这里",function():void
            {
               _g6.bimboSophieCockGoesHereTattoo(slot7);
            });
         }
         addButton(14,"返回",bimboSophieSlotSelect);
      }
      
      public function bigMilkyTribalTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "一片部落风纹身，尽是蜿蜒而色情的线条，横跨她的";
         if(param1 == 0)
         {
            bigMilkyCollarboneIntro();
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1157,_loc2_);
         }
         else if(param1 == 1)
         {
            bigMilkyShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1158,_loc2_);
         }
         else if(param1 == 2)
         {
            bigMilkyLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1159,_loc2_);
         }
         else if(param1 == 3)
         {
            bigMilkyButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1160,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function bigMilkySlotSelect() : void
      {
         slotSelectMenu("milky",bigMilkyBrandSelect);
      }
      
      public function bigMilkyShouldersIntro() : void
      {
         outputText("你在[bathgirlName]身后坐下，把手指蘸进墨水，在她身上仔细画下图案，然后用纸封住墨迹。她似乎几乎没有注意到。");
         outputText("[pg][say: 到洗澡时间了吗？]");
         outputText("[pg][say: 快了，]你一边温和地回答，一边转身去把烙印工具放回去。");
      }
      
      public function bigMilkyPropertyOfTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"[Name]的所有物\"纹在她的";
         if(param1 == 0)
         {
            bigMilkyCollarboneIntro();
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1157,_loc2_);
         }
         else if(param1 == 1)
         {
            bigMilkyShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1158,_loc2_);
         }
         else if(param1 == 2)
         {
            bigMilkyLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1159,_loc2_);
         }
         else if(param1 == 3)
         {
            bigMilkyButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1160,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function bigMilkyMegaMilkTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"超大奶量\"纹在她的锁骨上。";
         bigMilkyCollarboneIntro();
         FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1157,_loc2_);
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function bigMilkyLowerBackIntro() : void
      {
         outputText("你在[bathgirlName]身后坐下，把手指蘸进墨水，在她身上仔细画下图案，然后用纸封住墨迹。她似乎几乎没有注意到。");
         outputText("[pg][say: 到洗澡时间了吗？]");
         outputText("[pg][say: 快了，]你一边温和地回答，一边转身去把烙印工具放回去。");
      }
      
      public function bigMilkyHeartTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "一枚饱满的红色爱心纹身，位于她的";
         if(param1 == 0)
         {
            bigMilkyCollarboneIntro();
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1157,_loc2_);
         }
         else if(param1 == 1)
         {
            bigMilkyShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1158,_loc2_);
         }
         else if(param1 == 2)
         {
            bigMilkyLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1159,_loc2_);
         }
         else if(param1 == 3)
         {
            bigMilkyButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1160,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function bigMilkyCollarboneIntro() : void
      {
         outputText("[pg]要够到[bathgirlName]身上这个部位可不容易，但你还是设法绕过她那对巨大的奶子，开始动手。你把手指蘸进墨水，小心翼翼地在她皮肤上画下图案，然后用纸将其封定。那名前沙漠女巫奴隶朦胧地低头望着你画下的东西，手指轻轻抚过上面。");
         outputText("[pg][say: 到洗澡时间了吗？]");
         outputText("[pg][say: 快了，]你一边温和地回答，一边转身去把烙印工具放回去。");
      }
      
      public function bigMilkyCockCozyTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"肉棒暖套\"纹在她的锁骨上。";
         bigMilkyCollarboneIntro();
         FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1157,_loc2_);
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function bigMilkyButtIntro() : void
      {
         outputText("你在[bathgirlName]身后坐下，把手指蘸进墨水，在她圆润漂亮的屁股上仔细画下图案，然后用纸封印上去。她几乎像是没有注意到一样。");
         outputText("[pg][say: 到洗澡时间了吗？]");
         outputText("[pg][say: 快了，]你一边温和地回答，一边转身去把烙印工具放回去。");
      }
      
      public function bigMilkyBrandSelect(param1:int) : void
      {
         var slot6:int;
         var _g5:FarmCorruption;
         var slot5:int;
         var _g4:FarmCorruption;
         var slot4:int;
         var _g3:FarmCorruption;
         var slot3:int;
         var _g2:FarmCorruption;
         var slot2:int;
         var _g1:FarmCorruption;
         var slot1:int;
         var _g:FarmCorruption;
         clearOutput();
         outputText("你要在她的" + slotNames[param1] + "上画什么？");
         menu();
         _g = this;
         slot1 = param1;
         addButton(0,"部落纹",function():void
         {
            _g.bigMilkyTribalTattoo(slot1);
         });
         _g1 = this;
         slot2 = param1;
         addButton(1,"爱心",function():void
         {
            _g1.bigMilkyHeartTattoo(slot2);
         });
         _g2 = this;
         slot3 = param1;
         addButton(2,"所属物",function():void
         {
            _g2.bigMilkyPropertyOfTattoo(slot3);
         });
         _g3 = this;
         slot4 = param1;
         addButton(3,"沐浴玩具",function():void
         {
            _g3.bigMilkyBathToyTattoo(slot4);
         });
         if(param1 == 0)
         {
            _g4 = this;
            slot5 = param1;
            addButton(4,"超大奶量",function():void
            {
               _g4.bigMilkyMegaMilkTattoo(slot5);
            });
         }
         if(param1 == 0 && get_player().hasCock())
         {
            _g5 = this;
            slot6 = param1;
            addButton(5,"肉棒暖套",function():void
            {
               _g5.bigMilkyCockCozyTattoo(slot6);
            });
         }
         addButton(14,"返回",bigMilkySlotSelect);
      }
      
      public function bigMilkyBathToyTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"沐浴玩具\"纹在她的";
         if(param1 == 0)
         {
            bigMilkyCollarboneIntro();
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1157,_loc2_);
         }
         else if(param1 == 1)
         {
            bigMilkyShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1158,_loc2_);
         }
         else if(param1 == 2)
         {
            bigMilkyLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1159,_loc2_);
         }
         else if(param1 == 3)
         {
            bigMilkyButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1160,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function availableInvestments() : Boolean
      {
         if(!get_player().hasKeyItem("Breast Milker - Installed At Whitney\'s Farm") && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1124) == 0)
         {
            return true;
         }
         if(!get_player().hasKeyItem("Cock Milker - Installed At Whitney\'s Farm") && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1125) == 0)
         {
            return true;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1094) == 0 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1126) == 0)
         {
            return true;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1109) == 0 && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1127) == 0)
         {
            return true;
         }
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1123) == 0 && get_game().milkWaifu.milkSlave() && FlagDict_Impl_.arrayReadInt(KFLAGS.flags,1128) == 0)
         {
            return true;
         }
         return false;
      }
      
      public function amilyTribalTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "一片部落风纹身，尽是蜿蜒而色情的线条，横跨她的";
         if(param1 == 0)
         {
            amilyCollarboneIntro();
            outputText("[pg][say: 这样会让我在你眼里更漂亮吗，[master]？]她一边赞叹地抚摸着你画下的东西，一边说道。[say: 如果会的话……那这正是我想要的。]");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1137,_loc2_);
         }
         else if(param1 == 1)
         {
            amilyShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1138,_loc2_);
         }
         else if(param1 == 2)
         {
            amilyLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1139,_loc2_);
         }
         else if(param1 == 3)
         {
            amilyButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1140,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function amilyShouldersIntro() : void
      {
         outputText("你命令她背对着你跪下，不许乱动。你的魅魔鼠女照做了，一动不动地待着；你把手指蘸进墨水，小心地在她身上画下图案，然后用纸将其封上。");
         outputText("[pg][say: 您画了什么，[master]？]她急切地问。你笑着自己欣赏了一番，然后说她得去问你其他奴隶……还得希望她们说的是实话。[say: 哎呀，[master]，您明知道她们只会骗我，说是什么“配种母狗”之类的。拜托，告诉我嘛！]");
      }
      
      public function amilyPropertyTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"[Name]的所有物\"纹在她的";
         if(param1 == 0)
         {
            amilyCollarboneIntro();
            outputText("[pg][say: 我哪还需要别人提醒这种事啊，[master]，]她低头看见那行如今刻在自己裸露胸口、任谁都能看见的字，开心地笑着说道。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1137,_loc2_);
         }
         else if(param1 == 1)
         {
            amilyShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1138,_loc2_);
         }
         else if(param1 == 2)
         {
            amilyLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1139,_loc2_);
         }
         else if(param1 == 3)
         {
            amilyButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1140,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function amilyMommysGirlTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"妈咪的女孩\"纹在她的";
         if(param1 == 0)
         {
            amilyCollarboneIntro();
            outputText("[pg][say: 我哪还需要别人提醒这种事啊，[master]，]她低头看见那行如今刻在自己裸露胸口、任谁都能看见的字，开心地笑着说道。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1137,_loc2_);
         }
         else if(param1 == 1)
         {
            amilyShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1138,_loc2_);
         }
         else if(param1 == 2)
         {
            amilyLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1139,_loc2_);
         }
         else if(param1 == 3)
         {
            amilyButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1140,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function amilyLowerBackIntro() : void
      {
         outputText("你命令她脸朝下横趴在你的[legs]上，像是正要挨一顿打屁股。你的魅魔鼠女照做了，她因自己这副难堪的姿势而咯咯笑着；当你把手指蘸进墨水、小心地在她身上画下图案时，笑声变成了一声尖促的低哼，随后你用纸将其封上。");
         outputText("[pg][say: 您画了什么，[master]？]她急切地问。你笑着自己欣赏了一番，然后说她得去问你其他奴隶……还得希望她们说的是实话。[say: 哎呀，[master]，您明知道她们只会骗我，说是什么“配种母狗”之类的。拜托，告诉我嘛！]");
      }
      
      public function amilyHeartTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "一枚饱满的红色爱心纹身，位于她的";
         if(param1 == 0)
         {
            amilyCollarboneIntro();
            outputText("[pg][say: 这样会让我在你眼里更漂亮吗，[master]？]她一边赞叹地抚摸着你画下的东西，一边说道。[say: 如果会的话……那这正是我想要的。]");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1137,_loc2_);
         }
         else if(param1 == 1)
         {
            amilyShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1138,_loc2_);
         }
         else if(param1 == 2)
         {
            amilyLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1139,_loc2_);
         }
         else if(param1 == 3)
         {
            amilyButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1140,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function amilyFullTribalTats() : Boolean
      {
         if(numAmilyTribalTats() == 4)
         {
            return true;
         }
         return false;
      }
      
      public function amilyCollarboneIntro() : void
      {
         outputText("你命令她跪在你面前，一动也别动。那只魅魔鼠娘照做了，安安静静地保持不动。你把手指蘸进墨水，小心翼翼地在她身上画下图案，然后用纸将其封定。");
      }
      
      public function amilyCockGoesHereTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"鸡巴插这里\"刺在她的";
         if(param1 == 0)
         {
            amilyCollarboneIntro();
            outputText("[pg][say: 我哪还需要别人提醒这种事啊，[master]，]她低头看见那行如今刻在自己裸露胸口、任谁都能看见的字，开心地笑着说道。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1137,_loc2_);
         }
         else if(param1 == 1)
         {
            amilyShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1138,_loc2_);
         }
         else if(param1 == 2)
         {
            amilyLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1139,_loc2_);
         }
         else if(param1 == 3)
         {
            amilyButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1140,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function amilyButtIntro() : void
      {
         outputText("你命令她脸朝下趴在你的[legs]上，就像马上要挨一顿屁股似的。你的鼠魅魔照做了；当你把手指蘸进墨水，在她身体最柔软的部位仔细画下图案，再用纸封住墨迹时，她因自己这副尴尬姿势而发出的笑声也变成了一声尖促的咕鸣。");
         outputText("[pg][say:你画了什么，[master]？]她急切地问。你笑着自己欣赏了一会儿，然后说她得去问你的其他奴隶……还得指望他们说实话。[say:哎呀，[master]，你知道她们只会撒谎，说是什么“配种母狗”之类的东西。拜托，告诉我嘛！噢！]你一边欣赏盖在纹身上的红色手印，一边心想，这纹身肯定相当诱人。");
      }
      
      public function amilyBreedingBitchTattoo(param1:int) : void
      {
         clearOutput();
         var _loc2_:String = "\"繁殖母狗\"刺在她的";
         if(param1 == 0)
         {
            amilyCollarboneIntro();
            outputText("[pg][say: 我哪还需要别人提醒这种事啊，[master]，]她低头看见那行如今刻在自己裸露胸口、任谁都能看见的字，开心地笑着说道。");
            _loc2_ += "collarbone.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1137,_loc2_);
         }
         else if(param1 == 1)
         {
            amilyShouldersIntro();
            _loc2_ += "shoulders.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1138,_loc2_);
         }
         else if(param1 == 2)
         {
            amilyLowerBackIntro();
            _loc2_ += "腰背下方。";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1139,_loc2_);
         }
         else if(param1 == 3)
         {
            amilyButtIntro();
            _loc2_ += "butt.";
            FlagDict_Impl_.arrayWriteString(KFLAGS.flags,1140,_loc2_);
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function amilyBrandSlotSelect() : void
      {
         slotSelectMenu("amily",amilyBrandSelect);
      }
      
      public function amilyBrandSelect(param1:int) : void
      {
         var slot6:int;
         var _g5:FarmCorruption;
         var slot5:int;
         var _g4:FarmCorruption;
         var slot4:int;
         var _g3:FarmCorruption;
         var slot3:int;
         var _g2:FarmCorruption;
         var slot2:int;
         var _g1:FarmCorruption;
         var slot1:int;
         var _g:FarmCorruption;
         clearOutput();
         outputText("你要在她的" + slotNames[param1] + "上画什么？");
         menu();
         _g = this;
         slot1 = param1;
         addButton(0,"部落图腾",function():void
         {
            _g.amilyTribalTattoo(slot1);
         });
         _g1 = this;
         slot2 = param1;
         addButton(1,"爱心",function():void
         {
            _g1.amilyHeartTattoo(slot2);
         });
         _g2 = this;
         slot3 = param1;
         addButton(2,"归属于",function():void
         {
            _g2.amilyPropertyTattoo(slot3);
         });
         _g3 = this;
         slot4 = param1;
         addButton(3,"配种母狗",function():void
         {
            _g3.amilyBreedingBitchTattoo(slot4);
         });
         if(get_player().hasCock() && param1 == 2)
         {
            _g4 = this;
            slot5 = param1;
            addButton(4,"鸡巴插这里",function():void
            {
               _g4.amilyCockGoesHereTattoo(slot5);
            });
         }
         if(get_player().hasVagina())
         {
            _g5 = this;
            slot6 = param1;
            addButton(5,"妈妈的乖女儿",function():void
            {
               _g5.amilyMommysGirlTattoo(slot6);
            });
         }
         addButton(14,"返回",amilyBrandSlotSelect);
      }
      
      public function afterTakeItems() : void
      {
         if(collectionAvailable())
         {
            collectTheGoodies();
         }
         else
         {
            rootScene();
         }
      }
   }
}

