package classes.scenes.monsters
{
   import classes.Appearance;
   import classes.BaseContent;
   import classes.CoC;
   import classes.Cock;
   import classes.CockTypesEnum;
   import classes.DynStat;
   import classes.ImageManager;
   import classes.Monster;
   import classes.PerkLib;
   import classes.Player;
   import classes.StatusEffects;
   import classes.Vagina;
   import classes._FlagDict.FlagDict_Impl_;
   import classes.display.SpriteDb;
   import classes.globalFlags.KFLAGS;
   import classes.internals.Utils;
   import classes.items.UseableLib;
   import classes.scenes.Camp;
   import classes.scenes.combat.Combat;
   import coc.view.CoCButton;
   import flash.Boot;
   import haxe.IMap;
   
   public class GoblinScene extends BaseContent
   {
      
      public var gobboSprite:Class;
      
      public function GoblinScene()
      {
         if(Boot.skip_constructor)
         {
            return;
         }
         gobboSprite = null;
         super();
      }
      
      public function rapeAGoblinCorruptTooBig() : void
      {
         var _loc1_:int = get_player().biggestCockIndex();
         clearOutput();
         spriteSelect(gobboSprite);
         get_images().showImage("goblin-win-male-corruptedfuck");
         outputText("你开始脱下你的[armor]，低头看着你那无助的、原本打算攻击你现在却即将成为你受害者的目标，饥渴地舔了舔嘴唇。你的[cocks]");
         if(get_player().cockTotal() == 1)
         {
            outputText("是");
         }
         else
         {
            outputText("都");
         }
         outputText("比她更清楚现在的状况，你弯下腰，剥去她身上那本就少得可怜的衣物。当你打量她时，");
         if(get_player().cockTotal() > 1)
         {
            outputText("你的一根[cocks]压在了她身上，而它");
         }
         else
         {
            outputText("你的" + get_player().cockDescript(_loc1_) + "压在了她身上，而它");
         }
         if(get_player().cocks[0].cockLength < 20)
         {
            outputText("几乎和她的整个躯干一样长");
         }
         else
         {
            outputText("比她整个人还要大");
         }
         outputText("，这让你产生了一个邪恶的想法。[pg]");
         outputText("你张开双腿坐在地上，抱着这个小地精婊子，让她那相对微小的缝隙抵在你的" + get_player().cockDescript(_loc1_) + "的顶端。她终于从恍惚中清醒过来，脸上闪过极度纠结的神情，对肉棒和精液的渴望与她的求生本能展开了交锋。就在理智即将崩溃的边缘，当她感觉到仅仅是你的" + get_player().cockDescript(_loc1_) + "的" + get_player().cockHead(_loc1_) + "开始撑开她的" + get_monster().vaginaDescript() + "所带来的疼痛时，那些本能突然重整旗鼓，击退了她的情欲。她拼尽全力想要反抗，但在你这样的钳制下，她所能做的不过是徒劳地挣扎，用脚蹬着你的" + get_player().cockDescript(_loc1_) + "，从她的视角来看，这简直就像是在爬一根树干。[pg]");
         outputText("你们俩都因为各自的努力而汗流浃背，你慢慢开始意识到，她疯狂的挣扎和她那紧致的" + get_monster().vaginaDescript() + "结合在一起，将阻止你进行你如此期待的插入。然而，当你开始考虑在她的喉咙里解决时，一股黑暗的力量涌动，另一个想法闪过你的脑海。[pg]");
         outputText("当地精感觉到你不再把她压在你的" + get_player().cockDescript(_loc1_) + "上时，她稍微放松了一点。当你把她的小穴凑到你的唇边并开始品尝时，她绝对兴奋极了。你的舌头在她的" + get_monster().vaginaDescript() + "内外游走，直到你把她隐藏的小阴蒂哄出来。你用嘴唇包裹住它，开始施展你的腐化之力。当你把这个地精荡妇推向高潮，用一种在恶魔军团之外罕见的专业技巧刺激她的阴蒂时，腐化的能量从你的舌头传导，穿过她的阴蒂，深入她的核心。当她尖叫着高潮时，你从她身上离开，欣赏着你恶魔般杰作的外在迹象。以前那个普通大小的爱之按钮已经肿胀了五倍，变成了一个骄傲、充血的阴蒂……而且你放大的不仅仅是这个。[pg]");
         outputText("你重新调整了你的性玩具的位置，让她现在背对着你，再次让你的" + get_player().cockDescript(_loc1_) + "接触她的" + get_monster().vaginaDescript() + "。她再次挣扎，但在高潮之后，她没有力气进行像样的反抗；现在她正在与不可避免的事情作斗争，她所有的抵抗只会让你更加兴奋。你开始把她压向自己。[pg]");
         outputText("[say: 太多了……]她虚弱地说。龟头的前端弹了进去。[pg]");
         outputText("[say: 你会杀了我……]她恳求道。剩下的龟头也跟着进去了。[pg]");
         outputText("[say: 停下……]她乞求着。肉棒开始沉入。[pg]");
         outputText("[say: 不要……]更多的肉棒进入了她娇小的身体。[pg]");
         outputText("[say: 求你……]她被填满了。[pg]");
         outputText("[say: 求你……]甚至超出了极限。[pg]");
         outputText("[say: ……操我。][pg]");
         outputText("你把你留在外面剩下的" + get_player().cockDescript(_loc1_) + "猛地插进你新命名的肉棒骑士体内。这足以让这个婊子高潮，而你甚至还没开始。你");
         if(get_player().cocks[0].cockLength < 20)
         {
            outputText("能感觉到她腹部巨大的凸起");
         }
         else
         {
            outputText("把她撑得太大了，即使从这个角度你也能看到凸起");
         }
         outputText("这让你的欲望更加高涨。你从洞里抽出的肉棒比你那渴望精液的荡妇的身体还要多，导致她的眼睛翻白，因为她的" + get_monster().vaginaDescript() + "紧紧夹住你，她又高潮了。每次你拔出或猛烈插入都会让她达到高潮，以至于当你们俩都四肢着地，像一对野生动物一样发情时，她只能躺在那里，张大嘴巴，几乎口吐白沫");
         if(get_player().biggestTitSize() >= 1)
         {
            outputText("，她的头靠在你的[breasts]之间");
            if(get_player().biggestLactation() >= 1)
            {
               outputText("当你的[nipple]");
               if(get_player().biggestLactation() < 2)
               {
                  outputText("偶尔滴下乳白色的眼泪到她的脸上");
               }
               if(get_player().biggestLactation() < 3)
               {
                  outputText("流下奶水到她的脸上");
               }
               else
               {
                  outputText("用大量的液体涂满她");
               }
            }
         }
         outputText("。她的头发被");
         if(get_player().biggestLactation() >= 1)
         {
            outputText("乳汁和");
         }
         outputText("你们俩的汗水，她唯一发出的声音就是每高潮几次后偶尔发出的狂喜的咕噜声。[pg]");
         outputText("[say: 好了，荡妇。你想要我的孩子？来。吃。精。吧！]你大喊道。然而，");
         if(get_player().hasVagina())
         {
            outputText("当你的" + get_player().vaginaDescript(0) + "");
            if(get_player().vaginas[0].vaginalWetness <= 3)
            {
               outputText("流出淫液");
            }
            else if(get_player().vaginas[0].vaginalWetness <= 4)
            {
               outputText("泛滥");
            }
            else
            {
               outputText("爆发");
            }
            if(get_player().cockTotal() > 1)
            {
               outputText("并且你其余的[cocks]将她淋透时，");
            }
         }
         else if(get_player().cockTotal() > 1)
         {
            outputText("当你其他的" + Appearance.cockNoun(CockTypesEnum.HUMAN));
            if(get_player().cockTotal() > 2)
            {
               outputText("将她淋透时，");
            }
            else
            {
               outputText("将她淋透时，");
            }
         }
         outputText("这婊子太紧了！简直就像个天然的屌环！");
         if(get_player().balls >= 2)
         {
            outputText("你的[balls]正在努力，但是，她");
         }
         else
         {
            outputText("她");
         }
         outputText("痉挛的" + get_monster().vaginaDescript() + "把你的" + get_player().cockDescript(_loc1_) + "夹得太紧，以至于根本射不出来。[pg]");
         outputText("高潮的瞬间过去了，你却感到欲求不满。你的精液容器连它唯一的职责都没尽到，这只会让你更加火大。然而，你并没有气馁。事实上，你加倍了努力。如果这个喜欢大肉棒的荡妇想在自己爽的同时剥夺你的发泄，好吧，下一回合你只能把她肏到失去意识了。[pg]");
         outputText("在接下来的几个小时里，你简直要把她那绿色小脑袋里的脑浆都肏出来了，让自己重新回到了爆发的边缘。你考虑过这次拔出来，但最终决定不这么做。至少要一次性射出两发的量；这会奏效的，而且这婊子也是罪有应得。[pg]");
         outputText("[say: 让我。们。再。来。一次！]你大喊着，把你们俩拉回坐姿，并让你们俩都弓起背。[pg]");
         outputText("你的" + get_player().cockDescript(_loc1_) + "紧紧地贴着她的皮肤，以至于你可以看到精液顺着你的肉棒向上涌出，仅仅第一发就把你的地精玩具给撑胀了。");
         if(get_player().cockTotal() > 2)
         {
            outputText("你剩下的[cocks]像间歇泉一样喷向空中，把你们俩都涂满了精液。");
         }
         if(get_player().cockTotal() == 2)
         {
            outputText("你剩下的阴茎向空中喷射出精液，将你们俩都涂满了白浊。");
         }
         outputText("正是之前阻止你射精的紧致感，现在确保了你射入她体内的大量精液在你拔出之前一滴也不会漏出来。幸好你的腐化如此有效，因为她现在看起来肚子大得像塞了个沙滩排球。[pg]");
         outputText("最后，你将最后一股精液射入这个新搞到手的骚货体内，把她从你的" + get_player().cockDescript(_loc1_) + "上推开，让她摔在地上。撞击让她体内的精液如洪流般涌出。[pg]");
         outputText("你站起身准备离开，低头看着刚被你干完的地精荡妇。[pg]");
         outputText("[say:希望我的女儿们比她们的婊子妈更好操，]你说。[say:告诉她们，如果她们也想被劈成两半，就来找我。]");
         outputText("[pg]她绝对会的。");
         get_player().orgasm("Dick");
         dynStats(DynStat.Cor(1));
         get_combat().cleanupAfterCombat();
      }
      
      public function manRapesGoblinTooBig() : void
      {
         clearOutput();
         get_images().showImage("goblin-win-male-corruptedbj");
         var _loc1_:int = get_player().biggestCockIndex();
         spriteSelect(gobboSprite);
         outputText("你掏出正在变硬的阴茎，向你的受害者展示它");
         if(get_player().cockArea(_loc1_) < 80)
         {
            outputText("几乎");
         }
         outputText("荒谬的尺寸。地精女孩震惊地看着眼前的景象，眼睛瞪得像餐盘一样大。知道你不管尺寸差异多大都会尝试，她张开双腿，让自己在地上躺得更舒服些。[pg]");
         outputText("你");
         if(get_player().cor < 50)
         {
            outputText("耸耸肩，觉得既然她准备好了，不妨试一试");
         }
         else
         {
            outputText("咧嘴一笑，很高兴能试着把她撑开");
         }
         outputText("。当你把" + get_player().cockDescript(_loc1_) + "的");
         if(get_player().cocks[0].get_cockType() == CockTypesEnum.HORSE)
         {
            outputText("龟头冠状沟");
         }
         else
         {
            outputText("龟头");
         }
         outputText("在她已经湿润的肉褶上摩擦时，它兴奋地明显跳动着。她在你身下扭动，显然很享受你顶着她穴口的感觉。你极其缓慢地向前推进，感觉她的身体被你的");
         if(get_player().cocks[0].get_cockType() == CockTypesEnum.HORSE)
         {
            outputText("龟头冠状沟");
         }
         else
         {
            outputText("龟头冠");
         }
         outputText("撑开，但在推进了一两下之后，那狭小的通道就再也撑不开了，你确信如果再强行塞进去，肯定会弄伤她。[pg]");
         outputText("你对这种挑逗感到不满，于是拔了出来，把它滑到她的躯干上，用你的" + get_player().cockDescript(_loc1_) + "把她压在身下，把她的淫水涂满她的脸和身体。她的乳房被压扁了，以至于她勃起的紫色小乳头勉强从两边露出来。这个小荡妇看起来松了一口气，而且被挑逗得不轻。她舔了舔嘴唇，高兴地说：[say:谢谢你，亲爱的，我觉得你差点把我撕成两半！别担心，我非常乐意被你的精液浸透，]说着，她用四肢缠住了你");
         if(get_player().hasKnot(0))
         {
            outputText("将脚后跟勾在你的肉结后面");
         }
         outputText("。[pg]");
         outputText("[say: 她很擅长这个，]你暗自思忖，她开始在你身下摩擦，用双腿带动整个身体在你的阴茎上上下抽插，她的双臂和双手以惊人的热情摩擦和抚摸着你。这种感觉非常强烈——这些地精确实知道如何取悦一个");
         if(get_player().get_gender() == 3)
         {
            outputText("扶她");
         }
         else
         {
            outputText("男人");
         }
         outputText("，这是肯定的！你兴奋得开始滴落液体，一滴调皮的液体溅湿了地精的脸。她眨眼将其抹去，笑容更加灿烂了。一道温暖湿润的痕迹顺着你的龟头舔舐而上，地精贪婪地开始吞咽你的先列腺液，甚至舔舐你的尿道。你的[hips]抽搐着，将紧紧抱住你阴茎的她提离了地面。[pg]");
         outputText("你从没想过这样的行为会如此令人愉悦，但这感觉实在太棒了。你失去了控制，将一股滚烫的精液喷射在地精的脸上。她语无伦次地试图擦去眼睛里的精液，这时你的下一股精液正中她的额头，让这个活泼的女人失去了平衡。她松开了紧握着你痉挛的" + get_player().cockDescript(_loc1_) + "的手，重重地摔在地上。你后退一步，随着高潮的结束，阴茎在空中晃动，");
         if(get_player().cumQ() < 75)
         {
            outputText("又将强效的精液溅了她几次。");
         }
         else if(get_player().cumQ() < 250)
         {
            outputText("给她涂上了一层厚厚的精液。");
         }
         else
         {
            outputText("将她浸透，让她躺在一滩浓稠的精液中。");
         }
         outputText("这个绿色的荡妇似乎处理得很好，甚至还把你的精液舀起来，在自慰时揉进她的阴道里。她看着你重新穿好衣服，舔了舔嘴唇，沾满精液的脸上露出性感的笑容，[say: 你尝起来和我预想的一样美味，种马！也许下次把那个坏家伙缩小点，再来找我好好玩玩，好吗？希望到那时，我塞进小穴里的这些精液能让我有个大肚子给你揉！][pg]");
         outputText("你摇了摇头离开了，这次经历让你感到有些疲惫，但也得到了释放。");
         get_player().orgasm("Dick");
         get_combat().cleanupAfterCombat();
      }
      
      public function laySomeDriderEggsInGobboTwat() : void
      {
         clearOutput();
         get_images().showImage("goblin-win-drider-egged");
         outputText("这个绿色皮肤的小生物可怜地挣扎着，试图从你身边爬开，这让你得以大饱眼福，清楚地看到她那流着淫液的小穴。当你感觉到自己");
         if(get_player().hasCock())
         {
            outputText("变硬");
         }
         else if(get_player().hasVagina())
         {
            outputText("湿润");
         }
         else
         {
            outputText("抽动");
         }
         outputText("了一点时，你情不自禁地注意到了你蜘蛛下半身日益增加的重量。再次低头看着地精，你决定也许你们都能得到一些……<i>类似</i>你们想要的东西。");
         outputText("[pg]你迅速脱下衣服，爬向那个抽泣的荡妇，弯下腰把她拉起来，同时让她转过身面对你。你用一只手臂环过她的腋下，用空着的手戳了戳她柔软的肚子，询问她孩子的情况。");
         if(get_player().get_femininity() > 50)
         {
            outputText("[pg][say: 什——什么？你——我根本没有孩子，你这个蠢婊子！这就是你觉得好玩的事吗，混蛋？落井下石？！]");
         }
         else
         {
            outputText("[pg][say: 什——什么？你——我根本没有孩子，你这个蠢货！这就是你觉得好玩的事吗，混蛋？落井下石？！]");
         }
         outputText("她用脚踢打着，但毫无力气，随着泪水开始在眼角聚集，她撅起的嘴唇撅得更高了。");
         outputText("[pg][say: 放开我，放开我！]她扭动着身体，你把另一只手滑到她的手臂下以帮助制服她。你把她举得离你更远一些，同时开始将你的蜘蛛腹部卷曲到身下。你已经可以看到你的产卵管从甲壳中探出，随着你的心跳抽动着，绿色的润滑液滴满了你的下盘。");
         outputText("[pg]你的地精玩物安静了下来，盯着你众多腿之间那根越来越粗的肉棒。");
         outputText("[pg][say: 什么？那是什么？那是干什么用的？]她紧张的语气丝毫掩饰不住顺着大腿流下的兴趣。你把她拉近，将她举在你的产卵管正上方，并在她的额头上亲吻了一下，向她保证会给她所有她梦寐以求的孩子。她矛盾的笑容和沉重的喘息让你的心跳加快了一点，当你用滑腻的肉棒刺穿这个紫发女人时，所有的回答都被打断了。");
         outputText("[pg]当你像对待活体性玩具一样让她上下起伏，尽可能多地将自己塞进她体内时，压抑的喘息和闷哼从她唇间溢出。一抹深红蔓延过你地精荡妇的脸庞；她的一只手扭捏拉扯着自己的乳头，咬着嘴唇，而她空着的手则兴奋地按摩着你每次挺进时造成的凸起。你的甲壳上沾满了她的淫液和你蜘蛛产卵润滑液缓慢渗出的混合物，变得滑溜溜的。");
         outputText("[pg]你终于顶到了底，将这个绿色的精液套子一路干到底，你感觉到你的粗壮擦过了她的子宫颈。你把手从她的腋下抽出来，重新放在她的肩膀上，把她按在原地，准备迎接接下来的事情。当第一波润滑液强行进入她体内时，她的肚子微微凸起，她幸福地喘息着，双手抚摸着她的“孕肚”。当你感觉到你的下半身收紧并颤抖时，你的笑容变得更灿烂了，因为许多卵中的第一颗正强行顺着你的产卵管向上移动。");
         outputText("[pg]你感觉到它缓慢地进入地精体内，你的产卵管在它周围张开，直到它停在她的子宫口前。她从肚子上抬起头，睁大眼睛盯着你，仅仅一秒钟后，一阵强烈的痉挛迫使卵子穿过她紧闭的子宫颈。这个迷你的婊子抽搐着，翻着白眼，舌头耷拉着，高潮迭起，一股淫液喷洒在你的甲壳上。");
         if(get_player().hasCock())
         {
            outputText("你的高潮也同样强烈，[eachCock]有力地喷洒在你的躯干上");
            if(get_player().hasVagina())
            {
               outputText("和你的");
            }
         }
         else if(get_player().hasVagina())
         {
            outputText("你的");
         }
         if(get_player().hasVagina())
         {
            outputText("[vagina]与她同步收紧，你丰富的体液浸透了你的蜘蛛下半身。");
         }
         outputText("[pg]然后下一颗卵滚向前，接着是下一颗，再下一颗……");
         outputText("[pg]当你填满她时，你把她按在你的身体上，一次一颗，每一颗球体都让被撑开的肚子进一步膨胀，直到她被填得满满的，你可以透过她紧绷的肚皮感觉到你的卵。地精几乎失去了知觉，无意识地发出咕噜声，因为瞬间怀孕的快感麻木了她的大脑。你伴随着一声响亮的湿润的“噗嗤”声把她拔了出来，她抽搐的小穴流出源源不断的透明体液，以及一串粘稠的绿色卵液。");
         outputText("[pg]把她放在阴凉处，你穿上衣服，很高兴摆脱了额外的重量，准备继续你的冒险。");
         get_player().dumpEggs();
         get_player().orgasm("Ovi");
         get_combat().cleanupAfterCombat();
      }
      
      public function goblinRapesPlayer() : void
      {
         spriteSelect(gobboSprite);
         clearOutput();
         if(get_player().isShota() && get_player().hasCockThatFits(get_monster().vaginalCapacity()))
         {
            gobboShotaRape();
            return;
         }
         if(get_player().hasPerk(PerkLib.BimboBrains) || get_player().hasPerk(PerkLib.FutaFaculties))
         {
            if(get_player().hasVagina())
            {
               get_images().showImage("goblin-loss-female-bimbodildo");
               outputText("地精向你漫步走来，扭动着臀部，带着一种饥渴、性感的摇曳。她打开一个小袋子，这一幕瞬间轰炸了你那简单的大脑，让你联想到自己的下体也被同样地打开。她拿出一支口红，停下来涂抹在嘴唇上。她盖上口红管，向你飞吻，发出湿润的吧唧声，然后走到你颤抖的身体前。当她把所有的重量都压在你的肚子上时，你被撞得喘不过气来，她的屁股和圆润的奶子就像你在肉棒上弹跳时一样诱人地晃动着。她伸手扭动自己的乳环，将湿透的胯部在你的肚子上蹭来蹭去。你忍不住羡慕她的穿孔。天哪，它们简直让你欲罢不能！[pg]");
               outputText("你的身体已经发热，你的" + get_player().nippleDescript(0) + "不由自主地硬了起来，回应着这个小荡妇完全可以理解的欲望展示。你的" + get_player().vaginaDescript(0) + "流出了足够多的淫液，在你身下形成了一个水坑，尽力向你的同类荡妇展示你有多么准备就绪。你“巧妙地”（至少在你那小小的脑海里是这么认为的）挺起胸膛，让你的[nipples]成为地精容易攻击的目标。她抓住了你的乳房");
               if(get_player().hasFuckableNipples())
               {
                  outputText("，用手指抠弄你湿润的乳头穴，紧紧捏住现在肿胀的乳晕，从你的胸部到腹股沟传来无法控制的快感浪潮。");
               }
               else
               {
                  outputText("并将手指滑到你的乳头上，捏住并扭动它们，用痛苦和快感折磨着你。");
               }
               outputText("[pg]");
               outputText("地精几乎要流口水了，说道：[say:宝贝，我们都发情了，但手指和舌头对我来说还不够。算你走运，我正好有你需要的东西。][pg]");
               outputText("有那么一瞬间，你那愚蠢的无脑花瓶大脑努力思考她那句话到底是什么意思。管他呢，你傻乎乎地咯咯笑着，任由事情发生。[pg]");
               outputText("地精把手伸进她的另一个袋子里，掏出一根假阳具，它在她手里晃来晃去，仿佛很高兴能从袋子里出来。她拍了拍你的脸颊，调皮地笑着提议道：[say:我们为什么不把一端埋进我们各自的小穴里呢？张开嘴，帮我把它弄热，好吗？][pg]");
               outputText("有那么一瞬间，你呆呆地眨了眨眼，试图思考为什么在那么一小秒钟里你想说“不”，但随后你就把它抛在脑后，任由欲火蔓延，自然而然地张开嘴，形成一个完美的“O”型，不由自主地向她投去荡妇般的眼神。[pg]");
               outputText("她立刻用那根鼓胀的假阳具塞住了你那像充气娃娃一样的嘴。它不知怎么地膨胀起来，撑开你的下巴，把你的舌头压在嘴底——这比你自己张着嘴要容易多了。一滴液体从它的尖端流出。你条件反射地咽了下去——哦，等等，那是精液还是什么？你那小小的脑瓜子困惑了一会儿，至少在那个更聪明的荡妇向你解释之前是这样。[pg]");
               outputText("[say:很好吃，不是吗？这是我自己做的。它是用最好的材料做的——它会与液体发生反应，膨胀起来，完美地填满任何洞。看你的样子，这可能会很有帮助。你看起来像是经历过不少阵仗。]她眨了眨眼，[say:哦，更棒的是……它里面有一根小管子，装满了催情剂，会慢慢渗入你湿润的身体里！][pg]");
               outputText("当地精把那根粗大、湿透的假肉棒从你嘴里拔出来时，唾液覆盖了你的嘴唇，滴落到你的乳房上。塞进你喉咙的那部分已经肿胀到几乎是她手里那一半的两倍宽。地精迅速纠正了这一点，把另一半吸进她的喉咙里，至少把八英寸吞进了嘴里，没有丝毫作呕的迹象。她简直太擅长这个了！她把它拔出来，看着它膨胀。她脸红了，把她那带着小酒窝的绿色脸颊变成了紫色。当她把假阳具的一部分扔到你的阴阜上时，它残忍地拍打着你的小穴。经过几次熟练的动作，她把它塞进你体内，用人造肉棒把你填满，让你的思绪回到了所有你像这样操自己的时光。假阳具上的一记轻拍将你那轻松、游荡的思绪拉回现实，震动直接传到了你的" + get_player().vaginaDescript(0) + "里。[pg]");
               get_player().cuntChange(get_player().vaginalCapacity(),true,true,false);
               outputText("你的绿色荡妇同伴站起来，跨过你的胯部，与你垂直站立。当她把双头龙游离的一端塞进自己湿滑的小穴时，她那滴水的阴户流出的温暖湿润溅到了你的大腿上。当它们在中间相遇时，你的小穴和她的小穴湿漉漉地挤压在一起，你的" + get_player().clitDescript() + "被她的阴唇压着。地精扭动着，摩擦并剪刀般地夹紧她的大腿，她阴蒂的坚硬花蕾一次又一次地摩擦着你的[clit]。[pg]");
               outputText("现在你的通道感觉比以往任何时候都要饱满！这个小荡妇的每一个动作都被直接放大到塞在你流口水的小穴里的操弄棒上。从它在你经验丰富的阴道壁上摩擦和扭动的美妙感觉来看，催情剂绝对起作用了。你呻吟着，张开双腿，让这个小小的施虐狂在你的身体处于自然姿势时自由支配——张开并准备就绪。[pg]");
               outputText("她更用力地在你身上扭动，仰起头，手指穿过她紫色的头发，一直大声鼓励着：[say:嗯，你喜欢这个，不是吗，荡妇？我的假阳具很适合你这荡妇的小穴，不是吗？我敢打赌这很少见。继续扭动你的臀部——催情剂是靠重力输送的，你在下面，很快就会爽得失去知觉。只是别在我之前高潮，亲爱的，我想和你一起感受释放。][pg]");
               outputText("这些日子以来这并不难，但你迷失在连接你们沸腾腹股沟的肿胀假阳具带来的甜蜜感觉中，快感带走了你仅存的一点点理智。你前后摇晃，无情地与你的绿色女主人剪刀般摩擦，你呻吟着，将自己淹没在药物增强的快感海洋中。地精大叫一声，在突如其来的高潮中挣扎，将粗大的假阳具在你荡妇的洞里猛烈地扭动。她高潮的汁液与玩具发生反应，将你撑开到完美的阴道扩张程度——能找到一个能把你撑开的人真是太罕见了！你们的身体一起挣扎，被双重高潮折磨着，让你身上涂满了汗水和女性精液的混合物。[pg]");
               outputText("后来，湿漉漉的地精发出清晰的“啵”的一声拔出了假阳具。她迈着罗圈腿踉跄了一下，然后挑逗了一下你的无脑花瓶阴蒂，把她的玩具从你饥渴的小穴里猛地拔了出来。你的阴唇比以往任何时候都张得更大，但你现在已经习惯了你的小穴被撑开……");
               outputText("[pg]");
               outputText("她在你嘴唇上印下一个吻，嘟囔道：[say:可不能忘了这个，]然后把她的假阳具收了起来。你发现自己微笑着，看着她那绑满带子的身体在离你远去时愉快地晃动着。你的眼皮耷拉下来，嘴唇变得麻木，因为她那涂了药的口红开始让你昏睡过去。[pg]");
               outputText("你的眼睛翻白，让你看起来比以往任何时候都更蠢。该死，那简直，简直太他妈不可思议了！");
               get_player().orgasm("Vaginal");
               get_combat().cleanupAfterCombat();
               return;
            }
         }
         outputText("地精向你漫步走来，扭动着臀部，带着一种饥渴、性感的摇曳。她打开一个小袋子，拿出一支口红，停下来涂抹在嘴唇上。她盖上口红管，向你飞吻，发出湿润的吧唧声，然后走到你");
         if(get_player().get_HP() < 1)
         {
            outputText("被击败的");
         }
         else
         {
            outputText("颤抖的");
         }
         outputText("身体。当她把全身重量压在你的腰部时，你被撞得喘不过气来，她的屁股和圆润的乳房诱人地晃动着。她伸手去扭动她的乳钉，将她湿透的胯部在你的肚子上上下摩擦。[pg]");
         outputText("你的身体变得燥热，回应着这个娇小的恋物癖荡妇令人发指的欲望展示。");
         if(get_player().cockTotal() > 0)
         {
            get_images().showImage("goblin-loss-male-raped");
            outputText("热量蔓延，越来越大");
            if(get_player().cocks[0].cockLength <= 7)
            {
               outputText("当你的隆起开始压在她柔软的屁股之间时");
            }
            else if(get_player().cocks[0].cockLength <= 14)
            {
               outputText("当你的隆起在她的屁股之间向上生长并贴在她的后腰上时");
            }
            else
            {
               outputText("当你的隆起沿着她的背部向上生长并稳步向她的肩膀蔓延时");
            }
            outputText("。");
         }
         if(get_player().hasVagina())
         {
            get_images().showImage("goblin-loss-female-raped");
            if(get_player().vaginas[0].vaginalWetness <= 1)
            {
               outputText("你下体的阴唇充血，变得几乎和地精的一样肿胀。");
            }
            else if(get_player().vaginas[0].vaginalWetness < 4)
            {
               outputText("女性的润滑液浸透了你的[armor]背面。");
            }
            else
            {
               outputText("它迅速形成一个水坑，因为你的" + get_player().vaginaDescript(0) + "尽其所能地展示你有多么准备就绪。");
            }
         }
         outputText("你的[nipples]向上凸起，给地精提供了容易的目标。她抓住它们");
         if(get_player().hasFuckableNipples())
         {
            outputText("将她的拇指滑入娇嫩的阴户内并紧紧捏住它们");
         }
         else
         {
            outputText("扭曲和调整");
         }
         outputText("，用痛苦和快乐折磨你。[pg]");
         if(get_player().totalCocks() > 0 && (!get_player().hasVagina() || Utils.rand(2) == 0))
         {
            if(get_player().cockArea(0) > get_monster().vaginalCapacity())
            {
               outputText("她高高抬起身体，用她娇小的双手抓住你的[cock]。当她努力将她滴水的女性部位分开以容纳你巨大的阴茎时，你的大脑不知怎么地注意到了她闪亮的黑色指甲。虽然她的身体伸展到了荒谬的程度，但她就是无法将你纳入体内。她撅起嘴，把你的工具扔回你身上，向你保证，[say:我会找到办法把你每一滴精液都弄进我体内，别担心。][pg]");
               outputText("这个小荡妇跳回你身上，用她的手臂和腿紧紧缠住你的阴茎。她的舌头滑过");
               if(get_player().balls > 0)
               {
                  outputText("你的[balls]");
               }
               else
               {
                  outputText("你的[cock]根部");
               }
               outputText("然后她把它深深埋入你的[assholeorpussy]中。她的大腿、乳房和身体用一层温暖的绿色肉体包裹着你，带着狂热的欲望在你周围蠕动和扭曲。当这个灵活的小妖精将她的臀部向后弯曲并在上面摩擦时，她仍然部分伸展的阴户的嘴唇尽其所能地吞噬你阴茎的头部。[pg]");
               outputText("这个淫荡的小家伙正用她的身体操着你那巨大的肉棒，她是如此的热情和性感，以至于你无法控制下体不断积聚的压力。你确信你一定漏出了先列腺液，但包裹着你龟头的湿润小穴已经让你沾满了淫液，你根本分辨不出来。你颤抖着，努力克制自己，想要");
               if(get_player().cor > 50)
               {
                  outputText("延长你的快感");
               }
               else
               {
                  outputText("阻止这个怪物女孩得到她想要的");
               }
               outputText("。地精回头看了看，眯起眼睛，然后退后一步说道：[say: 想都别想憋着，种马。][pg]");
               outputText("她把手指伸进她舌头离开后留下的空隙，");
               if(get_player().hasVagina())
               {
                  outputText("抚摸着你的[clit]");
               }
               else
               {
                  outputText("紧紧压迫着你的前列腺");
               }
               outputText("同时低语道：[say: 来吧，把我的小穴变成一个肿胀的精液垃圾桶。我需要你用你所有的精液填满我。用你的淫液把我塞满，我保证我会给你生一打淫荡的女儿，让你每天晚上都能用精液填满她们。][pg]");
               outputText("她的手指和话语达到了预期的效果，引出了一次极其愉悦的高潮。你的臀部在她的娇躯上摇晃和抽动，迫使她紧紧抓住你痉挛的身体，一团团精液顺着你巨大的尿道喷涌而出。你能感觉到它们在这个娇小女孩湿透的通道里爆发，立刻浸透了她的子宫。");
               if(get_player().cumQ() > 100)
               {
                  outputText("你的精液不断喷涌，直到精液开始从她的爱液通道倒流出来，浸透了她的身体和你的腹部。");
               }
               if(get_player().cumQ() >= 250)
               {
                  outputText("随着她的子宫被精液塞满，她的肚子明显变形，让她看起来已经像是怀孕晚期了。看到自己肿胀的腹部，她高兴地咕咕叫着。");
               }
               outputText("满足之后，你的高潮逐渐减弱，只剩下几滴精液。地精从你身上滑下来，看起来有点罗圈腿，但非常高兴。[pg]");
               outputText("她挥了挥手，[saystart]谢谢你的精液，亲爱的！这");
               if(get_player().cumQ() < 100)
               {
                  outputText("虽然不多，但我会凑合用的");
               }
               else if(get_player().cumQ() < 250)
               {
                  outputText("应该足够为你生几个乳臭未干的小荡妇让你操了");
               }
               else
               {
                  outputText("比我梦想的还要好。我会再去找你的，种马");
               }
               outputText("！[sayend][pg]");
               outputText("她又咯咯地笑了起来，俯身吻了你的嘴唇，把她厚厚的、充满气泡的嘴唇涂在你的嘴唇上，让你尝到了她口红的泡泡糖味道。你发现自己如梦似幻地微笑着，陷入了昏迷……那口红里一定有什么东西！");
               get_combat().cleanupAfterCombat();
               get_player().orgasm("Dick");
            }
            else
            {
               outputText("地精女孩没有浪费时间进行更多的前戏，她只是像一只即将得到奶油的猫一样弓起背，然后故意缓慢地将她柔软的屁股滑向你的[cock]。当她微微张开的阴唇擦过你的");
               if(get_player().cocks[0].get_cockType() == CockTypesEnum.HORSE)
               {
                  outputText("龟头冠状沟");
               }
               else
               {
                  outputText("龟头");
               }
               outputText("，随着她越坐越低，极其缓慢地将你包裹。她舔了舔亮泽的嘴唇，向你飞吻，然后猛地一沉到底，将你的整根阴茎吞没。[pg]");
               outputText("她进一步弓起背，骄傲地展示着你的阳具在她紧致的小腹上顶出的凸起。她一边拨弄着自己的阴蒂，一边娇嗔道：[say: 嗯……真高兴尺寸刚好。我上一个找的伴侣太大了，塞不进我贪婪的小穴，那样一点都不好玩。] 她的臀部开始上下套弄，眼神中闪过一丝渴望，[say: 不过他确实把我填得满满当当的。你能为我做到吗？你能把我操怀孕吗？] 她问道。[pg]");
               outputText("你已经被挑逗得除了呻吟和点头什么也做不了，完全被欲望和她紧致湿润的小穴囚禁。你能感觉到它在你周围蠕动，有节奏地挤压和榨取，仿佛要将你吸干。当你开始迎合她的动作，挺动腰部将她顶起又落下时，地精发出了少女般的咯咯笑声，她那被皮革包裹的乳房也随之为你在你眼前晃动。光线在她的穿孔饰品上反射出令人迷醉的光芒，随着她的动作来回跳跃。[pg]");
               outputText("这个风骚的荡妇从身后不知什么地方掏出一个烧瓶，拔开塞子，释放出一股带有樱桃香味的红色烟雾。[pg]");
               outputText("[say: 乖乖吃药，种马，我得确保你有一大股精液给我，] 她命令道，伸长手臂将烧瓶按在你的嘴唇上。");
               if(get_player().cor < 50)
               {
                  outputText("你摇着头，试图躲开这散发着甜香的药物，但她还是把瓶口倾斜，将大部分液体灌进了你的喉咙。");
               }
               else
               {
                  outputText("你舔了舔嘴唇，张开嘴，开心地吞下了这樱桃味的药物。");
               }
               outputText("一阵眩晕感流遍全身，伴随着令人放松的温和暖流，让你很容易放松下来，任由那个可爱的绿色婊子吞吐你的肉棒。[pg]");
               outputText("她伸手向下");
               if(get_player().balls > 0)
               {
                  outputText("一只手托住你的[balls]，随着药物开始起效，轻轻地揉捏着");
               }
               else
               {
                  outputText("用手捏住你的会阴，当你的前列腺在药物作用下突然开始肿胀时，她咯咯地笑了起来");
               }
               outputText("。没过多久，你的胯下就感到紧绷和饱满。你感觉自己快要爆炸了，肯定已经有先列腺液滴进了地精饥渴的阴道里。她心领神会地拍了拍你的胸膛，缓慢地前后摇晃着，满足地叹了口气。[say: 感觉到了吗，亲爱的？那是我特制的炼金产物，能让你的身体进入极其强烈的发情状态。几秒钟后，你就会有憋不住的精液，你必须为我射出来。准备好了吗，宝贝？现在别憋着了，我的小穴正等着呢，] 她娇嗔道。[pg]");
               outputText("你的阴茎顺从地微微变粗，腹部肌肉随着高潮的力量收缩。当地精的子宫颈被第一股精液击中时，她的瞳孔缩小，双眼翻白。当压力积聚并开始填满她的子宫时，她颤抖起来。你再次收缩，这次紧紧贴着她，因为药物的效果开始消退。她的肚子因为里面塞满了精液而微微撑起，但你知道你还没完。她流着口水，舌头淫荡地挂在嘴边，你将一发又一发的精液泵入她肥沃的子宫，但美好的事物总有结束的时候。[pg]");
               outputText("地精恢复了意识，从你身上翻下来，摸着自己的肚子，露出幸福的微笑，然后踉踉跄跄地站了起来。她向你道谢，[say: 嗯，干得好，种马。等我的女儿们出生了，我得告诉她们怎么找到你。我觉得你有能力让我建立自己的部落！] 怀孕的地精拍了拍你仍在滴水的阴茎，俯下身，用她亮泽的嘴唇给了你一个湿吻。你满足地微笑着闭上眼睛，在你昏过去之前，几乎没有意识到她的口红里被下了药。");
               get_player().orgasm("Dick");
               get_combat().cleanupAfterCombat();
            }
         }
         else
         {
            outputText("地精说：[say: 宝贝，我们都发情了，但光靠手指和舌头对我来说是不够的。算你走运，我正好有你需要的东西。][pg]");
            outputText("她把手伸进臀部一个鼓鼓囊囊的小袋子里，掏出一根假阳具，它在她的手里晃来晃去，仿佛很高兴重获自由。她拍了拍你的脸颊，调皮地咧嘴一笑，提议道：[say: 我们为什么不把两头分别埋进我们的小穴里呢？张开嘴，帮我把它弄热，好吗？][pg]");
            if(get_player().cor < 33)
            {
               outputText("你猛烈地摇头，明确表示“不”，但当你张开嘴想要抗议时，你的嘴唇立刻被鼓胀的性玩具塞住了。");
            }
            else if(get_player().cor < 66)
            {
               outputText("你张开嘴想结结巴巴地说出你的担忧，但她用那根软塌塌的人造阴茎堵住了你的嘴，把你的话变成了惊讶的呜咽。");
            }
            else
            {
               outputText("你羞涩地舔了舔嘴唇，然后把嘴张成一个欢迎的“O”形。性玩具直接滑进了洞里，把你对这个安排的喜悦之声闷在了喉咙里。");
            }
            outputText("它不知怎么地“膨胀”了起来——也许是对你的唾液产生了反应——强行撑开你的下巴，把你的舌头压在嘴底。一股液体从它的尖端流出，差点让你作呕，但你的喉咙却条件反射般地把它咽了下去。你刚才吞下了什么？[pg]");
            outputText("[say: 很好吃，对吧？这是我自己做的。它是由最好的材料制成的——它会与液体发生反应，膨胀起来，完美地填满任何洞穴。更棒的是，它还有一个装满催情剂的储液囊，会慢慢渗出。你觉得热了吗，亲爱的？]她问道。[pg]");
            outputText("当她把那根沾满口水的粗大假阳具从你嘴里拔出来时，你稍微咳了几下。塞进你喉咙的那部分已经肿胀得几乎是她手里那半截的两倍宽。地精把另一半吸进喉咙，至少吞下了八英寸，却没有表现出任何不适。她把它拔出来，看着它开始膨胀，脸颊泛起红晕，微微凹陷的脸颊变成了紫色。当她把假阳具的一部分扔到你的阴阜上时，它残忍地拍打着你的阴户。她用几个熟练的动作，把它塞进你的体内，用人造肉棒把你填得满满的。地精再次咯咯笑起来，拍打着假阳具露在外面的那一半，让它来回晃动，将震动直接传导到你的核心。[pg]");
            get_player().cuntChange(get_player().vaginalCapacity(),true);
            outputText("这个绿色的荡妇站起身，跨过你的胯部，与你呈九十度角站立。当她把双头假阳具空闲的一端塞进自己渴望的阴户时，她准备就绪的温暖湿润溅到了你的大腿上。她顺着它的长度滑下，轻松地将剩余的长度吞入她多汁的阴道。你的" + get_player().vaginaDescript(0) + "在中间相遇时，湿漉漉地与她的阴户摩擦着。地精扭动着，研磨并交叉着她的大腿，她阴蒂坚硬的花蕾在你的[clit]上来回摩擦。[pg]");
            if(get_player().getClitLength() >= 7)
            {
               outputText("当然，你阴蒂的巨大尺寸让地精很难用正常的方式处理——它总是滑到她的乳房之间。这个绿色小荡妇的眼睛里闪烁着恶魔般的主意。她拿出一小瓶粉红色的粘液，倒在她的乳房上，把它们推到你的阴蒂周围，用滑溜溜的肉体将它们包裹起来。你高兴地大叫起来，被这个小女人无情地玩弄着你那巨大的快乐按钮所散发出的感觉所淹没。[pg]");
            }
            outputText("现在你的通道感觉前所未有的充实，被那根柔软膨胀的双头假阳具塞得满满当当。这个小荡妇的每一个动作都被直接放大，传递到塞满你" + get_player().vaginaDescript(0) + "的假阳具上。从它在你敏感的肉壁上摩擦和扭动的奇妙感觉来看，催情剂绝对起作用了。你呻吟着，双腿大张，任由这个小小的施虐狂支配你的身体。她更用力地在你身上扭动，仰起头，手指穿过她[monster.hair]的头发，同时大声鼓励着，[say:嗯，你喜欢这样，不是吗，荡妇？我的假阳具是不是完美地填满了你？继续扭动你的臀部——催情剂是靠重力输送的，你在下面，很快就会爽到失去意识的。只是别在我之前高潮，亲爱的，我想和你一起释放。][pg]");
            outputText("你迷失在连接着你们滚烫下体的膨胀假阳具带来的甜蜜感觉中。前后摇摆，无情地与你的绿色女主人摩擦，你呻吟着，将自己淹没在药物增强的快感海洋中。地精大叫一声，在突如其来的高潮中剧烈扭动，将粗大的假阳具在你" + get_player().vaginaDescript(0) + "里猛烈地扭动。她高潮的汁液与玩具发生反应，几乎痛苦地撑开你，将你推过了无法回头的临界点。你们的身体一起剧烈扭动，被双重高潮折磨着，让你们身上涂满了汗水和女孩淫液的混合物。[pg]");
            outputText("之后，湿透的地精发出“啵”的一声，从假阳具上拔了出来。她步履蹒跚，呈罗圈腿状，然后挑逗了一下你的[clit]，猛地拔出了她的玩具。你的阴唇");
            if(get_player().vaginas[0].vaginalLooseness <= 3)
            {
               outputText("暂时张开");
            }
            else
            {
               outputText("张得比以往任何时候都大，但也只是一瞬间");
            }
            outputText("。[pg]");
            outputText("她把假阳具收起来，在你的嘴唇上印下一吻，嘟囔道：[say: 可不能忘了这个。]你发现自己微笑着，看着她那绑带覆盖的身躯在远处欢快地跳跃着，胸部随着动作愉快地晃动。你的眼皮渐渐合上，嘴唇也变得麻木，她那涂了药的口红让你失去了意识。");
            get_player().orgasm("Vaginal");
            get_combat().cleanupAfterCombat();
         }
      }
      
      public function goblinLoliScene() : void
      {
         clearOutput();
         outputText("你信步上前，打算在这个可怜的小地精身上寻些慰藉。你" + get_player().clothedOrNakedLower("脱下[armor]","做好准备") + "，那绿皮矮冬瓜只是怔怔望着。[say:一个小崽子也想强暴我？]她嗤之以鼻。");
         outputText("[pg]你不服气地看着她，用[foot]将她掀翻过来，让她仰面躺倒。然后跨开[feet]，站在这矮子母狗脑袋的两侧。俯身跪压在她身上，命令道：[say:给我舔。]");
         outputText("[pg]虽然对被你使唤感到不满，但地精既没有力量也没有意志去反抗，很快你就在愉悦中叹息，因为你感觉到一条柔软湿润的舌头滑过你的[vagina]。不管你年纪多小，身体确依旧和成年人一样饥渴。热流涌遍你的全身，你开始不自觉地扭动[hips]，在那可怜女孩的脸上碾磨，将胯间更用力地压上她的舌头。察觉到胸前那对小巧的乳头悄然挺立，你的双手连忙攀上去揉捏把玩，抚弄起自己的[chest]。");
         outputText("[pg]你一边继续扭动着腰肢，一边尽情蹂躏着自己的胸部，呻吟与战栗从喉咙里不住地溢出来。虽然这小地精一开始看似抗拒，但你注意到她自己的手也正摸向胸脯和腿间。你本可以趁机嘲笑她口是心非，可此刻你早已被下身那愈发饥渴的吮吸与舔舐弄得神魂颠倒。如果她有什么说对了的，那就是骂你是个小骚货——一个沉沦于舔穴之乐的小不点荡妇，就跟你正在玩弄的这个下流矮子一个德行。");
         outputText("[pg]你靠在她的身上，用手臂支撑着自己，继续在受害者的脸上摩擦——享受着这种刺激，并对吸吮和轻咬你的[clit]所引发的燃烧般的快感赞不绝口。");
         outputText("[pg]终于在这轮番唇舌攻势下败下阵来，你发出一声满足的欢叫。爱液自双腿之间喷涌而出，让那哥布林尝到了你这个娇小萝莉深处的鲜美滋味。随着亢奋渐渐褪去，心脏的狂跳声才愈发清晰。你精疲力竭，踉踉跄跄地挪到衣物旁，重新穿戴整齐后离开了。");
         get_combat().cleanupAfterCombat();
         get_player().orgasm("Vaginal");
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function goblinCondomed(param1:Number = 0) : void
      {
         spriteSelect(gobboSprite);
         var _loc2_:int = get_player().cockThatFits(get_monster().vaginalCapacity());
         clearOutput();
         get_images().showImage("goblin-win-male-goblincondomed");
         outputText("战败后，地精女孩双腿发软，向后倒去，仰面躺着，翠绿的脚踝悬在头顶。[say: 尽情使用我吧，]她乞求道，[say: 羞辱我，贬低我，践踏我！不管你做什么，只要填满我就行！]当你脱下你的[armor]时，她尽可能地张开双腿，这个放荡的女孩向你展示着她流着淫液的小穴，肿胀的绿色阴唇上已经滴落着焦急的汗珠和渴望的爱液。她在泥土中扭动着，双手抓着丰满的臀部，满怀希望地把屁股翘到半空中。你几乎能感觉到这个小荡妇渴望精液的小穴散发出的热量，她发情的狂热让她的眼神变得呆滞而涣散。站在她上方，很明显她现在唯一意识到的只有她双腿间跳动的小穴和你正在勃起的阴茎。[pg]");
         outputText("她不耐烦地伸出双腿，用脚趾勾住你的下半身，试图把你拉近，同时保持她那饥渴的小穴触手可及。她橄榄色的双脚紧紧抓住你的肉体，结实有力的脚底在你的[skinfurscales]上摩擦，沿着你的[hips]外侧上下滑动。地精的脚跟划过你的大腿，将双脚并拢在你的" + get_player().cockDescript(_loc2_) + "两侧，她翠绿色皮肤的脚掌压在");
         if(get_player().balls > 0)
         {
            outputText("你跳动的阴囊上");
         }
         else
         {
            outputText("你阴茎的根部");
         }
         outputText("，而她的脚趾像粗壮的手指一样卷曲着包住你的肉棒。起初，这个石灰色的女孩慢慢地抚摸着你，然后加快了节奏，交替使用脚背和小腿之间丝滑皮肤的柔软拥抱，用脚踝的紧致感按摩你的阴茎，直到它完全勃起。在她的双脚之间颤抖着，一滴滴先列腺液开始从你的顶端渗出，几乎透明的液滴顺着你的龟头滚落。地精用她的大脚趾虔诚地收集起这温暖的液体，让它欢快地在每个脚趾间流淌，然后用坚定的抚摸将它涂抹回你的阴茎上，像涂油一样将这无精的液体揉进你的肉体，她的双脚在你的体液滋润下闪烁着海绿色绿柱石般的光泽。[pg]");
         outputText("此时，这个淫荡的女孩身下已经汇聚了一滩因过度刺激而流出的爱液。她淫荡地呻吟着，手指仍然抠着自己的屁股瓣，你意识到这个地精仅仅是给你做足交就已经高潮了。她如此渴望你的阴茎，简直到了可悲的地步，一个邪恶的念头闪过你的脑海。你抓住她沾满先列腺液的滑溜溜的双脚，手指沿着她被爱液软化的皮肤滑动，挠着、揉着她的脚底，直到女孩在狂喜中尖叫起来，紧闭双眼，她那气喘吁吁的欲望已经让她无法再把手从小穴上移开。伴随着溢出的爱液温暖的飞溅声，她将右手的指头抠进她翠绿的裂口，左手在翠绿的阴蒂上快速地画着越来越大的圆圈，震动让她的屁股在森林地面的泥浆中晃动。趁她分心的时候，");
         if(param1 == 0)
         {
            outputText("你启动了你的吐丝器，这个精巧的器官编织出一个长而薄的细网状蜘蛛丝套，小心翼翼地将粘性股线留在柔韧避孕套的惰性层之间。把它滑过你的" + get_player().cockDescript(_loc2_) + "，你惊叹于它是如此轻盈！你甚至能感觉到微风穿过丝绸般的覆盖物。");
         }
         else
         {
            get_player().destroyItems(get_useables().CONDOM,1);
            outputText("你撕开包装，将乳胶避孕套滑过你的" + get_player().cockDescript(_loc2_) + "，惊叹于它是如此透明和闪亮。你觉得地精在为时已晚之前是不会注意到的！");
         }
         outputText("是时候给这个地精她所要求的了，即使不是她想要的。[pg]");
         outputText("你仍然抓着她扭动的双脚，弯下腰，尽可能地将她的双腿分开，随着她大腿内侧在拉扯中收紧，肌肉被拉伸得越来越宽。增加的压力加上她自己疯狂的自慰，使女孩迎来了又一次高潮，这一次她喷涌的淫液化作堕落欲望的水晶溪流向上喷射，温暖地拍打在你的腹部。她的手臂垂在身体两侧，手掌向上，手指抽搐，为你的" + get_player().cockDescript(_loc2_) + "扫清了通往她为你准备好的颤抖的绿色小穴的道路。推开她肿胀的阴唇，你发现她太湿了，你几乎直接滑了进去，当你用僵硬的男根填满她时，她因高潮而痉挛的肌肉不规则地抽搐着。[say: 哦，是的，你终于找到了你的鸡巴，]她喘息着，口水在嘴里冒泡。[say: 像恨我一样抽插我，你这混蛋，]她要求道，你抓住她的脚踝将她向上拉，把她拉得更深地套在你跳动的鸡巴上，她滴水的小穴吸吮着你的肉棒，她深绿色的内部褶皱在你的抽插下分开。[say: 我不是玻璃娃娃，你这胆小鬼，就他妈的插进去！]她尖叫着，手指抓着地面，向上挺动以让你更多地进入她体内。[pg]");
         outputText("看来这个嘴臭的婊子显然忘了是谁输了这场战斗，所以你决定提醒她一下。你把她的双腿当成杠杆，让她在你的阴茎上转了180度，让她趴在自己的乳房上，屁股高高撅起，然后你把剩下的阴茎全部塞进这个橄榄色皮肤的色情狂体内。她闷哼了一声，刚想说点什么，但你猛地向前一推，把她的脸按进了泥里，让她把话咽了回去，她的嘴里塞满了混着她自己淫液的泥土，发出一阵狂喜的咕噜声。她的双腿在你的掌控下挣扎着，东扭西歪，滑溜溜的脚丫差点从你手中滑脱。你咬紧牙关，开始尽可能用力地操弄她那流着口水的小穴，渴望驯服这个不停挣扎的婊子。你把她汗湿的大腿猛地撞向你的[hips]，你的抽插变得几乎野蛮起来，当你把她的小穴拍打在你的腹股沟上时，她的臀部泛起了一层深深的红晕，秘密避孕套发挥了完美的作用，就像你" + get_player().cockDescript(_loc2_) + "上的一层薄皮。[pg]");
         outputText("当你感觉到高潮那令人发痒的热度钻进你的血管时，你俯下身，把全身的重量压在每一次填满子宫的动作上，而地精则语无伦次地尖叫着表示赞同，脚趾在你手中蜷缩着。你松开她的双腿，用双手抓住这个地精荡妇纤细的腰肢，最后一次猛烈地撞击她高高撅起的屁股，然后滚烫的液体从你的" + get_player().cockDescript(_loc2_) + "中喷涌而出，化作浓稠的强效精液。伴随着高潮的闷哼，她用双腿缠住你的[ass]，锁住脚踝，用她酸痛的双腿尽可能深地把你的喷射的肉棒拉进她肥沃的下体，并把你留在那里。你在她身上摇晃着，最后一次把她的头和乳房在泥土里摩擦，因为你的精液填满了她的肚子，她那狭窄的肚子因为你精液的重量而鼓了起来。你多花了一点时间来享受这个精液垃圾桶紧致、跳动的深处，然后滑出一英寸，抓住");
         if(param1 == 0)
         {
            outputText("你留在秘密阴茎套上的一根松散的丝线。你小心翼翼地拉扯着，解开精致的外层，只留下粘稠的丝线覆盖在充满汁液的内层护套上。你发出一声短促的笑声，从这个荡妇体内拔出阴茎，蜘蛛丝避孕套在你的龟头滑出时密封起来。");
         }
         else
         {
            outputText("乳胶阴茎套的边缘。你小心翼翼地拉扯着，慢慢取下用过的避孕套，并把开口端系紧。你看着它，能看到避孕套里装满了你的精液。");
         }
         outputText("然后，你用力掰开她的双脚，毫不客气地把她扔在地上。[pg]");
         outputText("这个翠绿色的女孩扭动着身体坐了起来，浑身是汗和泥，她戳了戳自己鼓起的肚子，脸上露出困惑的表情。[say:怎么……感觉不对劲，]她嘟囔着，用双手按压着自己的皮肤。她用一根长长的中指检查了一下自己的小穴，拔出来时干干净净，没有她预想中的象牙色奶油。[say:搞什么鬼？避孕套？]她尖叫起来。[say:你个混蛋！]她越来越疯狂地按压着自己的肚子，当那个装满精液的气球完好无损地弹回来时，她张大了嘴巴。[say:为什么它不破？]她质问道。");
         if(param1 == 0)
         {
            outputText("你礼貌地告诉她，蜘蛛丝非常结实，而且非常粘。她把手指伸进自己的小穴，试图把它拉出来，当她感觉到内壁被粘稠的网拉扯时，她倒吸了一口凉气。尽管她尽了最大努力，但那个丝质气球还是乖乖地待在你留下的地方，被你那具有束缚力的网紧紧地粘在原处。你大笑起来，祝她好运能把它弄出来，然后你收拾好衣服走开了。地精女孩肚子里装满了精液，却无法让任何一滴进入她的子宫，她无助地呻吟着，绝望地用手指抠弄着自己，仿佛她的高潮能把留在她体内的宝藏弄出来似的。");
         }
         else
         {
            outputText("你礼貌地告诉她，乳胶很结实，能有效避孕。你大笑起来，祝她好运能把它弄出来，然后你收拾好衣服走开了。地精女孩肚子里装满了精液，却无法让任何一滴进入她的子宫，她无助地呻吟着，绝望地用手指抠弄着自己，仿佛她的高潮能把留在她体内的宝藏弄出来似的。");
         }
         get_player().orgasm("Dick");
         get_combat().cleanupAfterCombat();
      }
      
      public function gobboWombFuck() : void
      {
         clearOutput();
         spriteSelect(gobboSprite);
         outputText("你叹了口气，走向倒下的地精。她们是泛滥成灾的害虫，像老鼠一样繁殖。");
         outputText("[pg]她因为头晕而呻吟着，恢复了意识。[say:你想要你的奖励吗？]地精一边解开衣服一边滔滔不绝地说。[say:我很乐意让这么强壮的种马填满我的子宫。]");
         outputText("[pg]那你就填满她的子宫吧。你用尽全力一拳打在她的肚子上，让她干呕起来。当这个被惊呆的地精捂着肚子时，你翻找她的东西，拿出一把刀，带着邪恶的眼神转过身来。");
         outputText("[pg][say:嘿，伙计，那很痛！你已经赢了，所以这是怎么回事——]当她看到刀子靠近她的脸时，她突然停了下来。[say:哇，哇，我没有别的意思，你可以拿走任何你想要的东西。]");
         outputText("[pg]用你的" + (get_player().isNaga() ? "蛇身" : "空闲的手") + "，你抓住[monster.short]的脖子，让她保持不动。你向她保证，你只是想填满她的子宫，就像她希望的那样。她担忧的眼睛盯着你手里的刀，这表明她不相信你。那么，行动将胜于雄辩。你把刀刺进她的胃里，迫使她再次干呕。慢慢地，你把刀刃往下拉，切开你猜测是她子宫周围的肉。信守诺言，你掏出你的[cock]，把它推向你造成的巨大伤口。她试图尖叫的企图大多被勒住脖子而压制了，然而她确实设法发出了相当大的抽泣声。");
         outputText("[pg]温暖的血液流过你的" + Appearance.cockNoun(get_player().cocks[0].get_cockType()) + "，既舒缓又令人兴奋，让你的勃起更加坚挺。你把阴茎推入，当你到达你切开的伤痕累累的子宫时，拉伸了撕裂的腹部肌肉。你把刀放在一边，腾出一只手来抓住地精。当你重新调整姿势时，对她脖子的抓握放松了，但她痛苦的咕噜声已经太微弱了，无法在这里引起太多注意。");
         outputText("[pg][say:求……求求你放我走。你会杀了我——]她停止了乞求，因为你施加在她肠子里的痛苦和压力让她再次干呕。当然你会杀了她，这才是重点。紧紧抱住她的身体，你挺起臀部，撕裂了她子宫穿孔的组织。<i>现在</i>你正在适当地填满她。");
         outputText("[pg]痉挛的肌肉让你滴出先列腺液。所有不同的感觉都让你的脊背发凉。作为她子宫的内部肉棒套是锦上添花。你慢慢地拔出，慢慢地推入，让她的肉有时间记录下每一个动作，而不会太快被压倒。她的哭泣和喘息告诉你，你的努力正在按预期发挥作用。你插入的压力挤出了一些她的肠子，在你的骨盆和她之间形成了一个非常柔软和糊状的屏障。这种肠交的节奏既令人放松又令人兴奋。");
         outputText("[pg]地精的抽泣声平静下来，她的身体开始变得柔软。你用力撞向她，让她恢复意识。如果她反正要昏过去，慢慢来就没有意义了。再次重新调整，你采取了一个强有力的姿势，让她平躺在你身下。你<b>进</b><b>出</b>地抽插着，瘀伤了肉体，因为这无关紧要。地精的眼睛震惊地睁得大大的，死亡很快就会来索取她。你打算先射精。你把你的肉棒沿着她充满血液的子宫褶皱冲刺。此时，她的喘息更多的是空气被迫从她体内排出，而不是对疼痛本身的任何反应。你胃部的巨大伤口随着你的动作撕裂得更宽，随着你臀部的每一次抽动，溢出更多的内脏。你在极乐中呻吟着，你的骨盆紧绷着，因为你把精液喷满了她被掏空的器官。");
         outputText("[pg]你喘了口气，擦了擦额头，对这场嬉戏的高潮感到非常满意。你的地精伴侣似乎还活着，尽管她的眼睛茫然地盯着。她撑不了多久了。也许它可以用来吓唬其他同类。你收拾好装备，回到营地，因为甜蜜的释放而兴高采烈。");
         get_player().orgasm("Dick");
         if(!get_player().hasPerk(PerkLib.HistoryDEUSVULT))
         {
            dynStats(DynStat.Cor(6));
         }
         var _loc1_:IMap = KFLAGS.flags;
         FlagDict_Impl_.arrayWriteInt(_loc1_,2204,FlagDict_Impl_.arrayReadInt(_loc1_,2204) + 1);
         get_combat().cleanupAfterCombat();
      }
      
      public function gobboShotaRape() : void
      {
         var _loc1_:int = get_player().cockThatFits(get_monster().vaginalCapacity());
         outputText("地精迈着饥渴、性感的步伐走到你倒下的身体旁，扭动着臀部。[say: 哎呀，看来我对这么小的人来说可能太粗暴了点。别担心，我正好有你需要的药。]她从一个小袋子里拿出一个装满粉色液体的小瓶子。轻轻一扭，她拔掉了软木塞。[pg]她把全身的重量都压在你的肚子上，让你突然喘不过气来，她那丰满的臀部和圆润的乳房诱人地晃动着。还没等你再吸一口气，她已经用两根细长的绿色手指捏开你的嘴唇，另一只手把瓶子凑到你嘴边。你试图躲开瓶子，但由于" + (get_player().get_HP() <= 1 ? "你的伤势" : "让你头晕目眩的灼烧感") + "，再加上地精女士那曲线优美的身体压住了你娇小的身躯，你的挣扎毫无结果。她毫不费力地把粉色液体倒进你嘴里，还温柔地揉了揉你的喉咙，以确保你咽下去。");
         outputText("[pg]药水立刻起了作用，一股灼热感传遍全身，让你的乳头凸起，胯下也感到一阵酥麻的温暖。她双手敏捷地伸到后面抓住你的男根；没过多久，在她充满爱意的抚弄下，你已经硬得像石头一样。地精女孩没有浪费时间做更多的前戏，她只是像一只即将吃到奶油的猫一样弓起背，故意缓慢地将她丰满的臀部滑向你的肉棒。");
         outputText("[pg]她的眼睛专注地看着你，她那微微张开的阴唇擦过你的龟头，随着她越坐越深，极其缓慢地将你包裹起来。她舔了舔光泽的嘴唇，向你飞吻，然后猛地坐到底，将你的每一寸长度都吞没。[pg]");
         if(get_player().cocks[_loc1_].cockLength < 5)
         {
            outputText("她弓起背，露出一丝坏笑，向你展示你那小巧的男根在她小腹上顶出的微小凸起。[say:嗯，我想对这么年轻的人期望太高有点自私。别担心，宝贝，我需要的是你内在的东西。]");
         }
         else
         {
            outputText("[pg]她进一步弓起背，骄傲地展示着你的男根在她紧致的小腹上顶出的凸起。她一边拨弄着自己的阴蒂，一边娇喘着，[say:嗯，你真是充满了惊喜。我从没想过这么年轻的人能有这么完美的尺寸，刚好填满我贪婪的小穴。]她的臀部开始上下摩擦，眼神中闪过一丝渴望，[say:不过，种马，这可不只是外表。你能填满我吗？让我饥渴的小穴怀孕？]她问道。");
         }
         outputText("[pg]你的身体因欲望而变得虚弱，除了呻吟和服从这位地精女士外，什么也做不了，你被眼前晃动的丰满绿色乳房和她紧致湿润的小穴迷住了。你能感觉到它在你周围起伏，有节奏地挤压和榨取，仿佛要把你吸干。当你开始迎合她的动作，挺动臀部将她顶起又落下，让她那被皮革包裹的乳房为你晃动时，地精发出了少女般的咯咯笑声。光线从她的穿环上反射出来，随着它们的晃动，散发出令人迷醉的光芒。这个风骚的荡妇从身后某处拿出一个烧瓶并拔掉塞子，释放出一股带有樱桃香味的红色烟雾。");
         outputText("[pg][say:现在是你的第二剂药。喝下去，这样你就能为我准备好浓稠的精液了，]她命令道，伸长手臂将第二个烧瓶按在你的嘴唇上。你摇摇头，试图避开她奇怪药物的又一次剂量，但她将烧瓶倾斜，把大部分液体倒进了你的喉咙。这一次，一阵眩晕感流遍全身，伴随着令人放松的温柔暖流，让你很容易放松下来，任由那个可爱的绿色荡妇吞吐你的肉棒。");
         outputText("[pg]她伸手向下");
         if(get_player().balls > 0)
         {
            outputText("一只手托住你的[balls]，随着药物开始起效，她轻轻地揉捏着。");
         }
         else
         {
            outputText("一只手捏住你的会阴，随着药物的作用，你的前列腺突然开始肿胀，她咯咯地笑了起来。");
         }
         outputText("[pg]很快，你感到你年轻的胯部有一种奇怪的饱胀感，仿佛随时都会爆裂，你肯定已经把先列腺液滴进了地精饥渴的小穴里。她心领神会地拍了拍你的胸膛，慢慢地前后摇晃，满足地叹了口气。[say: 感觉到了吗，亲爱的？那是我特制的炼金药剂，能让你的身体进入一种极其强效的……好吧，你年轻的脑瓜只需要知道，几秒钟后你就会有太多精液憋不住了，你必须为我射出来，]她柔声说道。[say: 准备好了吗，宝贝？别憋着了，我的小穴正等着呢。][pg]你被药物迷得神魂颠倒，无法理解地精女士的话，你的[cock]却高兴地自己做出了反应，随着你腹部肌肉因高潮的力量而收缩，它微微变粗。当第一股精液溅在她的子宫颈上时，地精的瞳孔缩小，翻起了白眼。当压力积聚并开始填满她的子宫时，她颤抖起来。你再次收缩，这次随着药效开始消退，你紧紧地压着她。她的肚子因为里面塞满了精液而微微撑起，但感觉似乎还没有结束。[pg]她流着口水，舌头淫荡地从嘴里伸出来，你把一发又一发的精液泵入她肥沃的子宫；最终，在头晕目眩的恍惚中，你感觉到一切都结束了。[pg]地精恢复了意识，从你小小的身体上翻身下来，抓着自己的肚子，幸福地微笑着，然后踉踉跄跄地站了起来。[say: 嗯，看来年龄根本不是问题。等你的女儿们出生了，我得告诉她们去哪找你。你给了我建立自己部落的资本！]肿胀的地精拍了拍你还在滴水的阴茎，俯下身，用她光泽的嘴唇给了你一个湿吻。在恍惚中，你漫不经心地红了脸，闭上了眼睛，在你昏过去之前，你几乎没有意识到她的口红里被下了药。");
         get_player().orgasm("Penis");
         get_combat().cleanupAfterCombat();
      }
      
      public function gobboRapeIntro() : void
      {
         clearOutput();
         if(get_monster().get_HP() < 1)
         {
            outputText("地精倒在地上，胸部被压得扁扁的，疼得轻声哭泣。她抬起头看着你，抽泣着。");
         }
         else
         {
            outputText("地精呻吟着仰面躺下。她双腿大张，展现出惊人的柔韧性，一只手探入小穴，另一只手开始轮流揉捏她那穿环的乳头。这副景象成功地挑起了你的欲望。");
            dynStats(DynStat.Lust(20));
         }
         if(get_player().get_lust() < 33)
         {
            outputText("[pg]<b>你还没饥渴到要去强奸她的地步。</b>");
         }
         generateGobboSexMenu();
      }
      
      public function gobboGetsRapedMaleFits() : void
      {
         spriteSelect(gobboSprite);
         var _loc1_:int = get_player().cockThatFits(get_monster().vaginalCapacity());
         if(_loc1_ < 0)
         {
            _loc1_ = get_player().biggestCockIndex();
         }
         clearOutput();
         get_images().showImage("goblin-win-male-getridden");
         if(get_player().cockArea(_loc1_) > get_monster().vaginalCapacity() * 0.8)
         {
            outputText("你抱起被击败的地精，打量着她。她可怜巴巴地将双臂交叉在胸前，问道：[say: 现在怎么办？]当她以为你没注意时，眼睛向下瞟去。看到你" + get_player().cockDescript(_loc1_) + "的尺寸，她的脸上短暂地闪过一丝痛苦的表情。你产生了一个想法，要给她塞进她无法承受的阴茎，于是你将她放低，靠近你的" + get_player().cockDescript(_loc1_) + "。龟头滑入她湿润的阴唇之间，撑开了她，也减轻了你手臂上的一些重量。她微微皱眉，双腿尽可能地环绕住你的[hips]。[pg]");
            outputText("你开始走动，让你的动作配合重力，让你毫不费力地插入她。当她向下滑动时，那些肿胀湿润的肉壁紧紧地夹住你，");
            if(get_player().cocks[0].get_cockType() == CockTypesEnum.DEMON)
            {
               outputText("痛苦地摩擦着你恶魔般的凸起");
            }
            else if(get_player().hasKnot(0))
            {
               outputText("痛苦地撑开，包裹着你的肉结");
            }
            else if(get_player().cocks[0].get_cockType() == CockTypesEnum.HORSE || get_player().cocks[0].get_cockType().get_Index() > 3)
            {
               outputText("感觉紧紧地包裹着你，令人痛苦");
            }
            outputText("。随着你的每一步，她滑得更深，将她撑到了极限，直到她几乎完全被你刺穿，她抓住了你的");
            if(get_player().biggestTitSize() >= 1)
            {
               outputText(get_player().allBreastsDescript());
            }
            else
            {
               outputText("躯干");
            }
            outputText("来支撑自己。随着这个绿皮女孩的呼吸，一阵稳定的脉动按摩着你。你意识到她身体的很大一部分一定是为了容纳怪物的阴茎而存在的，难怪地精在战斗中如此脆弱！[pg]");
            outputText("她开心地喘着气，舌头从嘴里伸出来，评论道：[say:好满……]她还在因为体内的怪物而皱眉，但她开始为你加油，[say:哦，快——啊——快点！我想弹起来！][pg]");
            outputText("这就是你所需要的所有鼓励，你开始跑起来，感觉她轻盈的身体在你的" + get_player().cockDescript(_loc1_) + "上弹跳，发出一阵阵从快乐的哀嚎和呻吟到轻微的痛苦叫喊的混杂声音。她的小拳头紧紧抓住你的");
            if(get_player().biggestTitSize() >= 1)
            {
               outputText("乳房");
            }
            else
            {
               outputText("皮肤");
            }
            outputText("当她挂在你身上时，紧紧抓住并把她丰满的乳房压向你。你用力奔跑，感觉她弹跳和扭动，她的阴户和急促的呼吸以前所未有的方式挤压和榨取你。你确信如果你每次慢跑都能有这种感觉，你的身材一定会很好。[pg]");
            outputText("[say:哦，操，种马，让我弹起来！对，就是这样，]她呻吟着，[say:你要射了吗？哦，天哪，请射吧，我需要你像这样填满我！][pg]");
            outputText("高潮即将来临的熟悉紧绷感在你的腹股沟蔓延，随着你接近释放而越发强烈。你加快了速度，全力冲刺，让女孩在你身上颠簸摇晃，她紧紧地攀附着你，完全由你的" + get_player().cockDescript(_loc1_) + "支撑着。");
            if(get_player().balls > 0)
            {
               outputText("你的[balls]收紧，释放出高潮的种子。");
            }
            outputText("当你射精时，强烈的性高潮嚎叫声充满了你的耳朵，也引发了这个绿色小肉便器的高潮。她的一只手松开，开始抚摸她的肚子，同时亲吻和舔舐你的肚脐。");
            if(get_player().cumQ() >= 100)
            {
               outputText("你强化的身体轻松地将她填满了浓浆，让她的肚子微微凸起，你的种子深深地埋在她的子宫里，无处可逃，她的小穴被你的" + get_player().cockDescript(_loc1_) + "紧紧地堵住了。");
            }
            if(get_player().cumQ() >= 500)
            {
               outputText("这次高潮如此猛烈，以至于当你停下来时，她看起来就像怀了一个健身球那么大的孕肚。你的精液被困在她的体内，在她的肉壁和你的" + get_player().cockDescript(_loc1_) + "之间找不到任何缝隙流出。");
            }
            else if(get_player().cumQ() >= 250)
            {
               outputText("这次高潮如此猛烈，以至于当你停下来时，她看起来已经大腹便便了。你的精液在她的肉壁和你的" + get_player().cockDescript(_loc1_) + "之间找不到任何缝隙流出。");
            }
            outputText("[pg]");
            outputText("你喘着粗气停了下来，把被填满的地精从你身上拉开，放在地上，满意地微笑着，看着你的精液");
            if(get_player().cumQ() >= 250)
            {
               outputText("像河水一样涌出");
            }
            else
            {
               outputText("漏出");
            }
            outputText("从她现在大张的阴户里。她揉了揉肚子，向你飞吻，还在努力喘气。你得意地笑了笑，开始重新穿衣服。完成后，你开始走开，但她最后一次向你喊道：[say:嗯嗯，我希望你不介意我再来找你。我需要更多你的精液，这样我就可以给你很多漂亮的荡妇来操！][pg]");
            if(get_player().cor > 50)
            {
               outputText("轻笑着");
            }
            else
            {
               outputText("颤抖着");
            }
            outputText("，你心满意足地回到了营地。");
         }
         else
         {
            outputText("你抱起被击败的地精，打量着她。她可怜巴巴地将双臂交叉在胸前，问道：[say:现在怎么办？]当她以为你没注意时，她的目光向下游移。你暗自思忖“英雄所见略同”，然后将她放低，对准你的" + get_player().cockDescript(_loc1_) + "。龟头滑入她湿润微张的阴唇之间，擦过她的入口，为你分担了她的一些重量。她变成了斗鸡眼，开心地笑着，将双腿尽可能地缠绕在你的[hips]上。[pg]");
            outputText("你开始走动，让动作配合重力，使你毫不费力地插入她。当她向下滑动时，那些肿胀湿润的肉壁紧紧地夹住你");
            if(get_player().cocks[0].get_cockType() == CockTypesEnum.DEMON)
            {
               outputText("完美地摩擦着你的恶魔凸起");
            }
            else if(get_player().hasKnot(0))
            {
               outputText("紧紧地撑开包裹着你的肉结");
            }
            else if(get_player().cocks[0].get_cockType() == CockTypesEnum.HORSE || get_player().cocks[0].get_cockType().get_Index() > 3)
            {
               outputText("包裹着你感觉绝对完美");
            }
            outputText("。随着你迈出的每一步，她滑得更深，直到她完全被你刺穿，抓住你的");
            if(get_player().biggestTitSize() >= 1)
            {
               outputText(get_player().allBreastsDescript());
            }
            else
            {
               outputText("躯干");
            }
            outputText("来支撑自己。随着这个绿皮女孩的呼吸，一阵稳定的律动按摩着你，让你意识到她身体的很大一部分一定是为了容纳巨大的阴茎而生的。[pg]");
            outputText("她开心地喘着气，舌头从嘴里伸出来，为你加油打气：[say:哦哦，快——啊——再快点！我想颠起来！][pg]");
            outputText("这就是你需要的全部鼓励，你开始奔跑，感觉她轻盈的身体在你的" + get_player().cockDescript(_loc1_) + "上颠簸，引出一阵阵快乐的哀号和呻吟。她的小拳头紧紧抓住你的");
            if(get_player().biggestTitSize() >= 1)
            {
               outputText("乳房");
            }
            else
            {
               outputText("皮肤");
            }
            outputText("她紧紧抱住你，收紧并用她丰满的乳房撞击你。你用力奔跑，感觉她颠簸扭动，她的阴户和急促的呼吸开始前所未有地挤压和榨取你。你确信，如果每次慢跑都能有这种感觉，你的身材一定会很棒。[pg]");
            outputText("[say:哦，操，猛男，颠我！对，就是这样，]她呻吟着，[say:你要射了吗？天哪，求你射吧，我需要你这样填满我！][pg]");
            outputText("即将高潮的熟悉紧绷感在你的腹股沟蔓延，随着你接近释放而越来越紧。你加快了步伐，全力冲刺，让女孩紧紧抱住你时上下颠簸摇晃，完全由你的" + get_player().cockDescript(_loc1_) + "支撑着。");
            if(get_player().balls > 0)
            {
               outputText("你的[balls]收紧，释放出高潮的种子。");
            }
            outputText("当你射精时，强烈的性高潮嚎叫声充满了你的耳朵，也引发了这个绿色小肉便器的高潮。她的一只手松开，开始抚摸她的肚子，同时亲吻和舔舐你的肚脐。");
            if(get_player().cumQ() >= 250)
            {
               outputText("你强化的身体轻松地将她填满精液，使她的小腹微微凸起，并滴落在你的");
               if(get_player().balls > 0)
               {
                  outputText(get_player().ballsDescriptLight());
               }
               else
               {
                  outputText("腿");
               }
               outputText("。");
            }
            if(get_player().cumQ() >= 500)
            {
               outputText("这次高潮如此猛烈，以至于当你停下来时，她看起来已经大腹便便了，你的精液从她的肉壁和你的" + get_player().cockDescript(_loc1_) + "之间能找到的任何缝隙中喷射而出。");
            }
            outputText("[pg]");
            outputText("你喘着粗气停了下来，把被填满的地精从你身上拉开，放在地上，满意地微笑着，看着你的精液");
            if(get_player().cumQ() >= 250)
            {
               outputText("像河水一样涌出");
            }
            else
            {
               outputText("漏出");
            }
            outputText("从她现在大张着的小穴里。她揉着肚子，向你飞吻，还在努力平复呼吸。你得意地笑了笑，开始重新穿上衣服。穿好后，你转身离开，但她最后一次对你喊道：[say: 嗯，希望你不介意我再来找你。我需要更多你的精液，这样我就能给你生好多漂亮的小母狗让你操！][pg]");
            if(get_player().cor > 50)
            {
               outputText("轻笑着");
            }
            else
            {
               outputText("颤抖着");
            }
            outputText("，你心满意足地回到了营地。");
         }
         get_combat().cleanupAfterCombat();
         get_player().orgasm("Dick");
      }
      
      public function gobboGetsRapedFem() : void
      {
         spriteSelect(gobboSprite);
         clearOutput();
         if(get_player().isTaur())
         {
            get_images().showImage("goblin-win-female-taur-rapedfem");
            outputText("你抱起地精，用手臂将她紧紧夹在身侧。你从她那淫荡的衣服上撕下一块柔软的皮革，把她的双手绑在背后，以确保她不能耍什么花招。她抬头看着你，眼睛睁得大大的，一想到要任由一个比她大得多的生物摆布，她就感到害怕。尽管如此，如果沾染在你侧腹的淫液能说明什么的话，她似乎被激起了不小的性欲。你低头看着她，说道：[say: 看来这个小骚货有受虐倾向啊？][pg]");
            outputText("她脸红了，随着她的点头，女性液体的流动变得更加浓稠。你知道她可能会喜欢你对她做的任何性行为，所以你还不如给她个惊喜。一个残酷的想法在你的脑海中形成——报复她试图给你下药。你轻松地从她的腰带上扯下小袋子，随机拿出几个瓶子。地精明白了你的意图，开始挣扎着想要挣脱，但你轻松地制服了这个较小的女人，强迫她把药吃进嘴里，一瓶接一瓶。当她试图吐出来时，你按摩她的喉咙，触发她吞咽的本能。[pg]");
            outputText("灌到第三瓶时，她已经放弃了挣扎，转而试图寻找你身体的某个部位来摩擦。她张大嘴巴，整张脸因欲望而涨成了紫红色。你强行喂完剩下的瓶子，然后松开她，在她落地前抓住了她的脚踝。她发情的味道以及所有药物和催情剂散发出的蒸汽让你产生了一点“接触性兴奋”，至少你的" + get_player().vaginaDescript(0) + "滴下了女性的淫液。你的欲望可以等等。这个婊子需要被惩罚。[pg]");
            outputText("你把这个生物翻转回你的臂弯，这次让她面向相反的方向。*啪！*你的手狠狠地打在她圆润的屁股上。你收回手，感觉到了她突出的阴唇带来的湿润。这个小婊子的小穴因渴望而发炎，仅仅是简单的打屁股就让她几乎要喷水了。你又打了一巴掌，看着她全身紧绷，感觉到她的体液溅到了你身上。[say: 你把我弄湿了，你个婊子！！坏母狗！]你骂道，打得更用力了。[pg]");
            outputText("地精尖叫起来，虽然你不确定是因为高兴还是痛苦。你开始越来越用力地打她的屁股，在反复的虐待下，她的屁股从绿色变成了红色。她全身开始抽搐和喷水，把她的蜜汁溅到了你的手臂上。她高潮了！好吧，在看了那样的表演之后，她也要让你高潮——否则！[pg]");
            outputText("这次你真的把她放下了，但不给她站起来的机会，粗暴地把你的" + get_player().vaginaDescript(0) + "压在她身上。她在你身下挣扎，太沉迷于自己的快感而没有意识到发生了什么。她的小拳头无力地捶打着你的臀部，感觉出奇的好，你允许这种情况持续了一会儿，直到你觉得“前戏”已经足够了，开始粗暴地把你的小穴在她的脸上摩擦，让她的舌头滑进你的褶皱里。[pg]");
            outputText("你看不见她在做什么，但她的挣扎很快就停止了，因为味道和气味刺激了她去舔舐。你颤抖着；这感觉比想象中要好得多。也许她的一些药水在她的嘴唇和舌头上留下了残留物，但你不在乎。你把更多的体重压在这个小荡妇身上，你的后腿因为快感而发软。她的反应是把手滑上来，捶打你的[clit]，试图把你从她身上弄下去。[pg]");
            outputText("她的努力得到了回报，你在这个被下药的绿色婊子身上高潮了，在她的舌头上留下了小穴的味道。她的脸上带着一种奇怪的呆滞笑容，看起来像是处于某种介于清醒和睡眠之间的奇怪状态。你看着她在地上抽搐扭动，大口喘气，不断高潮。虽然一开始你很担心，但抽搐开始减慢；这个小逼应该会没事的。[pg]");
            outputText("你漫不经心地穿上衣服，无视了那个沉浸在极乐中的地精的喘息和呻吟，准备离开。你回头看了一眼，发现她的体液已经汇聚成了一个比她还大的水坑。她醒来时可能会有严重的宿醉。你叹了口气，小跑着离开，对做得太过火感到有些内疚。");
            get_combat().cleanupAfterCombat();
            get_player().orgasm("Vaginal");
         }
         else if(get_player().isNaga())
         {
            get_images().showImage("goblin-win-female-naga-rapedfem");
            outputText("你滑行到那个无助的地精身边，她半是恐惧半是好奇地看着你。");
            if(get_player().face.type == 5)
            {
               outputText("你对她露出獠牙，她的好奇心消失了。她转身想跑，但你的尾巴比她更快。");
            }
            else
            {
               outputText("你对她微笑，她的恐惧消失了。不过她仍然很警惕，你确保在她改变对你的看法之前用尾巴抓住她。");
            }
            outputText("[pg]");
            outputText("你紧紧地缠住你挣扎的猎物，在这个过程中脱掉了她那荡妇般的“衣服”。失去行动能力的地精哀怨地向你呜咽，你的回应是用手拍打她的小穴。把手拿开时，你惊讶于它有多湿。你在她脸上擦干，然后把头凑到她耳边。[pg]");
            if(get_player().cor > 60)
            {
               outputText("你对这个惊恐的女人发出嘶嘶声，说了些语无伦次的话，她在你的掌控中开始发抖。你笑着把手指滑进她的嘴里，她开始吸吮它们，试图安抚你。她的小舌头感觉棒极了；显然她在这方面非常有经验。");
               outputText("你用手指撑开她的嘴。她很困惑，但当你摆弄身边的东西时，她无法反抗。她意识到即将发生什么时已经太晚了，你从她的袋子里拿出了几个闪亮的烧瓶。作为她试图毒害你的惩罚，你开始把一瓶又一瓶的药水倒进她的嘴里，抚摸她的喉咙，强迫她喝下去。[pg]");
            }
            else
            {
               outputText("当你的手指在她的脸上滑动时，你问她是否为试图毒害你而感到抱歉。她向你拼命点头，因为被束缚或害怕而无法回答。你对她愉快地微笑，感觉到她的身体在你的掌控中放松了一点。你的手指滑进她的嘴里，她急切地吸吮着，显然不想激怒你。她的舌头很有天赋，你享受了一会儿这种体验，直到你决定已经把她玩够了。[pg]");
               outputText("张开手指，你打开她的嘴，防止它闭上。困惑的地精试图看你在她身边做什么，但看不到。当你从她的袋子里拿出一把闪亮的烧瓶时，她的身体再次紧绷，向你呜咽。[pg]");
               outputText("不过，你对这个生物的怜悯还不足以阻止你惩罚她，你从这堆药水中挑出了一些看起来不那么强效的混合物。你轻轻抚摸她的喉咙以确保她吞咽，同时倒进一瓶又一瓶。[pg]");
            }
            outputText("效果很快就显现出来了，很快这个荡妇就变成了紫红色，拼命地想在你的盘绕上摩擦。她沮丧地喘息和呻吟，因为她滴水的小穴无法从你光滑的下腹部获得足够的快感，而你则等待着，享受着这种感觉。[pg]");
            outputText("你把尾巴滑到她的小穴上，用尖端捏住她的阴蒂。她立刻喷出一股体液，用更多的淫液彻底覆盖了你已经湿滑粘稠的盘绕。你在她面前摇晃手指责备她；你还没完呢。[pg]");
            outputText("你的尾巴顺滑地滑入她的体内，让她舒服得呻吟起来，扭动着臀部。你在里面蠕动，把她撑得那么大，你怀疑她会合不拢腿好一阵子。你的尾巴尖碰到了她爱道的尽头，你惊讶地发现她的子宫在跳动，试图抓住一些不存在的东西。出于好奇，你把尾巴移到开口处，它抓住了你，把你拖进她的子宫。你对着快感超载的地精微笑，开始抚摸内壁。她紧紧地夹住你，在狂喜中尖叫，眼睛翻白。[pg]");
            outputText("毫无预兆地，你拔出了整根尾巴，感觉到一股巨大的体液从你身后滑出。地精几乎失去了意识，所以你在她的袋子里四处寻找能帮忙的东西。不过似乎没有什么看起来能帮上忙，你开始后悔自己太恶毒了，这时你注意到最底部有一个特别小的烧瓶。[pg]");
            outputText("你把它拿出来检查。它只有一厘米多长，里面装满了白色的液体。上面有一个标签，但字太小了，看不清。你觉得你能认出[say:醒醒]这个词，但不完全确定。[pg]");
            outputText("你耸耸肩，把里面的东西倒进地精的嘴里，只有一滴多一点，很快就被她的舌头吸收了。有一会儿什么也没发生，然后这个小小的身影开始剧烈地颤抖。你不知道该怎么办，只是保持原样，紧紧地抱着她。不过颤抖和开始时一样突然停止了，你以为你可能杀了她。[pg]");
            outputText("不过，这很快就被证明是大错特错了，因为她猛地睁开眼睛，大喊[say:呜呼！]你对她举止的突然改变感到惊讶，但决定顺其自然，把你的" + get_player().vaginaDescript(0) + "塞进这个显然精力充沛的小生物体内。[pg]");
            outputText("你听到一声闷响[say:交给我吧老板！]，她开始舔舐并轻轻咀嚼你。这种感觉太棒了，你忍不住想知道小瓶里装的是什么，但当你高潮时，这个想法从你的脑海中被抹去了，你喷了她一身。[pg]");
            outputText("你不断地高潮，地精不知疲倦，你灌进她嘴里的各种物质的残留物仍然涂在她的嘴唇和舌头上，让你不想停下来。最后你累了，把地精从你的盘绕中释放出来。她双脚着地，做了一个脚尖旋转，在空地上跑了一会儿（一直像个疯婆子一样咯咯地笑），然后脸朝下倒在她的“衣服”上。[pg]");
            outputText("你对刚才发生的事情感到非常困惑，决定不拿命运开玩笑，不在这只被下了重药的生物附近逗留，一拿好东西就回营地。");
            get_combat().cleanupAfterCombat();
            get_player().orgasm("Vaginal");
         }
         else
         {
            get_images().showImage("goblin-win-female-rapedfem");
            outputText("你抱起地精，让她坐在你的膝盖上，用左手将她的双臂束缚在背后。你从她那淫荡的衣服上撕下一块柔软的皮革，用来绑住她的手臂。她抬头看着你，眼睛睁得大大的，一想到要任由一个更大的生物摆布，她就感到害怕。尽管如此，如果弄脏你膝盖的汁液能说明什么的话，她似乎被激起了不小的性欲。你低头看着她，说道，[say: 看来这小贱货还有受虐倾向啊？][pg]");
            outputText("她脸红了，随着她的点头，女性液体的流动变得更加浓稠。你知道她可能会喜欢你对她做的任何性行为，所以你还不如给她个惊喜。一个残酷的想法在你的脑海中形成——报复她试图给你下药。你轻松地从她的腰带上扯下小袋子，随机拿出几个瓶子。地精明白了你的意图，开始挣扎着想要挣脱，但你轻松地制服了这个较小的女人，强迫她把药吃进嘴里，一瓶接一瓶。当她试图吐出来时，你按摩她的喉咙，触发她吞咽的本能。[pg]");
            outputText("到了第三瓶，她已经放弃了挣扎，转而试图把她的小穴在你的膝盖上摩擦。她的嘴巴张得大大的，整张脸都因为欲望而涨得紫红。你强行喂完剩下的瓶子，推了她一把，抓住她的脚踝，把她按在你的腿上，屁股撅在半空中。她发情的味道以及所有药物和春药的蒸汽让你有点“接触性兴奋”，至少在某种意义上，你的" + get_player().vaginaDescript(0) + "");
            if(get_player().vaginas[0].vaginalWetness < 2)
            {
               outputText("变得肿胀湿润");
            }
            else if(get_player().vaginas[0].vaginalWetness < 4)
            {
               outputText("滴下女性的湿润");
            }
            else if(get_player().vaginas[0].vaginalWetness < 5)
            {
               outputText("慢慢开始浸湿你的大腿");
            }
            else
            {
               outputText("因渴望而流口水，在你身下积成水坑");
            }
            outputText("。你的性欲可以等。这个荡妇需要受到惩罚。[pg]");
            outputText("*<b>啪</b>！* 你的手拍在她圆润的屁股上。你向后拉，感觉到她突出的阴唇带来的湿润。这小婊子的小穴因为渴望而发炎，仅仅是打一下屁股，她就几乎要喷水了。你又拍了她一下，看着她全身紧绷，感觉到她的体液溅到你身上。[pg]");
            outputText("[say: 你把我弄湿了，你这贱人！！坏婊子！] 你骂道，打得更用力了。[pg]");
            outputText("地精尖叫起来，虽然你不确定是因为高兴还是痛苦。你开始越来越用力地打她的屁股，在反复的虐待下，她的屁股从绿色变成了红色。她全身开始抽搐和喷水，把她的蜜汁溅到了你的手臂上。她高潮了！好吧，在看了那样的表演之后，她也要让你高潮——否则！[pg]");
            outputText("你把她从你的腿上拉下来，把她的脸按进你的" + get_player().vaginaDescript(0) + "里。她在你身上挣扎，太沉迷于自己的快乐而没有意识到发生了什么。你强行把她丰满的小嘴唇放在你的阴部上摩擦，让她的舌头滑进你的褶皱里。她的眼睛变成了白色的小缝，瞳孔向上翻得看不见，但里面有足够的东西让她的舌头认出味道并开始舔舐。你颤抖着；感觉比应该的要好得多。也许她的一些药水在她的嘴唇和舌头上留下了残留物，但你不在乎。[pg]");
            outputText("你在这个被下了药的绿色婊子身上高潮了，");
            if(get_player().vaginas[0].vaginalWetness > 4)
            {
               outputText("把你的体液溅到她身上");
            }
            else if(get_player().vaginas[0].vaginalWetness > 3)
            {
               outputText("用你快乐的证明涂满她的脸");
            }
            else if(get_player().vaginas[0].vaginalWetness > 2)
            {
               outputText("让她沾满你的下体汁液");
            }
            else
            {
               outputText("在她的舌头上留下小穴的味道");
            }
            outputText("。");
            if(get_player().biggestLactation() >= 3.5)
            {
               outputText("乳汁从你的乳头喷涌而出，浸透了这个娇小的荡妇。");
            }
            else if(get_player().biggestLactation() > 2)
            {
               outputText("两股乳汁浸透了荡妇的头发，像白色的眼泪一样顺着她的脸流下来。");
            }
            else if(get_player().biggestLactation() >= 1)
            {
               outputText("乳汁从你的乳头滴落，落在小荡妇的头发上。");
            }
            outputText("她的脸上挂着一种奇怪的痴呆笑容，看起来像是处于一种介于清醒和睡眠之间的奇怪状态。你抓住她的头发把她扔在地上，看着她的身体随着高潮的持续而抽搐和跳动。看起来高潮开始减弱了，这个小贱货应该没事了。[pg]");
            outputText("你随意地穿上衣服，无视了那个沉浸在极乐中的地精的喘息和呻吟，准备离开。你回头看了最后一眼，发现她的体液已经汇聚成了一个比她还大的水坑。她醒来时大概会经历一场地狱般的宿醉。你");
            if(get_player().cor > 50)
            {
               outputText("坏笑");
            }
            else
            {
               outputText("叹了口气");
            }
            outputText("，然后漫步离开，感觉");
            if(get_player().cor < 50)
            {
               outputText("对自己做得太过火有点内疚。");
            }
            else
            {
               outputText("对你的复仇感到非常满意。");
            }
            get_combat().cleanupAfterCombat();
            get_player().orgasm("Vaginal");
         }
      }
      
      public function gobboButtSecks() : void
      {
         spriteSelect(gobboSprite);
         var _loc1_:int = get_player().cockThatFits(get_monster().analCapacity());
         if(_loc1_ < 0)
         {
            _loc1_ = 0;
         }
         clearOutput();
         get_images().showImage("goblin-win-male-buttsex");
         outputText("像往常一样，你轻松击败了另一个淫荡的地精。你对自己的实力有过怀疑吗？知道接下来会发生什么，地精为不可避免的事情做好了准备。她舔着嘴唇，脸上因兴奋而泛红。为了进一步刺激你，她张开双腿，露出更多湿透的小穴。[pg]");
         outputText("[say: 操我，猛男！]她乞求道。虽然战败了，她居然还有胆量提要求。[say: 把你的子孙液灌满我！]她的失败似乎并没有让她的嘴巴安分下来。[pg]");
         outputText("你感到被侮辱了。刚才的战斗是谁赢了？要不是你自己也欲火焚身，你大可把她丢在那儿，让她在自己的淫液里打滚。所以你该怎么做？经过片刻的沉思，你产生了一个极其邪恶的念头。[pg]");
         outputText("你迅速脱下[armor]，撕掉这绿皮女人身上仅存的几片衣物。你轻而易举地把她从地上举起，将她对准你的" + get_player().cockDescript(_loc1_) + "。这个小地精婊子被你迷得神魂颠倒，身体因兴奋而颤抖。[pg]");
         outputText("你冷笑一声，握住你的" + get_player().cockDescript(_loc1_) + "的冠部，没有抵住她湿透的阴唇，而是抵住了她的屁眼！[pg]");
         outputText("[say: 不要那里！]她嘴唇颤抖，眼含泪水地乞求道。[say: 我需要你的精液来建立我自己的部落！]她解释道。[pg]");
         outputText("你对怀里颤抖的女人一言不发。没有任何言语能形容你粉碎她梦想时感到的快乐。老天啊，这个世界真的腐化了你，而你乐在其中！[pg]");
         outputText("你毫不留情地将这个地精婊子猛地按在你的" + get_player().cockDescript(_loc1_) + "上，几乎把她刺穿了！她屁眼瞬间传来的紧致感几乎让你爽上天！她越是挣扎，她的臀部肌肉就把你夹得越紧。你在狂喜中僵住了一会儿，舌头耷拉在嘴外，双眼翻白。[pg]");
         outputText("地精抗议着，扭动得更厉害了，甚至用拳头捶打你的胸膛；但她现在太虚弱了，她的捶打实际上就像在挠痒痒。她微弱的攻击足以将你从肉欲的迷乱中唤醒。你狂热地咧嘴笑着，抓住她纤细的腰肢，狠狠地操她！随着你越插越深，越插越用力，你的" + get_player().cockDescript(_loc1_) + "很快就适应了她被撑开的屁眼！[pg]");
         outputText("[say: 这不是我想要的！]她哭喊着，[say: 这不是我想要的！]如果你的" + get_player().cockDescript(_loc1_) + "撑开她的屁眼还不够的话，她还能感觉到你的");
         if(get_player().balls > 0)
         {
            outputText(get_player().sackDescript());
         }
         else
         {
            outputText(get_player().hipDescript());
         }
         outputText("随着每一次抽插，都在拍打她丰满的臀部，仿佛在戏弄她。[pg]");
         outputText("地精屁眼紧致的空间对你来说太刺激了。你的身体剧烈地抽搐着，将大量的精液射入她的体内。发泄完后，你把这个小婊子扔到地上；你现在对她已经没有用了。[pg]");
         outputText("当你捡起[armor]开始穿衣服时，你瞥了一眼那个地精。她的双手开始在她现在被撑开的肛门里抠挖，拼命地想要收集你射在她里面的精液。你得意地笑了笑，若无其事地走开了，对自己非常满意。");
         get_combat().cleanupAfterCombat();
         get_player().orgasm("Dick");
      }
      
      public function giveGoblinAMilkMustache() : void
      {
         clearOutput();
         outputText("你慢慢走向倒地的地精，温柔地告诉她现在一切都会好起来的。她有些怀疑地看着你，张开双腿，显然希望你能满足她的欲望。你对她摇摇头，双手托起你那" + get_player().biggestBreastSizeDescript() + "，告诉她现在是喂奶时间。地精有些恼怒地看着你，说道：[say: 我才不要你的胸部！我要你的下半身！]你笑着抓住她的手臂，把它们拉到她的脑后。[pg]");
         outputText("她在你的钳制下挣扎，试图把什么东西，任何东西塞进她那饥渴的小穴里，同时大喊：[say: 来吧，你这个" + get_player().mf("荡妇","种马") + "，我知道你想要的——唔！]你把她的嘴按在你的" + get_player().nippleDescript(0) + "上，打断了她的话。她不由自主地喘了口气，嘴里灌满了你的乳汁。她瞬间僵住了，然后慢慢咽下嘴里的乳汁。片刻之后，她在你怀里放松下来，温柔地吸吮着你的乳头。她以前那充满欲望的样子不见了，取而代之的是一个温顺的女孩，现在除了你的乳汁什么都不想要。你慢慢放下手，开始揉搓她仍然湿润的小穴。作为回应，她把手放在你的另一个[nipple]上，把玩着它，挑逗着你。[pg]");
         outputText("过了一会儿，你感觉到地精在你怀里睡着了。即使这样，她仍然继续温柔地吸吮着你的[nipple]。你满意地笑了笑，轻轻地把地精从你的胸前抱开。你轻轻拍了拍她的肩膀，她又醒了过来。她有些茫然地看了你一眼，然后你轻轻推了她一下，她开始带着空洞、流口水的眼神走开了。");
         dynStats(DynStat.Lib(0.2),DynStat.Lust(-50));
         get_player().addStatusValue(StatusEffects.Feeder,1,1);
         get_player().changeStatusValue(StatusEffects.Feeder,2,0);
         get_combat().cleanupAfterCombat();
      }
      
      public function generateGobboSexMenu(param1:Class = undefined) : void
      {
         var mode1:Number;
         var _g1:GoblinScene;
         var mode:Number;
         var _g:GoblinScene;
         if(param1 != null)
         {
            gobboSprite = param1;
         }
         else
         {
            gobboSprite = SpriteDb.get_s_goblin();
         }
         spriteSelect(gobboSprite);
         menu();
         addButtonDisabled(0,"鸡巴操","这个场景需要你有一根合适的鸡巴。","鸡巴操");
         addButtonDisabled(1,"鸡巴太大","这个场景需要你有一根过大的鸡巴。","鸡巴太大");
         addButtonDisabled(2,"堕落大鸡巴","这个场景需要你有一根过大的鸡巴和高腐化。","堕落大鸡巴");
         addButtonDisabled(3,"鸡巴插屁眼","这个场景需要你有一根鸡巴和高腐化。","鸡巴插屁眼");
         addButtonDisabled(4,"慢跑操","这个场景需要你有一根合适的鸡巴。","慢跑操");
         addButtonDisabled(5,"母乳喂养","这个场景需要你有足够的乳汁。","母乳喂养");
         addButtonDisabled(6,"使用避孕套","这个场景需要你有避孕套或者蜘蛛腹部以及合适的鸡巴。","使用避孕套");
         addButtonDisabled(7,"小穴","这个场景需要你有一个阴道。","小穴");
         addButtonDisabled(8,"产卵","这个场景需要你有一个蛛化精灵产卵管和一些卵。","产卵");
         if(get_goreEnabled())
         {
            addButtonDisabled(10,"子宫操","这个场景需要你有一根合适的鸡巴。","子宫操");
         }
         if(get_player().hasVagina() && get_player().get_lust() >= 33)
         {
            if(get_player().isLoli())
            {
               addButton(7,"小穴",goblinLoliScene);
            }
            else
            {
               addButton(7,"小穴",gobboGetsRapedFem);
            }
         }
         if(get_player().hasCock() && get_player().get_lust() >= 33)
         {
            if(get_player().cockArea(get_player().biggestCockIndex()) > get_monster().vaginalCapacity() && (get_player().isCorruptEnough(80) || get_player().hasPerk(PerkLib.Sadist)))
            {
               addButton(2,"堕落大鸡巴",rapeAGoblinCorruptTooBig);
            }
            if(get_player().cockArea(get_player().biggestCockIndex()) > get_monster().vaginalCapacity())
            {
               addButton(1,"鸡巴太大",manRapesGoblinTooBig);
            }
            if(get_player().hasCockThatFits(get_monster().vaginalCapacity()))
            {
               addButton(0,"鸡巴操",gatsGoblinBoners);
               addButton(4,"慢跑操",gobboGetsRapedMaleFits);
               if(get_goreEnabled())
               {
                  addButton(10,"子宫操",gobboWombFuck).hint("切出地精的子宫并狠狠地捣弄它。");
               }
            }
            if(get_player().cockThatFits(get_monster().analCapacity()) >= 0 && (get_player().isCorruptEnough(70) || get_player().hasPerk(PerkLib.Sadist)))
            {
               addButton(3,"后庭插入",gobboButtSecks);
            }
            if(get_player().tail.type == 5 && get_player().hasCockThatFits(get_monster().vaginalCapacity()))
            {
               _g = this;
               mode = 0;
               addButton(6,"蛛网避孕套",function():void
               {
                  _g.goblinCondomed(mode);
               });
            }
            else if(get_player().hasItem(get_useables().CONDOM) && get_player().hasCockThatFits(get_monster().vaginalCapacity()))
            {
               _g1 = this;
               mode1 = 1;
               addButton(6,"使用避孕套",function():void
               {
                  _g1.goblinCondomed(mode1);
               });
            }
            if(get_watersportsEnabled() && get_player().cockThatFits(60) >= 0)
            {
               addButton(9,"深喉与撒尿",facefuckPiss).hint("深喉地精，然后释放自己");
            }
         }
         if(get_player().canOvipositSpider())
         {
            addButton(8,"产卵",laySomeDriderEggsInGobboTwat);
         }
         if(get_player().lactationQ() >= 500 || get_player().hasStatusEffect(StatusEffects.Feeder))
         {
            addButton(5,"母乳喂养",giveGoblinAMilkMustache);
         }
         if(get_player().hasMultiTails())
         {
            addNextButton("强行梳毛",get_game().forest.kitsuneScene.kitsuneGenericFluff).hint("让[themonster]给你梳理尾巴。").sexButton(-1);
         }
         setSexLeaveButton();
      }
      
      public function gatsGoblinBoners() : void
      {
         clearOutput();
         var _loc1_:int = get_player().cockThatFits(get_monster().analCapacity());
         if(_loc1_ < 0)
         {
            _loc1_ = get_player().smallestCockIndex();
         }
         get_images().showImage("goblin-win-male-goblinboners");
         outputText("地精趴在地上，因为战斗而筋疲力尽。她丰满的双腿无意中张开，屁股高高撅起，让你清楚地看到她湿润的小穴，她正试图让自己高潮。看来这个绿皮荡妇已经把你忘了——太多次徒劳的遭遇可能让她放弃了寻找一个强壮的雄性来用精液填满她的希望。[pg]");
         outputText("对她来说幸运的是，你完全打算改变这一点。[pg]");
         outputText("你开始抚摸你的阴茎");
         if(get_player().cockTotal() > 1)
         {
            outputText("");
         }
         outputText("当你走向那个毫无防备的地精女孩时，你欣赏着她那完美的圆润脸颊随着她急促的动作而晃动，她柔软的大腿紧紧夹住双腿间那只急切的手。你俯下身，迅速抓住地精丰满的臀部，女孩惊讶地尖叫了一声，转过身来，看到了你勃起的长度");
         if(get_player().cockTotal() > 1)
         {
            outputText("");
         }
         outputText("。[pg]");
         outputText("[say:哇-哇！嘿，帅哥，你在后面想干嘛？]她尖叫道，对你的突然出现感到惊讶多于害怕。你没有回答，而是决定抓住你的阴茎");
         if(get_player().cockTotal() > 1)
         {
            outputText("");
         }
         outputText("并拍打");
         if(get_player().cockTotal() == 1)
         {
            outputText("它");
         }
         else
         {
            outputText("它们");
         }
         outputText("在她光秃秃的屁股上，而你的受害者则焦急地等待着你的下一步动作。你花时间用双手按摩着地精荡妇的屁股，然后把你的" + get_player().cockDescript(_loc1_) + "滑进她柔软的臀瓣之间。你饥渴的受害者显得很不耐烦，试图在你身上摩擦，同时张开她湿润的阴唇，热情地表示她找到了一个愿意和她交配的人。你用力拍打她的屁股，同时加快了抽插的速度——就在你最终插入的前几秒");
         if(get_player().cockTotal() == 1)
         {
            outputText("你的阴茎插入这个气喘吁吁的荡妇体内，当你进入她紧致的小穴时，猛烈地把她向前推");
         }
         else if(get_player().cockTotal() == 2)
         {
            outputText("你两根鸡巴都插进了这个气喘吁吁的婊子体内，当你进入她紧致的小穴和屁眼时，猛烈地将她向前推");
         }
         else
         {
            outputText("你的两根阴茎插在气喘吁吁的荡妇体内，当你进入她紧致的小穴和屁眼时，猛烈地将她向前推——你的另一根肉棒");
            if(get_player().cockTotal() >= 4)
            {
               outputText("");
            }
            outputText("则夹在她的屁股瓣之间");
         }
         outputText("。[pg]");
         outputText("你粗暴地操弄着地精女孩，紧紧抓住她的臀部，而她则发出愉悦的尖叫。你的腹股沟拍打她的声音在周围回荡，伴随着你的闷哼和地精狂喜的呻吟。你的受害者挣扎着想用手臂撑起身子，却又因为你侵入她体内的感觉而瘫软下去。[pg]");
         outputText("最终你开始感觉到自己即将达到高潮，随着你为释放做准备，你的动作越来越快。你身下的地精已经迷失在你" + get_player().cockDescript(_loc1_) + "带来的快感中，她双眼翻白，舌头伸出嘴外流着口水，而她那淫荡的脸庞则在你正操弄她的地面上摩擦。伴随着最后一次挺进，你的臀部向前猛冲，用浓稠的精液涂满她的体内，享受着你的精液将她填满并堵住她入口的感觉");
         if(get_player().cockTotal() == 2)
         {
            outputText("");
         }
         outputText("。你慢慢地从她紧致的身体里退出来，用剩下的精液覆盖她曲线优美的背部和翘挺的臀部作为结束。[pg]");
         outputText("你站起身来，慢慢地撸动着自己，精液从你的" + get_player().cockDescript(_loc1_) + "滴落到瘫倒的地精身上。她还需要一段时间才能恢复意识，但你确信当她醒来时，她会更好地体会到性爱的美妙。");
         get_player().orgasm("Dick");
         get_combat().cleanupAfterCombat();
      }
      
      public function facefuckPiss() : void
      {
         clearOutput();
         outputText("地精在战斗中耗尽了体力，跪倒在地。一层汗水在她绿色的皮肤上闪烁。她急促地喘息着，每一次吸气都让她的乳房紧紧贴在衣服的皮带上。她转过身背对着你，把头低在森林的地面上，向你展示自己。她等了一会儿，歪着头，睁大眼睛偷偷地看着你，希望你能来领取你的奖品。她的大腿颤抖着，小水珠聚集在她那被过度使用的小穴外唇周围。");
         outputText("[pg]过了一会儿，地精变得不耐烦了。她低吼着转向你。由于战斗的疲惫，她踉跄着向你走了几步，眼睛死死盯着你双腿之间的那包东西。当她走到你面前时，她饥渴地舔了舔嘴唇，抱住了你的一条[legs]。");
         outputText("[pg]你暗自窃笑，抓住女孩的头发，把她的头拉到一边。她无力地嘟囔着抗议，当你把她扶直时，她开始站立不稳。你解开[armor]上的搭扣，让你的[cock]自由摆动。地精的表情亮了起来，她发出一声放纵的呻吟，开始在你的大腿上乱抓，似乎在鼓励你把她扔进泥里，满足她对你种子的渴望。");
         outputText("[pg]操这个小地精的冲动在你心中滋长，但你脸上却露出了淫荡的笑容；她不会马上得到她想要的。");
         outputText("[pg]你的右手仍然抓着女孩紫色的短发。你用力一拉，让她的脸迎上你半勃起的[cock]。她心领神会，开始用手工作，手掌在你的肉棒上下套弄。一滴先列腺液在你的阴茎顶端形成，她贪婪地伸出舌头舔舐。她流着口水的嘴在你的鸡巴上游走，她唾液的小溪流向你的[balls]时，带来一阵刺痛感。当她的头开始有节奏地在你的命根子上上下摆动时，她的手慢了下来，每一次重复，顶端都会进一步深入这个婊子的喉咙。现在完全勃起了，你把手放在她尖尖的耳朵上，开始摇晃你的臀部，加快了深喉的速度：没过多久，她就吞下了你[cock]的全部长度，她的嘴唇擦过你的骨盆。");
         outputText("[pg]唾沫顺着你的阴囊流下，聚集在地精的下巴上，她一有机会就大口喘气。你的心率，从战斗中仍然很高，随着你体内欲望的建立而加快，你的[skinfurscales]在光线下闪耀，你把你的鸡巴捣进这个绿色荡妇的喉咙。你感觉到你的阴茎头在收缩，因为地精试图呼吸和咳嗽，她的颈部肌肉在你周围扭曲。");
         if(get_player().get_tallness() >= 80)
         {
            outputText("为了保持你贪婪的冲刺速度，你重新调整了你的脚步。在这样做的过程中，你把地精女孩举起来，直到她的脚完全离开地面，她的身体在你的膝盖旁在空中无力地前后摆动，半昏迷地接受你的虐待。");
         }
         outputText("[pg]很快，你达到了顶峰，你的睾丸开始收紧。你发出一声低沉的呻吟，浓稠的精液从你的肉棒喷出，顺着地精女孩的喉咙流下。你松开了抓着地精头的手，她从她体内滑出了大约三分之二的长度，但贪婪地吞下了每一股精液。当你的高潮消退时，你感觉到她的舌头慵懒地在你的龟头周围旋转，你的肉棒开始放松。");
         outputText("[pg]你的性冲动减弱了，但当你的膀胱压迫你的骨盆时，你感觉到了另一种冲动。一个邪恶的笑容再次穿过你的脸，你再次把手放在她的头上，强迫你的鸡巴再次进入地精被操得很好的喉咙。你感觉到她抗议时的嗡嗡声，她的手无力地压在你的大腿上，试图把你推回去。当你开始排泄时，反抗减弱了，温暖的尿液从你的[cock]流出，进入地精体内。你再次感觉到她的喉咙肌肉收缩，因为她试图吞下你的尿液。她结结巴巴地，几股咸咸的液体从她的嘴唇和鼻子周围漏出，把尿液溅在你的腿和她的脸上。对你仍然敏感的鸡巴的刺激压倒了你，你的膝盖开始颤抖。");
         outputText("[pg]当你的膀胱最后排空到这个绿色的精液套子里时，你倒在了一片茂盛的草地上，把地精女孩也拉了下来。你的手落在身体两侧，地精的嘴唇从你的鸡巴上弹开。由于粗暴的对待而失去知觉，她的嘴张开着，精液、尿液和唾液的粗糙混合物流出，粘在一片草地上。");
         outputText("[pg]你喘了口气。感到完全满足和宽慰，你收拾好装备，重新穿好衣服。当你准备离开时，你看到地精女孩的舌头淫荡地舔着几根草叶。");
         get_player().orgasm("Dick");
         awardAchievement("尿急惹祸",113,true,true,false);
         get_combat().cleanupAfterCombat();
      }
   }
}

