package classes.scenes.seasonal
{
   import classes.BaseContent;
   import classes.CoC;
   import classes.DynStat;
   import classes.DynStatOp;
   import classes.ItemType;
   import classes.Player;
   import classes._FlagDict.FlagDict_Impl_;
   import classes.globalFlags.KFLAGS;
   import classes.items.ConsumableLib;
   import classes.scenes.Camp;
   import classes.scenes.Inventory;
   import coc.view.CoCButton;
   import flash.Boot;
   
   public class XmasMisc extends BaseContent
   {
      
      public function XmasMisc()
      {
         if(Boot.skip_constructor)
         {
            return;
         }
         super();
      }
      
      public function unwrapPolarPete() : void
      {
         clearOutput();
         outputText("诱惑实在太大，你走近皮特。当他把臀部调整到与你齐平时，你跪倒在他面前。你的双手放在他深红色的裤子上，屏住呼吸将它们拉下。他那根乌黑的阴茎弹了出来，又长又肿胀，散发着热气，就在你的鼻子前。你的手在它光滑的黑色表面上摩擦，引得皮特发出一声满意的呻吟。");
         outputText("[pg][say:给我的南极点好好抛光一下，]他咕哝着。你抬起那根迅速膨胀的拐杖糖，仔细打量着皮特剃得干干净净的阴囊。你凑上前去，用舌头舔舐着皮特的蛋蛋，他那麝香般的气味在你的唇间萦绕。皮特肯定已经走了很长一段路，几乎没有休息，你能尝到他下体的一点汗水味，他的气味中充满了被忽视的渴望。");
         outputText("[pg]你抬起头，看到他仰着头，张大嘴巴，发出一声低沉的呻吟。你继续用唾液润滑这位充满节日气息的男人的阴囊，冷空气与他下体和你的口腔的温暖形成了鲜明的对比。当你嘴唇拂过他黑色巨物的根部时，唾液的温暖依然残留，你用手给这根坚硬的肉棒撸动了几下。你花了一点时间感受皮特到底变得有多长，他太粗了，你甚至无法完全用手指握住他。");
         outputText("[pg]你的舌头沿着长长的黑色肉棒游走，到达龟头时，用嘴唇亲吻它。他的包皮覆盖了大部分龟头，顶端露出来，在裂口处挂着一颗乳白色的珍珠。薄荷的香气与他的麝香混合在一起，你用舌头接住先列腺液，品尝着甜美清新的薄荷味，发出一声满足的轻哼。");
         outputText("[pg]皮特的手插在你的[hair]里，不断地鼓励你。你把舌头滑进他的包皮下，在皮瓣下旋转，尝到了一股强烈的汗水和麝香的味道。对龟头的挑逗让他的呻吟声更大了，他的拐杖糖在你的手中完全勃起，滴着先列腺液。");
         outputText("[pg][say:我给完美的吸精小荡妇准备了更好的东西，好好干，这都是你的。]皮特微笑着，半眯着眼睛看着你。伴随着他的话语，你用温暖的嘴唇包裹住他的粗壮，将薄荷味的肉棒含入口中，舌头继续在流着口水的龟头上滑动。当你吸吮他的肉棒时，你的双手沿着光滑的黑色肉棒抽动，他沉重的阴囊随着臀部的摇晃而摇摆，推动着他的长度轻轻地插入你火热的嘴里。");
         outputText("[pg]很快，他的长度就顶到了你的喉咙深处，当他把粗大的肉棒塞进你的喉咙时，你的舌头沿着他肉棒的下侧游走。他掌握主动权时，发出了愉快的轻笑。他的双手引导着你的头沿着他光滑的乌木肉棒移动，他的臀部紧贴着你的脸。他向前迈了几步，然后开始快速地抽插，他的靴子牢牢地踩在冰冷的雪地里，开始操你的脸。");
         outputText("[pg]当他的下体撞击你的脸时，他气喘吁吁，肥大的黑色阴囊拍打着你的下巴。他巨大的拐杖糖撑开你的下巴，直捣你的喉咙，撑开你丝滑的内壁。当他巨大的柱子插入你的嘴里时，你的喉咙从外面明显地鼓了起来，他黑色肉棒的每一寸都闪烁着你的口水和他奶油般薄荷味精液的混合物。");
         outputText("[pg][say:你的“烟囱”又紧又热，太适合我下去了。]他低头看着你，放慢了速度，爽朗地大笑着。他看着自己的黑色肉棒在你的嘴唇上滑动，你紧绷的嘴唇吸吮着他的肉棒，在拉扯和挤压他坚硬的肉体时榨取着它。");
         outputText("[pg][say:张大嘴巴接受你的礼物，]他咕哝着，拔出肉棒，你的口水还粘在上面，他那只大手在自己身上撸动着，而你则保持着脸部姿势，准备就绪。伴随着一声满足的呻吟，他把他的圣诞欢乐倾泻在你的脸上，雪白的液体洒在你的脸颊上，带着温暖你冰冷身体的热度附着在你的身体上。他向你张开的嘴里射了几股，液体既有奶油味又有薄荷味。当你吞下浓稠的精液时，它滑过你的舌头。它温暖了你的肚子，皮特给了你一个满意的笑容。");
         outputText("[pg][say:这就是节日精神。]他狡黠地向你眨了眨眼。[say:你今年表现得真……好，[name]。]当他叫出你的名字时，你眨了眨眼，想知道他在翻找他那个大袋子时是怎么知道的。皮特拿出一根巨大的拐杖糖，比你见过的任何一根都要大。他一只手拿着它，对你咧嘴一笑，用长长的直端抵住你的嘴唇。");
         outputText("[pg][say:这是专门为你准备的特别款待。来吧，用你那张美妙的嘴，]他在你顺从时鼓励你。这根奇怪的拐杖糖感觉一点也不正常，皮特必须调整角度来触碰你的嘴唇，因为它不像普通的糖果那样坚硬。当你用嘴唇包裹住这根厚厚的含糖食物时，感觉它在你的嘴唇里很灵活。甜美的薄荷味和另一种味道一起席卷了你的舌头。你不太清楚那是什么，但是混合在特殊糖果里的某种东西让你的皮肤在寒冷的天气里发热。");
         outputText("[pg][say:对，就是这样。现在别害羞。]皮特发出一声欢快的笑声，开始把更多的东西推过你的嘴唇。你发出一声闷哼，嘴唇紧紧地包裹着这个巨大的甜食。你体内的热量不断增加，你的下体开始隐隐作痛。");
         if(get_player().hasCock())
         {
            outputText("[EachCock]变得坚硬，先列腺液浸湿了你的[armor]。");
         }
         if(get_player().hasVagina())
         {
            outputText("你的[vagina]变得湿润，滴下渴望的汁液，浸湿了你的[armor]。");
         }
         outputText("[pg][say:哦呵呵呵，看来你真的很享受你的礼物。让老极地皮特帮帮你吧，]他眼睛里闪烁着光芒说道，把你放在雪地上，他空闲的手剥去了你的[armor]。尽管天气寒冷，你只能松一口气，你的皮肤太热了，感觉你可以轻松地融化冰雪。皮特开始把巨大的拐杖糖塞进你的嘴里，柔软的糖果轻松地滑进你的喉咙里。");
         outputText("[pg][say:看来我漏了一个地方来塞满我的节日欢乐，]皮特窃笑着，他空闲的手分开你的[legs]，摸索着你的[butt]。他的手指在你的[asshole]上摩擦。他把手伸向沾满口水和精液的肉棒，把黏液涂满手指，然后放松了你的[asshole]。他随着塞进你喉咙的巨大拐杖糖的节奏抽插着手指。你无助地在快感中呻吟，令人上瘾的糖果在你的嘴里融化，在你的喉咙里涂上一层甜美、令人兴奋的美味。");
         outputText("[pg]你幸福地闭上眼睛，不知不觉中，极地皮特滑到了你的[legs]之间。他的南极点正推入你放松的后庭。[say:哦呵呵……]他呻吟着，光滑的乌木长度滑过你的边缘，撑开你的内壁。他把拐杖糖塞在你的嘴里，开始用臀部拍打你的[butt]。当极地皮特在你的[asshole]里大干一场时，你呻吟着扭动着，温暖粘稠的先列腺液润滑着你，让他陷得更深。");
         outputText("[pg]他的整个长度一次又一次地没入你的体内，你的两个洞都塞满了极地皮特的礼物。他把他的南极点在你的内部空间里摩擦，调整抽插的角度，把温暖的种子研磨并涂抹在你烟囱的每一寸。你的臀瓣随着他臀部的撞击而颤动，从你被堵住的嘴里引出闷闷的呻吟。");
         get_player().buttChange(25,true,true,false);
         outputText("[pg][say:嗯，我绝对每年都要下你的烟囱。你真是太棒了，]他喘着粗气，在冷空气中呼出深呼吸，雾气笼罩着他的脸。他突然加快了残酷的步伐，肉体拍打肉体的声音充满了你的耳朵，他向前倾身，开始带着重新集中的意图猛烈地操你。");
         if(get_player().hasCock())
         {
            outputText("他不断撞击你的前列腺，加上塞在你嘴里令人上瘾的糖果，让你达到了高潮，[eachCock]在你的胸前射出雪白的绳索。皮特用一种淫荡的目光看着你，你的脸上沾满了他的精液，你的身体上沾满了你自己的精液。");
         }
         else if(get_player().hasVagina())
         {
            outputText("你的[vagina]颤抖着，粗暴地插入你[asshole]的感觉，加上嘴里令人上瘾的糖果，让你达到了高潮。伴随着低沉的呻吟，你的花丘将淫液溢出腹股沟，滴落下来润滑皮特的抽插，也流到了你的[legs]上。皮特用一种色眯眯的眼神看着你。");
         }
         outputText("[pg]看着你在充满快感的极乐中扭动，皮特用几次猛烈的抽插狠狠地干着你。他的阴囊紧贴在你的臀瓣之间，尽可能深地将他的南极埋入你的体内。随着他乌黑的肉棒抽搐着将精液射入你体内，他大声呻吟着，将他那充满节日气氛的浓稠精液泵满你的胃。你感到胃部有些胀鼓鼓的。皮特拔出肉棒，他那滚烫的薄荷味精液从你被蹂躏的[asshole]中溢出。");
         outputText("[pg][say: 你表现得很好，但我该走了。我还有很多人要见，还有很多礼物要发，]皮特轻笑着，从你嘴里拔出拐杖糖。他让你慢慢起身穿好衣服，同时拉上裤子拉链，将那根巨大的拐杖糖塞回他的包里。你穿好衣服，皮特在他那大皮袋里翻找了一会儿，拿出一个用鲜艳彩纸包装的盒子。");
         outputText("[pg][say: 一点额外的小礼物，留作纪念。明年我会留意你的。]他狡黠地眨了眨眼，把盒子放在你手里。说完，他提起袋子走开了，毫无疑问是继续他的送礼之旅。你看了看盒子，拆开包装，发现里面是一个水晶瓶，装着一种熟悉的白色液体。你拔开瓶塞，闻到了熟悉的薄荷香味。你开始纳闷为什么有人会把自己的精液装在瓶子里当礼物送人，不过你耸了耸肩，带着瓶子回到了营地。[pg]");
         get_player().orgasm("Anal");
         get_inventory().takeItem(get_consumables().PEPPWHT,get_camp().returnToCampUseOneHour);
      }
      
      public function talkToXmasChicken() : void
      {
         clearOutput();
         outputText("你觉得至少应该试着让她安静下来，于是你继续靠近。她终于注意到了你在她身边踩雪的脚步声，当她抬头看你时，她安静了一会儿。现在你离得更近了，你可以在雪地的映衬下看清她更多的特征。她穿着一件轻薄的裙子，几乎和她的皮肤以及周围的雪一样苍白，薄得你刚好能透过白色的布料看到她挺拔的乳头。你自己打了个冷颤，让你想知道为什么她会在这样的日子里穿成这样。她翅膀上厚实蓬松的羽毛甚至比雪的冰霜背景还要白。她身上似乎散发着微弱的银色光芒，但这可能只是雪中光线的错觉。");
         outputText("[pg]你看着她安静地躺了一会儿，然后她又开始像以前一样大声地咕咕叫，在地上扑腾。你受够了，终于问她觉得自己在外面做什么。她疑惑地抬头看了一会儿，然后一本正经地告诉你她在雪地里做形状，然后尽职尽责、吵吵闹闹地回到了她的任务中。你把脸埋在手里，不知道该怎么处理这件事。你问她到底为什么要这样做。");
         outputText("[pg]鹰身女妖抬起头，张开嘴巴片刻，但停下来思考。[say:嗯，我在雪中跳舞，因为我很高兴看到它。然后我滑倒了，所以我开始做这个。]又想了想。[say:哦！对了，我起不来。我的翅膀折叠得不好。太大了。]她显然期待你会满意，于是又回到了工作中。被迫在她恢复的震耳欲聋的欢乐尖叫声中大喊，你告诉她，如果她安静下来，你可以帮她起来。她考虑了一下你的提议，然后伸出了一只手。");
         outputText("[pg]尽管她的羽毛看起来很厚，但她相当轻，你很容易就把她拉了起来。呃，爪子。她似乎很感激，对你灿烂地笑了笑。你只是很高兴她闭嘴了。[say:谢谢！我想我应该以某种方式报答你。" + get_player().sexSwitch("给你吹箫听起来怎么样？","我给你舔穴怎么样？","我给你几分钟时间，你想对我的嘴做什么就做什么怎么样？") + "]你挑了挑眉毛，不完全确定该如何看待她突然变得好色的本性。这确实是一个很大的变化。她咯咯地笑了。[say:哦，别惊讶。你以为我们在哪里[if (silly) {，菜鸟}]？]");
         menu();
         addButton(0,"接受",acceptChristmasBJs);
         addButton(4,"拒绝",declineChickenBlowjobs);
      }
      
      public function takeItRooButtStyle() : void
      {
         clearOutput();
         outputText("你对着这位身材火辣的女服务员眨了眨眼，转过身，顺从地把你的[chest]贴在小巷的墙上。你迅速脱下你的[armor]，转头对你步步紧逼的情人笑了笑——但你很快就被袋鼠女孩全速冲向并插入你[butt]的肉棒打了个措手不及。");
         get_player().buttChange(24,true,true,false);
         outputText("[pg][say: 哦，操！]她大叫着，丰满的臀部不顾一切地在你的[asshole]里抽插。你估计光是最初的几下抽插，她那根肉棒就至少有八英寸插了进去，这还不算她已经试图挤进去的长度。你感觉到她粗壮的尾巴拂过你的大腿，当她在你耳边低语时，你打了个寒颤。[say: 我要把你灌满精液，让你几周都下不了床，宝贝。]你试图把注意力集中在吸收她强有力的抽插上，随着她的润滑液软化你火热的通道，你逐渐适应了。最终，至少14英寸的纯粹肉棒深深地砸进了你的后庭。随着每一次挺动，她的蛋蛋都会弹开");
         if(get_player().balls > 0)
         {
            outputText("你自己的");
         }
         else if(get_player().hasVagina())
         {
            outputText("你的小穴");
         }
         else
         {
            outputText("你的会阴");
         }
         outputText("。每一次，女服务员都用她急切的双手抚摸着你的身体。");
         outputText("[pg]");
         if(get_player().hasVagina())
         {
            outputText("你的小穴也随之渗出淫液，嫉妒着上方那个被蹂躏的洞。");
         }
         outputText("你再多花几分钟沉浸于她那兽性般的嬉闹，细细品味那根粗大肉棒在你饱受蹂躏的后庭中抽送的快感。然而，你的高潮很快逼近，那强烈的，");
         if(get_player().hasCock())
         {
            outputText("前列腺");
         }
         else
         {
            outputText("屁股");
         }
         outputText("后庭麻木的感觉变得难以忍受。最后一次猛地撞向卡米的肉棒，你长舒了一口气，高潮占据了你的身体，那种感觉像电流一样传遍全身。");
         if(get_player().hasCock())
         {
            outputText("你那憋坏了的肉棒当场射精，毫不羞耻地将黏糊糊的精液喷射在你面前的墙上。");
         }
         if(get_player().get_gender() == 3)
         {
            outputText("与此同时，你");
         }
         else if(get_player().hasVagina())
         {
            outputText("你");
         }
         if(get_player().hasVagina())
         {
            outputText("那急切的小穴在兴奋中收缩，将淫水喷洒在你下方的地板上。");
         }
         outputText("你真的精疲力尽了。");
         outputText("[pg]另一方面，卡米还需要一点鼓励。她拼命地抚弄着自己未被使用的小穴，直到她再也受不了，片刻之后，她迟来的高潮终于一塌糊涂地喷发在你的后庭里。[say: 哦，宝贝，我——嗯——比任何事情都需要这个。如果你在冬天结束前回来，我们一定要再试一次。] 你对卡米的想法竖起大拇指表示赞同，转身准备回营地。然而，在离开之前，你趁机狠狠地捏了一把她丰满的乳房，然后心满意足地迅速离开。");
         get_player().orgasm("Anal");
         dynStats(DynStat.Sens(1));
         doNext(get_camp().returnToCampUseOneHour);
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,643,1);
      }
      
      public function skipOutAfterOpeningKamisBox() : void
      {
         clearOutput();
         outputText("你礼貌地拒绝了卡米的求欢，道了声歉后转身走向门口。你开始纳闷自己为什么没在面包店里买点什么。");
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,643,1);
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function polarPete() : void
      {
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,644,int(get_date().getFullYear()));
         clearOutput();
         outputText("当你在平原上旅行时，越往前走，似乎越觉得有些不对劲。很快，你呼出的气在嘴前变成了白雾，随着温度似乎在下降，你紧紧抱住自己。当你抬起头时，纯白的雪花从天而降。你脚下的地面布满了冰霜，覆盖着一层薄雪，当你适应这寒冷的天气时，你感到一阵寒意顺着脊背爬上来。似乎有什么不自然的东西正在影响这个区域。");
         outputText("[pg]伴随着踩雪的嘎吱声，你转过头，看到远处有一个高大的身影。纷飞的大雪模糊了你的视线，不过它似乎正在靠近。当它靠得足够近时，你终于看清了那是什么。");
         outputText("[pg]向你走来的是一个相当高大的男人——从远处看，他似乎只是一个高个子人类，但当他靠近时，你能察觉到有些不对劲。他毛发旺盛，非常旺盛，" + (get_noFur() ? "尤其是他的四肢" : "他的身体") + "覆盖着短短的白毛。圆圆的耳朵从他头顶的白发中探出，颜色与他粗犷的短方形胡须相配。看到你时，他的嘴角露出了微笑，肌肉发达的双臂扛着一个挂在肩上的大麻袋。这个奇怪的男人似乎对天气毫不在意，也许是因为他穿着一件镶有白毛的宽大深红色外套和配套的裤子。他那黑色的大靴子踩在雪地上嘎吱作响。");
         outputText("[pg][say: 节日快乐！] 他低沉的声音向你呼喊着，尽管你感到不安，但这个奇怪的男性却散发出一种……欢乐的气息。仅仅是看着他，你就不禁感到开心了一点——他看到你显然也很高兴。");
         outputText("[pg][say: 我本来就希望能在这趟旅途中遇到像你这样的人。我还有很多地方要去，很多礼物要送。]他的手臂将那个大麻袋放在身旁的雪地上。你凑近一看，能隐约看出那个棕色大袋子里有方形的凸起。[say: 我叫极地皮特，]他说道，嘴角勾起一抹自信的笑容。");
         outputText("[pg][say: 而对于你，我准备了一份非常特别的包裹，专门给好孩子们的。]他毛茸茸的大手下流地捂住自己的下体，撑开裤子的布料，让他的凸起更加明显。你可以看到他那根粗壮的“拐杖糖”软绵绵地垂在他沉甸甸的阴囊上。他的眼神中透着淫靡，眼中闪烁着期待的光芒。[say: 过来拆开它吧。]他低沉的声音让你起了一身鸡皮疙瘩。");
         menu();
         addButton(0,"拆开",unwrapPolarPete);
         addButton(14,"离开",leaveDisFukkinPolarBear);
      }
      
      public function leaveXmasChicken() : void
      {
         clearOutput();
         outputText("你对这种荒谬的情况感到非常恼火，不想去处理它，于是你把脸埋在手里，决定随她去吧。也许一些小恶魔会替你让她闭嘴。你回到营地，她刺耳的叫声一路跟随着你，你准备迎接新的一天。过了一会儿，她的叫声渐渐消失了；雪融化了，空气也很快变暖了。");
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function leaveDisFukkinPolarBear() : void
      {
         clearOutput();
         outputText("你决定不相信这个陌生人，点了点头，转身离开。[say: 等等！在你走之前……]他一边说着，一边气喘吁吁地把巨大的袋子移到身前。他倾下身子，上半身在袋子里翻找着，然后重新出现。他递给你一个包装鲜艳的礼物。");
         outputText("[pg][say: 我的一点心意，]他带着灿烂的笑容说道。尽管你有些犹豫，但这个举动似乎很真诚。你点点头，接过礼物，简单道谢后便离开了。回到正常气候后，你拆开礼物，发现里面是一个小水晶瓶，装着一种看起来有些眼熟的白色液体。拔开瓶塞，闻了闻里面的东西，清新的薄荷香味扑鼻而来。闻起来很美味，不过你抵挡住了诱惑，重新塞好瓶塞。你带着它回到了营地。[pg]");
         get_inventory().takeItem(get_consumables().PEPPWHT,get_camp().returnToCampUseOneHour);
      }
      
      public function leaveBeforeMeetingCandyCaneBun() : void
      {
         clearOutput();
         outputText("你不想冒着被一根陌生的鸡巴塞进[butt]的风险。");
         if(get_player().cor > 50 || get_player().lib > 50)
         {
            outputText("至少现在不想。你转过身，摸索着回营地的路。");
         }
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function investigateCandyCaneBun() : void
      {
         clearOutput();
         outputText("你决定弄清楚到底发生了什么。你小心翼翼地顺着小水坑的粘液走，稍微有些紧张。你靠近一堵低垂的藤蔓墙，迅速把它拉开。在一个你见过的最大的精液水坑里，一个颤抖的兔娘般的身影跪在地上。");
         if(get_player().cor < 50 && get_player().lib < 50)
         {
            outputText("你的目光很快被这只兔" + (get_noFur() ? "男孩" : "兽人") + "赤裸的身体所吸引。");
         }
         else
         {
            outputText("你的目光很快被这只兔" + (get_noFur() ? "男孩" : "兽人") + "曲线优美的屁股所吸引。");
         }
         outputText("一对沉甸甸垂下的睾丸证实了这个身影至少部分是男性。");
         outputText("[pg]你正准备");
         if(get_player().cor < 50 && get_player().lib < 50)
         {
            outputText("离开，");
         }
         else
         {
            outputText("靠近，");
         }
         outputText("但你的[feet]踩断了一根树枝，发出的声音让这个兔娘转过身来。当他那双大眼睛与你对视时，你第一次看清了他的模样。他看起来主要像人类，但头上长出的下垂耳朵以及从" + (get_noFur() ? "膝盖" : "大腿") + "往下覆盖的绒毛表明他至少发生了一些变异。平坦的胸部上有两个小乳头，证实了他是个男性。他那八英寸长的肉棒和猕猴桃大小的睾丸更是让你确信无疑。他的皮肤被晒成了浅褐色，呈现出一种柔和的棕色。他身上的毛发与相对正常的皮肤形成了鲜明的对比。他头上齐肩的头发像刚下的雪一样白，上面点缀着红色的条纹。你忍不住注意到这头发是如何完美地衬托出他那出人意料的柔软、女性化的脸庞。他腿上的皮毛也同样覆盖着这种条纹。他的臀部明显突出，进一步增加了他整体的少女感。");
         outputText("[pg][say:你不会强奸我吧？] 兔男孩异常高亢的声音打断了你的思绪。");
         if(get_player().cor < 50)
         {
            outputText("你平静地告诉他，你没有侵犯他的意图。");
         }
         else
         {
            outputText("你的思绪被打断了，但你同意让这个兔娘想信什么就信什么。");
         }
         if(get_silly())
         {
            outputText("你愿意说任何话来让他平静下来。这小子的声音比《欢乐合唱团》里那个混蛋还要尖锐！");
         }
         outputText("一个微笑点亮了他的脸庞，他的肩膀明显地垂了下来，不再紧绷。他那样坐了一会儿，才意识到当前情况的严重性。他睁大眼睛，发出一声相当不男人的惊呼，猛地放下手臂捂住自己滴着液体的肉棒。尽管他很尴尬，但很明显，如果没有帮助，他是无法发泄出来的。");
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,637,int(get_date().getFullYear()));
         outputText("[pg]你要帮他吗？");
         menu();
         addButton(0,"是",helpWithTheCandyCane);
         addButton(1,"否",declineCandyCaneCawks);
         dynStats(DynStat.Lust(10 + get_player().lib / 10),DynStat.NoScale);
      }
      
      public function helpWithTheCandyCane() : void
      {
         clearOutput();
         outputText("你诱惑地垂下眼帘，开始扭动你的[hips]，靠近这只发情的兔子。当你把他的手从他的肉棒上拿开时，他微微颤抖，但他没有抗拒。凑近一看，你可以看到他的肉棒上装饰着与他头发上相似的红色条纹。你把你的[face]贴上去，让这根充满信息素的器具在你的脸上摩擦。这根坚硬的肉棒甚至在你的[hair]上留下了几道先列腺液。在挑逗了这个呜咽的兔娘一分钟后，你把他的肉棒拉下来，让它滑过你的嘴唇。当他的龟头接触到你舌头的那一刻，你的嘴里泛起一阵冰凉的感觉。它让你充满了一种难以言喻的幸福感，就好像你嘴里的男孩正在散发着纯粹的快乐。你开始含着他那根能顶到扁桃体的肉棒呻吟，同时");
         if(get_player().get_gender() == 1)
         {
            outputText("[eachCock]勃起，在你身上摩擦。");
         }
         else if(get_player().get_gender() == 2)
         {
            outputText("你的[vagina]和[clit]被大量的淫液覆盖。");
         }
         else if(get_player().get_gender() == 3)
         {
            outputText("你的两性器官都因性奋而勃发。");
         }
         else
         {
            outputText("汗水从你的身上滴落。");
         }
         outputText("你对此毫不在意，因为你正全神贯注地用嘴套弄着那根美味的肉棒。");
         outputText("[pg][say:我的天哪！]兔娘在你上方大喊，毛茸茸的双腿缠住了你的脖子。[say:你再这样下去，我就要喷了！]你对他笑了笑，然后拔出了他的肉棒。当他的龟头从你那渴望鸡巴的吸洞里拔出时，你的嘴唇发出了一声怪异的吧唧声。你用手握住他那根跳动的肉棒，一边为他打飞机，一边用沙哑的声音低语，让他把精液涂满你的全身。他在你老练的握力下扭动着，滑溜溜的精液顺着你的手指滴落。涂满你手指的粘液让你能更好地为他手淫。你的手上下套弄的速度快得惊人，几乎化作了一道残影。");
         outputText("[pg]这个女性化男孩纤细的双手突然抓住你的[hair]，把你拉向他的阴茎。你感觉到他的蛋蛋在你的[face]上翻滚。正当你准备接受他慷慨的礼物时，一阵清脆的铃声突然分散了你的注意力。你睁大眼睛想找出这奇怪铃声的来源，但你的视野只能看到压在你脸上的蛋蛋。看着它们明显地翻滚着，你很快推断出他的蛋蛋就是铃声的来源，宣告着他即将到来的高潮！随着他的鸡巴肿胀，一股精液喷射到你的[face]上，铃声很快就停止了。你条件反射地张大嘴巴，就像一个被夹在这个兔娘双腿之间的妓女。他的下一股精液将白色的浓浆涂满了你的整个口腔，让你的脊背一阵愉悦的颤栗。他的精液是如此的清凉薄荷味，以至于你立刻扑向他，再次将他吞入口中。他让你吸下他最后几发精液，然后向后倒去，彻底精疲力尽。他微微颤抖着，把你拉到他身上，然后凑上来在你沾满精液的嘴唇上印下了一个不太纯洁的吻。你停留了片刻，抚摸着他柔软的头发。他最终躺了回去，向你道谢后便沉沉睡去。");
         if(get_player().cor < 50)
         {
            outputText("为了不打扰他，你回到了营地，并试图无视你下半身燃烧的欲火。");
         }
         else
         {
            outputText("尽管你越来越想占这个不知情的兔娘的便宜，但你还是决定休息，返回营地。");
         }
         dynStats(DynStat.Lib(1),DynStat.Sens(1),DynStat.Lust(100,DynStatOp.Eq),DynStat.Cor(-5),DynStat.NoScale);
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function giveKamiTheChristmasRooAnal() : void
      {
         clearOutput();
         var _loc1_:int = get_player().cockThatFits(70);
         outputText("你快步走向这位丰满的女服务员，抓住她的手腕把她转过来，按在墙上。[say: 嘿，等等！]卡米惊呼道，但你能感觉到她娇弱的恳求中带着兴奋。");
         outputText("[pg]你决意要占据主导地位，于是往一根手指上吐了口唾沫，立刻滑进她紧致的后穴，为即将到来的入侵做准备。你只在衣服里腾出足够的空间让自己的肉棒透气，然后毫不犹豫地把你的肉棒对准她粗壮的袋鼠尾巴下方，正好在她那粉嫩的臀瓣之间。卡米尽可能诱惑地邀请你进入她的屁股，摇晃着丰满的大腿，用她的后庭用力地摩擦你的龟头。[say: 至少温柔一点嘛，宝贝，]她在你耳边诱惑地娇嗔，当你那根肉棒沉入她心形的屁股并释放出地狱般的快感时，她给了你全力冲刺的绿灯。");
         outputText("[pg]在你每一次霸道的抽插中，卡米都发出尖叫");
         if(get_player().balls > 0)
         {
            outputText("，你的蛋蛋随着每一次推进拍打着她");
         }
         outputText("。[say: 啊！不！啊！]她在每一次抽插间隙痛苦地皱眉，你的[hips]随着节奏加快，几乎帮不上什么忙。你尽可能久地操着她的屁股，短暂地松开她的手腕，在她的翘臀上狠狠地拍了一下。卡米的通道被你的先列腺液弄得温暖湿润，没过多久，你就发现你的肉棒在这个荡妇紧致的后庭里进进出出，仿佛它是为你量身定做的一样。渐渐地，卡米对你" + get_player().cockDescript(_loc1_) + "那老虎钳般的紧握松开了，她开始沉迷于你霸道的表现中。她享受地左右摇晃着脑袋，你粗暴而用力地操着她——她的帽子上下摆动，和她那晃动的肉体一样令人着迷。你把她拉到地上，在射出精液前给了她最后几下抽插，然后倒在她身上，像某种野兽一样虚弱地挺动着。");
         outputText("[pg]卡米在你身下达到高潮时兴奋地尖叫着，快速地撸动着她那根沾满先列腺液的扶他肉棒，疯狂地把精液挤到她身下的地上。当你清空到她紧致的通道里时，你能感觉到她滴水的女性私处摩擦着你的[sack]。");
         if(get_player().cumQ() < 1000)
         {
            outputText("[say: 嗯……就是这样，宝贝，]卡米顺从地呻吟着，她的后穴最后紧缩了一下，然后你拔出肉棒，从你心满意足的战利品身上爬下来，你的" + get_player().cockDescript(_loc1_) + "还在滴着乳白色的精液。");
         }
         else
         {
            outputText("当你强大的种子喷涌而出时，卡米的一只手从她的肉棒飞到了她突然肿胀的肚子上。这个出乎意料沉重的女孩进一步陷进地里，你的精液倒流回来，松开了她包裹着你的通道，迫使你在发生不幸的事情之前拔出还在喷射的" + get_player().cockDescript(_loc1_) + "。你一从你的袋鼠战利品身上下来，精液就开始滚落出来，但从这缓慢的速度来看，她会有很长一段时间看起来像怀孕了一样。");
         }
         outputText("[pg]穿好衣服后，你在离开前最后看了卡米一眼。她幸福地躺在地上，身上沾满了你们俩体液的混合物。她晚点应该就能回家了——前提是她还能走路的话。");
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,643,1);
         get_player().orgasm("Dick");
         dynStats(DynStat.Sens(-2));
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function getWinterPudding() : void
      {
         var nextAction:Function;
         var itype:ItemType;
         var _g:Inventory;
         clearOutput();
         if(get_player().get_gems() < 35)
         {
            outputText("遗憾的是，布丁不是免费的，而且看起来你没有品尝一口所需的35颗宝石！");
            doNext(get_game().telAdre.bakeryScene.bakeryuuuuuu);
            return;
         }
         var _loc1_:Player = get_player();
         _loc1_.set_gems(_loc1_.get_gems() - 35);
         statScreenRefresh();
         outputText("你选择了一块美味的甜点——你只有在节日结束前才能享用，所以你最好现在就拿一块！你是现在吃掉它，还是留到以后再吃？[pg]");
         menu();
         addButton(0,"吃掉",eatWinterPudding).hint("吃掉美味的温特布丁。它看起来如此令人难以抗拒……");
         _g = get_inventory();
         itype = get_consumables().W_PDDNG;
         nextAction = get_game().telAdre.bakeryScene.bakeryuuuuuu;
         addButton(1,"拿走",function():void
         {
            _g.takeItem(itype,nextAction);
         }).hint("把布丁带在身上。");
      }
      
      public function getAChristmasChicken() : void
      {
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,642,int(get_date().getFullYear()));
         outputText("[pg]早上，刺耳的嘎嘎声将你吵醒。你迷迷糊糊地翻了个身，希望能再睡一会儿，但这烦人的噪音却持续不断。意识到它可能一时半会儿不会消失，你勉强睁开眼睛，撑起身子。周围的景象让你眨了几下眼睛，以驱散心中的难以置信：一层洁白的雪霜覆盖着地面，这在你的营地里可是难得一见的景象。你并没有真正注意到天气变冷了多少，但今天早晨的寒意却刺透了你的[armor]。你浑身打了个冷颤，对这场奇怪降雪的思考被另一声响亮的叫声打断了。");
         outputText("[pg]你下定决心要让那个制造噪音的家伙闭嘴，于是你在寒冷清脆的雪毯上跋涉，朝着你认为声音传来的方向走去。你爬上一个小山丘，映入眼帘的是另一幅奇特的景象。在雪地的映衬下，隐约可见一个非常苍白的鹰身女妖仰面躺着，用她纯白的翅膀拍打着地面，双腿在刚落下的粉雪上扫来扫去。她开心地嘎嘎尖叫着，显然太沉浸在……不管她在做什么，以至于没有注意到你。");
         menu();
         addButton(0,"交谈",talkToXmasChicken);
         addButton(14,"离开",leaveXmasChicken);
      }
      
      public function encounterKamiTheChristmasRoo() : void
      {
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,643) == 0)
         {
            outputText("你走进特尔阿德雷的面包店，打算品尝一些当地的甜点。这一次，你惊讶地发现这里装饰着各种各样的冬季节日装饰——甚至还有一棵松树，树下精心地摆放着礼物。店里挤满了人，你让一位身材曲线优美的袋鼠" + (get_noFur() ? "女孩" : "兽人") + "女服务员带你到座位上。你不记得以前在这里见过她，而且你确信你绝对不会忘记像她那样的胸部。当她为你整理餐桌时，她那起伏的E罩杯紧紧贴着她那精致的红白相间的女服务员制服。她出乎意料地发现了你的目光，意识到了你感兴趣的目标，脸红得厉害。还没等你来得及道歉，女服务员就匆匆跑开了，走的时候臀部扭动得几乎有些夸张。[pg]");
         }
         else
         {
            outputText("你走进特尔阿德雷的面包店，建筑内装饰着各种各样的冬季装饰。后面有一棵松树，装饰着精美的礼物。这里比平时更热闹，当地的平民在前面的柜台争相购买美味佳肴。你走近饥饿的人群去调查，发现引起骚动的是一种特别诱人的布丁甜点。你对着这节日的美味吧唧着嘴，你逐渐增加的饥饿感被一个娇柔、熟悉的声音打断了。[say:嘿！我看到你在盯着我做的布丁！你想要一些吗？]年轻的袋鼠女服务员隔着一群精力充沛的泰尔·阿德里安人大喊，挥手引起你的注意。[say:你最好在这些家伙之前抢一个！35宝石！我要去休息一下了——你有兴趣和我一起发泄一下精力吗，宝贝？][pg]");
         }
      }
      
      public function eatWinterPudding() : void
      {
         clearOutput();
         get_consumables().W_PDDNG.useItem();
         doNext(get_game().telAdre.bakeryScene.bakeryuuuuuu);
      }
      
      public function declineChickenBlowjobs() : void
      {
         clearOutput();
         outputText("鹰身女妖怀疑地眯着眼睛看着你。[say:你什么意思，“不用了，谢谢？”这里没人会这么说！]她翻了个白眼，以一种明显夸张的方式叹了口气，然后转身拍打着翅膀飞向远方。你回到营地，非常期待安静。你回来后不久，空气变暖，雪融化了，除了几处泥泞的泥点外，没有留下任何痕迹。");
         doNext(playerMenu);
      }
      
      public function declineCandyCaneCawks() : void
      {
         clearOutput();
         outputText("你有些尴尬地转过身，跌跌撞撞地走出了林间空地。尽管他很诱人，但你没有时间去帮一个随机出现的兔娘高潮。");
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function chooseLetsGoKami() : void
      {
         clearOutput();
         outputText("你决定满足卡米的要求——毕竟现在是送礼的季节嘛！你赞许地咧嘴一笑，然后走向后巷，不慌不忙地盯着她那摇晃的屁股。");
         outputText("[pg]一到外面，卡米就立刻扯下她紧身的裙子，证实了你的猜想。她那根惊人的肉棒从黑色蕾丝丁字裤里弹了出来，她轻声叹息着。你很好奇她是怎么用那条几乎不存在的内衣把它藏得那么好的。");
         outputText("[pg][say: 啊，舒服多了！过来蹂躏我吧，亲爱的，]她诱人地呻吟着，把她自己分泌的润滑液涂抹在越来越粗的肉棒上。");
         outputText("[pg]你打量着眼前的状况。你该怎么处理？");
         menu();
         if(get_player().hasCockThatFits(70))
         {
            addButton(0,"肛她",giveKamiTheChristmasRooAnal);
         }
         addButton(1,"被她肛",takeItRooButtStyle);
         addButton(2,"给她口交",KamiBlowJob);
         if(get_player().cockTotal() > 1 && get_player().hasCockThatFits(70) && get_player().cockThatFits2(70) >= 0)
         {
            addButton(3,"双管齐下",KamiDoubleDickFuck);
         }
      }
      
      public function candyCaneTrapDiscovery() : void
      {
         clearOutput();
         outputText("在踏入平原后不久，你的思绪飘回了你在村庄里的生活和家。今天空气中微微的寒意让你想起了以前的朋友和家人庆祝欢乐的时光。随着白天变短变冷，人们交换着不起眼的小饰品，并准备了丰盛的宴席。");
         if(get_player().cor < 50)
         {
            outputText("这段记忆给你的[face]带来了一丝怀旧的微笑。");
         }
         else
         {
            outputText("这段记忆提醒了你，与玛瑞斯相比，你的世界是多么的平淡无奇。");
         }
         outputText("[pg]你的沉思被一声尖锐的呻吟打断，立刻引起了你的注意。声音很轻，发出声音的人一定在一段距离之外，但足以让你确定它来自哪里。你举起[weapon]做好准备，朝着声音发出的方向走去。穿过一片茂密的灌木丛，你发现自己身处一个半隐蔽的林间空地，地上到处都是精液的水坑。不管这些是从什么生物身上来的，它一定相当[say:欲求不满]，可以这么说。");
         outputText("[pg]你要冒着风险去调查吗？");
         menu();
         addButton(0,"调查",investigateCandyCaneBun);
         addButton(14,"离开",leaveBeforeMeetingCandyCaneBun);
      }
      
      public function approachKamiTheChristmasRoo() : void
      {
         clearOutput();
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,643) == 1)
         {
            outputText("你对卡米点了点头，走向后院，她则打卡休息了一会儿。这位女服务员出来得比你预想的要快，已经脱下了她那红白相间的制服，露出了她那饥渴的肉棒。[say: 我不骗你，亲爱的，你绝对想不到穿这身衣服工作让我变得多发情。]你打量着她那惹火的身材，计划着接下来的行动。你能看出来她一直在品尝自己做的催情蛋糕，虽然听起来不可思议，但她看起来比平时还要饥渴得多。");
            menu();
            if(get_player().hasCockThatFits(70))
            {
               addButton(0,"肛她",giveKamiTheChristmasRooAnal);
            }
            addButton(1,"被她肛",takeItRooButtStyle);
            addButton(2,"给她口交",KamiBlowJob);
            if(get_player().cockTotal() > 1 && get_player().hasCockThatFits(70) && get_player().cockThatFits2(70) >= 0)
            {
               addButton(3,"双插",KamiDoubleDickFuck);
            }
         }
         else
         {
            outputText("你把那位丰满的女服务员叫了过来，既然她有时间坐下来和你聊天，你就能更好地欣赏她温柔的脸庞了。她有着榛子般褐色的眼睛、迷人的双唇和凌乱的金发，这种伪叛逆的造型对这位巨乳服务员来说简直是锦上添花，而她那顶可爱的小圣诞帽更是点睛之笔。光滑的橄榄色肌肤一直延伸到她丰满大腿的一半，然后逐渐过渡成柔软的绒毛，她纤细的前臂也是如此。在你们交谈的过程中，她那条巨大的袋鼠尾巴悠闲地摇摆着，你和她的交流也渐入佳境。为了让事情进展顺利，你停顿了一下，准备说句迷人的俏皮话，但她的食指却突然抵住了你的");
            if(get_player().get_femininity() >= 75)
            {
               outputText("女性化的");
            }
            else if(get_player().get_femininity() <= 25)
            {
               outputText("男性化的");
            }
            outputText("双唇。");
            outputText("[pg][say:停。待在这里别动。我马上回来。]");
            outputText("[pg]袋鼠女孩站起身，走进面包店的储藏室，几秒钟后再次出现，手里拿着一个中等大小的礼物。你本来对它还有点好奇，但一个更引人注目的“惊喜”直接吸引了你的目光——在礼物正下方，有一个巨大、突出，老实说相当显眼的湿润凸起，正壮观地顶着她的衣服。显然，这位女服务员下面藏着点“额外”的东西。");
            outputText("[pg]她把礼物放在你的腿上，然后向后挪了挪，等待你的反应。你注意到她的双腿因为期待而焦躁地抽动着，大概是因为有淫液正从她那匀称的大腿间滴落。看样子，她现在已经相当发情了。你决定立刻打开礼物，掀开盖子，发现里面是……一张折叠的小纸条。你最后看了袋鼠女孩一眼，然后用拇指拨开那条小信息，想看看她到底在搞什么名堂。");
            outputText("[pg]纸条上写着：[say: [i: 嗨，" + get_player().mf("帅哥","美女") + "]。我叫卡米。想去后面打一炮吗？这可以是我给你的特别礼物。] 她在落款处画了一个眨眼的笑脸");
            if(get_silly())
            {
               outputText("，还在角落里找了个空隙涂鸦了一根小鸡鸡。真聪明");
            }
            outputText("。");
            outputText("[pg]哇哦，好吧，这可真够直接的。你现在该怎么做？");
            menu();
            addButton(0,"走吧",chooseLetsGoKami);
            addButton(14,"离开",skipOutAfterOpeningKamisBox);
         }
      }
      
      public function acceptChristmasWomanBJ() : void
      {
         clearOutput();
         outputText("你点点头，表示接受她的提议。苍白的鹰身女妖高兴地尖叫起来，双手举到下巴，几乎高兴得蹦了起来。你解开你的[armor]，一眨眼的功夫，她就跪在你的大腿之间。她呼出的热气喷在你柔软的肌肤上，在寒冷的空气中感觉棒极了。急切的女孩毫不浪费时间开始工作，用一只手的两根手指摩擦你的[clit]，用其他手指轻轻抚摸你的阴唇。随着她的触摸带给你的温暖、舒适的唤起感，她的压力也随之增加。");
         outputText("[pg]没过多久，她就让你下面湿漉漉的，刺痛着，需要更多的关注。显然对你的湿润感到满意，她抓住你的大腿，把脸贴在你的胯部。她光滑厚实的舌头滑过你的下唇，每次都把你推得更远一点。它突然弹入你的私处，足以引起一声急促的喘息，当一阵颤栗席卷你的身体时，你几乎本能地用手掌托住她的后脑勺。当你温柔的咕咕声和快乐的叹息声融入呻吟声中时，她越来越热烈地吃着你的[vagina]，她的舌头探索着你内壁最柔软、最敏感的地方。你的大脑现在似乎漂浮着，被性需求的波浪所承载。你需要高潮，你需要她给你更多。现在更用力地把她压向你，当你用手指穿过她浓密的金发时，任何关于她舒适的想法都从你的脑海中消失了。");
         outputText("[pg]鹰身女妖明白了你的意思，以一种近乎暴力的强度攻击你饥渴的阴户。尽管你不想，但还是忍不住叫出声来，但她紧紧抱住你，毫不留情地继续着。你的视线几乎被欲望的感觉所模糊。你向后仰起头，闭上眼睛，在体内不断积聚的唤起之海上漂流。以她现在的速度和熟练的技巧，没过多久，那片海就溢出了高潮。当你的[cunt]肌肉收缩时，你的大脑一片空白，你的汁液喷射到鹰身女妖的嘴里。她饥渴地喝着它们，当你慢慢从高潮中平静下来时，舌头还在舔舐着。你终于放开了这个女人，当你沐浴在余韵中时，她几乎不情愿地从你的双腿之间移开。");
         outputText("[pg]当你重新整理[armor]时，她突然拥抱了你。她苍白皮肤周围的银色光芒现在看起来更强了，强到你几乎可以肯定你能看到它。[say: 哦，谢谢你！]她开始说道，但很快就恢复了平静。[say: 谢谢你，嗯，帮我。起来。]她松开手，从你身边退开。[say: 我得走了，回见！享受这天气吧！]说完，她展翅飞向天空。她降落在附近一棵树的顶端，双臂伸展，摆出一个奇怪的姿势。即使在远处，围绕着她的银色光芒仍然可见。你摇了摇头，回到营地，想知道那到底是谁。你回去后不久，空气再次变暖，雪也融化了，在地上留下了几处泥泞的泥坑。");
         get_player().orgasm("Dick");
         doNext(playerMenu);
      }
      
      public function acceptChristmasManBJ() : void
      {
         clearOutput();
         var _loc1_:int = get_player().cockThatFits(80);
         if(_loc1_ < 0)
         {
            _loc1_ = get_player().biggestCockIndex();
         }
         if(get_player().cockArea(_loc1_) >= 80)
         {
            outputText("你将你的[cock " + (_loc1_ + 1) + "]从[armor]中释放出来，表示你接受了。你的巨物弹了出来，鹰身女妖看到它时，本能地抓住了自己的喉咙。她睁大眼睛抬头看了看你，又低头看了看它。[say: 答、答应的事就是答应了，但是……]");
            outputText("[pg]她转过身，惊恐地拍打了几下翅膀逃跑了。你叹了口气，再次遮住你那巨大的肉棒。至少你不用再忍受她那烦人的尖叫了。你回去后不久，空气变暖，雪也融化了，除了几处泥泞的泥坑，没有留下任何痕迹。");
            dynStats(DynStat.Lust(10));
            doNext(playerMenu);
            return;
         }
         outputText("你将你的[cock " + (_loc1_ + 1) + "]从[armor]中释放出来，表示你接受了。迎面而来的冷空气让你希望她不要浪费任何时间。苍白的鹰身女妖看到后尖叫起来，双手举到下巴，几乎在原地蹦跳起来。一眨眼的功夫，她就跪了下来，抚摸并舔舐你的肉棒，直到它在她面前硬挺起来。她呼出的热气喷在你的肉棒上，让你迫不及待地想要躲避刺骨的寒冷。她盯着你勃起的肉棒");
         if(get_player().cockTotal() > 1)
         {
            outputText("");
         }
         outputText("几乎是饥渴地舔了舔嘴唇，然后迅速将几乎整个长度吞入口中。她熟练的技巧让你震惊；你当然没想到她会知道自己在做什么，但她能在一个动作中将你几乎吞到根部。");
         outputText("[pg]她喉咙的温度贴着你敏感的肌肤，让你感到如此的解脱，以至于你失去了平衡。你喘着粗气，将一只手放在她的后脑勺上，部分是为了稳住自己，部分是为了让她靠得更近。没有遇到阻力，你把她拉向你，直到她丰满的嘴唇包裹住你[cock " + (_loc1_ + 1) + "]的根部。她微笑着含住它的粗壮，慢慢地将头向后滑动，舌尖沿着它的长度拖拽，让你沾满了她闪闪发光的唾液。冰冷的温度让你再次猛吸一口气，但当她开始前后摆动时，痛苦的感觉被遗忘了，她吸入得如此之深、如此之快，以至于你无法思考太多，只能感受到她嘴里温暖的舒适。");
         if(get_player().cockTotal() == 1)
         {
            outputText("她抓住你的臀部，让自己动得更快。");
         }
         else if(get_player().cockTotal() == 2)
         {
            outputText("她用另一只手开始套弄第二根肉棒，配合着她头部的动作。");
         }
         else
         {
            outputText("她用双手抓住你另外两根勃起的肉棒，开始配合着她头部的动作套弄它们。");
         }
         outputText("[pg]她口交的舌头和撅起的嘴唇足以弥补不舒服的温度；当快感笼罩你的大脑时，寒冷的刺痛被遗忘了。以她现在的速度，你很快就接近了边缘。你试图警告她，但在你只能发出一声喘息之前，高潮就降临了。沉浸在极乐中，你紧紧抱住她，将你滚烫的精液排入鹰身女妖接纳的喉咙里。");
         if(get_player().cumQ() < 250)
         {
            outputText("她闭上眼睛，吞下你的精液时看起来很满足。");
         }
         else if(get_player().cumQ() < 1000)
         {
            outputText("精液从你体内喷涌而出，似乎永远不会停止，但鹰身女妖似乎并不介意。她闭上眼睛，吞下你仍在喷涌的精液时看起来很满足。");
         }
         else
         {
            outputText("虽然一开始她看起来能应付，但从你肉棒裂口喷出的精液河流并没有停止。当几乎无尽的精液洪流填满她，冲下她的喉咙进入她的肚子时，她睁大了眼睛。你几乎可以看到她被这些东西胀大，然后它开始溢出，从她包裹着你肉棒的嘴唇上滴下白色的液体。");
         }
         if(get_player().cockTotal() > 1)
         {
            outputText("你的精液喷洒在她身上，在她的皮肤和羽毛上涂上一层足以与它们自身相媲美的白色。滴落并流过她身体的精液丝线在她明亮的身体上几乎不显眼。");
         }
         outputText("当你结束时，你放开了鹰身女妖。她看起来和你一样满足。一条精液和唾液的痕迹仍然连接着你的[cockHead " + (_loc1_ + 1) + "]和她；她舔了舔嘴唇打断了它，并在站起来之前给了你疲软的阴茎一个渴望的眼神，因用力而喘息着。");
         outputText("[pg]当你正把肉棒放回[armor]时，这个快乐的女孩突然抱住了你。她苍白皮肤周围的银色光芒现在看起来更强了，强到你几乎可以肯定你能看到它。[say: 哦，谢谢你！]她开始说道，但很快就恢复了平静。[say: 谢谢你，嗯，帮我。起来。]她松开手，从你身边退开。[say: 我得走了，回见！享受这天气吧！]说完，她展翅飞向天空。她降落在附近一棵树的顶端，双臂伸展，摆出一个奇怪的姿势。即使在远处，围绕着她的银色光芒仍然可见。你摇了摇头，回到营地，想知道那到底是谁。你回去后不久，空气再次变暖，雪也融化了，在地上留下了几处泥泞的泥坑。");
         get_player().orgasm("Dick");
         doNext(playerMenu);
      }
      
      public function acceptChristmasBJs() : void
      {
         if(get_player().get_gender() == 1)
         {
            acceptChristmasManBJ();
         }
         else if(get_player().get_gender() == 2)
         {
            acceptChristmasWomanBJ();
         }
         else
         {
            clearOutput();
            outputText("你希望她为你服务你的男性部位还是女性部位？");
            menu();
            addButton(0,"男性部位",acceptChristmasManBJ);
            addButton(1,"女性部位",acceptChristmasWomanBJ);
         }
      }
      
      public function KamiDoubleDickFuck() : void
      {
         var _loc1_:int = get_player().cockThatFits(70);
         var _loc2_:int = get_player().cockThatFits2(70);
         clearOutput();
         outputText("你开怀大笑——你当然要好好蹂躏她一番！不然还能怎样，真是可笑。眨眼间，你已经抓住了她的双臂，将她按在墙上。卡米热情地惊呼了一声，但她急切地在你逐渐膨胀的胯部摩擦的动作暴露了她的真实意图。");
         outputText("[pg]你掌握了主动权，掐住这名女服务员的脖子，同时在你的[armor]里腾出空间，释放出你那饥渴难耐的肉棒。你毫不耽搁，将坚硬如铁的肉棒对准她巨大阴茎下方的那些渴望被填满的穴口，双手穿过她的双腿下方，将她微微抬起以增加发力点。卡米满怀期待地喘息着，轻轻地将自己压在你的龟头上，试图引诱你。你一如既往地挑逗着，注意到女服务员诱人的双唇间漏出喘息。[say:你到底用不用你那几根漂亮的肉棒，还是说要我自己动？]为了不让她失望，你挺身而入，穿透了她柔软的阴道，接着又探入她紧致的后庭，缓慢而坚定地越插越深，直到你那饥渴的工具再也无法深入分毫。[say:操——操！狠狠地干我！]她急切地叫喊着。");
         outputText("[pg]你拔出的速度比插入时要慢，她的臀部支撑着你，让你再次挺身而入，并逐渐加快每次抽插的频率。当你粗暴地在这个新收服的袋鼠荡妇体内驰骋时，你迫使这名女服务员紧紧贴在身后的小巷墙壁上，她的双臂向两边张开，柔软的胸部被挤压在砖墙上。");
         outputText("[pg][say:老娘能这样干上一整天！]卡米尖叫着，你邪恶的抽插让她的骨盆因纯粹的快感而湿润。你已经感觉到自己的高潮即将来临，于是你急忙抓住卡米丰满的胸部，充满活力地加快了抽插的速度，用尽全力将你的肉棒捣入深处。你那塞满后庭的" + get_player().cockDescript(_loc1_) + "率先射精，用粘稠的精液填满了卡米紧致的穴口，紧接着你的另一根" + get_player().cockDescript(_loc2_) + "也给了她那娇嫩却饱受蹂躏的阴道同样的待遇。");
         outputText("[pg]卡米紧随其后，她的身体向前倾倒在你的怀里，在性高潮的痉挛中紧贴着你。[say: 我的天啊！]这名袋鼠女孩尖叫着，舌头因为强烈的性唤起而伸了出来，她那14英寸长的肉棒将积压已久的欲望喷洒在你的腹部。当她用大腿缠绕着你时，你能感觉到她大腿上的毛发短暂地竖了起来，随着她狂热的喘息逐渐平息，这种感觉也慢慢消退。");
         outputText("[pg]你花了一秒钟整理思绪，这场折磨让你筋疲力尽。你慢慢穿回你的[armor]，同时向这位现在已经心满意足的女服务员道别——她喘得太厉害了，甚至无法回应你的举动。");
         get_player().orgasm("Dick");
         dynStats(DynStat.Sens(-3));
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,643,1);
         doNext(get_camp().returnToCampUseOneHour);
      }
      
      public function KamiBlowJob() : void
      {
         clearOutput();
         if(!get_player().hasTailInsteadOfLegs())
         {
            outputText("你跪了下来");
         }
         else
         {
            outputText("你将你的[if (isNaga) {蛇形|修长}]下半身调整好位置，将上半身倾斜到卡米那渴望的肉棒触手可及的范围内。你伸出手");
         }
         outputText("并冲动地用手抓住那根粗壮的肉棒，将那根14英寸长、滑溜溜的工具紧紧握在手中。当你开始舔舐那根肉棒时，卡米赞许地咯咯笑着，你的手在它的长度上缓慢地上下套弄着。[say: 嗯……看来有人很懂行嘛。] 你在粗壮的肉棒头部吐了口唾沫，将这临时的润滑剂慷慨地涂抹在她的肉棒上，她那趾行的双腿交叉着，焦躁地抽搐着作为回应。[say: 哦，天哪，快点把它放进你嘴里！] 你对她的不耐烦咧嘴一笑，又逗弄了她的龟头一会儿，才终于开始动真格的。她最初的几英寸滑入时遇到了很大的阻力，新鲜的唾液覆盖在肉棒上，让她顺利地、毫无阻碍地滑入你的扁桃体。");
         outputText("[pg]然而，你从她那里得到的反应却要自发得多——卡米的袋鼠脚趾向外卷曲，同时她热情地呻吟着。她的长度被你紧致的喉咙吞没的喜悦，清楚地写在她的脸上，就像你埋在她的胯部一样。卡米将你的头向前推，发出呻吟。她温暖的先列腺液已经开始溢出到你的下唇，每次你退后时，都会有一些精液黏糊糊地滴落下来。你把手伸到她巨大的肉棒后面，用手指分别刺入她的两个洞，带着色情的意图将你的两根手指钻进她的性感带。[say: 哇——哦，天哪！] 她哭喊着，你的刺激显然让她无法承受。卡米紧致的后庭紧紧夹住，她的女性器官和肉棒同时爆发，将精液浸透了你活动的手指和喉咙深处。");
         outputText("[pg]你毫不费力地吞下了她的精液，将手指从卡米的湿润中抽出。你让卡米柔软娇嫩的嘴唇包裹并覆盖住你的嘴唇，让她也尝尝她自己的精液。你给了她一个诱惑的眨眼，然后终于抽身去穿衣服，但卡米坚持要引起你的注意来道歉。[say: 嘿，呃，抱歉这么早就射了——如果这能算是一种安慰的话，那真是太棒了！下次你应该占据主动，宝贝。] 你对着卡米微笑，女服务员在你的脸颊上啄了一下，然后你回到了营地。");
         if(get_player().hasCock())
         {
            outputText("你觉得你可能还需要找个地方发泄一下你的欲望，毕竟你的[eachCock]仍然勃起着，需要释放。");
         }
         dynStats(DynStat.Lust(20 + get_player().lib / 10 + get_player().sens / 10));
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,643,1);
         doNext(get_camp().returnToCampUseOneHour);
      }
   }
}

