package classes.scenes.dungeons.lethicesKeep
{
   import classes.BaseContent;
   import classes.CoC;
   import classes.Cock;
   import classes.CockTypesEnum;
   import classes.DynStat;
   import classes.ImageManager;
   import classes.Monster;
   import classes.PerkLib;
   import classes.Player;
   import classes.StatusEffects;
   import classes._FlagDict.FlagDict_Impl_;
   import classes.globalFlags.KFLAGS;
   import classes.items.Weapon;
   import classes.scenes.combat.Combat;
   import flash.Boot;
   
   public class MinotaurKingScenes extends BaseContent
   {
      
      public function MinotaurKingScenes()
      {
         if(Boot.skip_constructor)
         {
            return;
         }
         super();
      }
      
      public function titfuckCowslut() : void
      {
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1269,1);
         clearOutput();
         get_images().showImage("minotaurlord-cow");
         outputText("忘了那个肌肉男吧；手边就有一个极品荡妇，她那对奶子值得你冒着下地狱的风险去操。幸好莉希丝给了你这个满足自己的机会。即使她不给，你可能也得冒着风险好好干他们一顿。你把[oneCock]从[armor]里掏出来，走向那个倒下的荡妇，心里对她产生了一丝短暂的怜悯。");
         outputText("[pg]艾克塞莉亚几乎失去了意识。她的小穴大张着，仍然在滴落她主人多余的精液。她的眼神呆滞，有些涣散。然而，当你爬到她身上时，她勉强对你笑了笑，并抓住了自己的乳房。仅仅是这种触碰就让她陷入了呻吟，她的眼睛半翻着，舌头伸在外面。她的奶子<i>很敏感</i>。你不确定她是天生就是一个完美的乳交荡妇，还是她主人那带有迷幻效果的精液的作用，但这对你来说真的无所谓。");
         outputText("[pg]当你把[cock]放进她那峡谷般的乳沟里时，这只颤抖的母牛呻吟了一声，并用手肘撑起她的奶子，将你封锁在乳房的肉山中。她的手指几乎消失在柔软的肉垫里，从她巧克力色的乳头中挤出不受控制的乳汁。回想起这乳汁对你倒下的敌人造成的影响，你避免自己喝下它，任由它顺着那对弹性的奶子流回那令人愉悦的乳沟中。");
         outputText("[pg]她的乳汁并不是完美的润滑剂，但它足以让她的皮肤变得光滑，让她那充满乳汁的肉团在你的[cock]上滑动，几乎和湿润的小穴一样好。艾克塞莉亚始终是个荡妇，她为你移动着她巨大的奶子，以一种温柔但令人兴奋的节奏在你的肉棒上前后滑动。真正的乐趣在于这种动作所提供的视觉享受，她那对肉球令人愉悦地晃动着，让你能够欣赏光线在她那闪闪发光的曲面上跳跃。");
         outputText("[pg]你在她天鹅绒般的拥抱中抽搐了一下，艾克塞莉亚勉强笑了笑。");
         outputText("[pg]这个荡妇比你更享受这一切，毫无疑问。她丰满的嘴唇几乎总是因为呻吟而微微张开。她的脸颊绯红。见鬼，她还在喷射乳汁。当你的肉棒完全埋入她胸部的拥抱中时，水流变得更强了，在与她忙碌揉捏的双手相反的节奏中，压迫着她体内的液体储存库。像这样的身体……就是为了被操和被使用而生的。难怪牛头人国王把她收为小妾。");
         outputText("[pg]不再是了。从这一刻起，她是你的玩物。你可以爬上去骑她，直到你被榨干每一滴精液。当你的[cockHead]离开她的乳沟时，艾克塞莉亚甚至记得去吸它。她并不总是这样。有时她的嘴唇忙着发出快乐的牛叫声或含糊不清的极乐尖叫，但大多数时候，她都非常乐意用她那涂着金粉的嘴唇包裹住你的[cock]。");
         outputText("[pg]等等……金色的嘴唇？就像鹰身女妖那样？");
         outputText("[pg]欲望在你体内涌动，强烈而毫不妥协。难怪你的对手总是硬得像石头一样。你自己的肉棒在母牛荡妇柔软的乳房拥抱中愤怒地跳动着。你渴望释放，却又只渴望被最近的雌性无休止地配种。操！");
         outputText("[pg]你抓住她的一只角，把她的头按回去，以免她再给你喂下任何催情药物。你要赢得这场战斗，如果这个荡妇的嘴唇再次碰到你，你就做不到了。你捏住一个乳头，切断了乳汁的流动，开始在她敏感的乳房之间用力抽插，粗鲁地蹂躏艾克塞莉亚的奶子，完全不考虑她的感受。");
         outputText("[pg]这不重要。当你开始更具侵略性地使用她时，你甚至能听到她那淫荡的小穴在你身后的地板上漏水。她显然已经习惯了被这样使用和虐待。也许她甚至很享受。你捏住一个乳头，听着她发出一声愉悦的牛叫，然后你抓住另一个乳头，重复这个动作。每当她似乎在考虑再次去吸你的肉棒时，你就会捏住两边，仅仅用她身体自身过于原始的感觉来拒绝她。");
         outputText("[pg]你已经记不清这个饥渴的骚货高潮了多少次，但你自己也快了。她唇膏的残留效果在你体内不断掀起情欲的狂潮，更不用说她的奶子挤压着你的[cock]带来的美妙触感了。你兴奋地嚎叫着，加快了速度，决心从这个荡妇淫荡的双乳中榨取每一丝快感。她宽大的、像牛一样的舌头伸在外面，表情如痴如醉。你想知道自己能不能把它涂成白色。");
         outputText("[pg]当你爆发时，你狠狠地挺身到底，享受着紧致的乳交，将浓稠的精液射向你的目标。");
         if(get_player().cumQ() <= 500)
         {
            outputText("大部分都没射中，但有一股大胆的精液成功地覆盖了艾克塞莉亚的舌头。");
         }
         else if(get_player().cumQ() <= 1500)
         {
            outputText("大部分都落在了艾克塞莉亚的舌头上，把它涂得几乎全白，只剩下几块原本颜色的斑点。剩下的精液积聚在她的后颈，让你有时间欣赏你创造的奶牛纹舌头。");
         }
         else
         {
            outputText("艾克塞莉亚的舌头毫无招架之力。你光是第一发就覆盖了它的大部分，剩下的大多灌进了她的喉咙。点点精液溅在她的脸颊上，在她的后颈形成了一个深深的水洼，甚至沿着她的锁骨流下了涓涓细流。");
            if(get_player().cumQ() >= 5000)
            {
               outputText("至于她的乳房？除了乳头之外，基本上全白了。");
            }
         }
         outputText("[pg]遗憾的是，你还有正事要办。你从这个溅满精液和乳汁的牛娘身上抽身而退，站起身来，看着等待着的恶魔。");
         get_player().orgasm("Dick");
         get_player().set_HP(get_player().maxHP());
         get_combat().cleanupAfterCombat(get_game().dungeons.resumeFromFight);
      }
      
      public function theKingIsDeadLongLiveTheKing(param1:Boolean) : void
      {
         var cockIdx:int;
         var _g:MinotaurKingScenes;
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1266,1);
         clearOutput();
         outputText("国王的斧头哐当一声掉在地上。当他们最强大的勇士之一跪倒在地，盯着自己的老二，用双手疯狂地套弄时，腐化的大军中响起了一阵倒吸冷气的声音。他几乎被欲望冲昏了头脑，倒在地上，如此狂热地操着自己的手，以至于他对除了立即获得性满足之外的任何事情都失去了兴趣。");
         outputText("[pg]房间后方开始响起缓慢而安静的掌声。[say: 干得好，勇者……[if (ischild) {你年轻的面容很有欺骗性|[if (iselder) {你的年龄让你比大多数人拥有更多的经验|干得相当好}]}].]女王本人正对着你微笑，尽管她的眼睛像冬夜里黑色的冰一样冷。[say: 享受你的战利品吧。要是[if (ischild) {杀掉一个刚刚面对如此可怕野兽的孩子|在你兴奋的时候对付你}]，那就不太公平了。我手下那些忠诚的仆从可能会对我的力量产生误解。]她的眼睛危险地闪烁着。");
         outputText("[pg]当然。如果她趁你还在从牛头人的战斗中恢复时攻击你，她的下属可能会认为她软弱或害怕。你有一个半昏迷的王室成员和他的母牛荡妇可以任你处置。或者你也可以直接结束他们的痛苦。");
         if(get_player().cor <= 33)
         {
            outputText("这些可怜的家伙被腐化得太深了。");
         }
         menu();
         addButtonDisabled(1,"对接","这个场景需要你有一根合适的阴茎。");
         addButtonDisabled(2,"肛交","这个场景需要你有一根合适的阴茎。");
         addButtonDisabled(3,"乳交","这个场景需要你有一根阴茎。");
         addButtonDisabled(4,"接棒继续","这个场景需要你有一根阴茎。");
         addButtonDisabled(5,"Ride Him","这个场景需要你有一个阴道。");
         addButton(0,"杀了他们",murderhobo);
         if(get_player().hasCock())
         {
            if(get_player().smallestCockArea() <= 50)
            {
               _g = this;
               cockIdx = get_player().smallestCockIndex();
               addButton(1,"对接",function():void
               {
                  _g.dockucocku(cockIdx);
               });
            }
            if(get_player().hasCockThatFits(200))
            {
               addButton(2,"操屁眼",buttufucku);
            }
            addButton(3,"乳交",titfuckCowslut);
            addButton(4,"接棒继续",sloppySeconds);
         }
         if(get_player().hasVagina())
         {
            addButton(5,"骑乘",mechanicalbullhue);
         }
         addNextButton("放手",letGo);
      }
      
      public function sloppySeconds() : void
      {
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1269,1);
         clearOutput();
         var _loc1_:int = get_player().biggestCockIndex() + 1;
         outputText("既然手边就有一滩湿漉漉的荡妇，为什么还要去利用那个残暴的牛头人呢？好在从她双腿间漏出的所有精液闻起来其实");
         if(get_player().hasPerk(PerkLib.MinotaurCumAddict))
         {
            outputText("很美妙");
         }
         else
         {
            outputText("有点……好闻……甚至很性感");
         }
         outputText("，否则你可能会犹豫。她被内射过的蜜穴在你的[cock " + _loc1_ + "]上摩擦，感觉应该就像涂了特氟龙的丝绸一样顺滑。它在莉希丝王座室闪烁的卧室灯光下闪闪发光，召唤着你插进去，看看感觉会有多爽。");
         outputText("[pg][say: 嗯……还要吗？]艾克塞莉亚如梦似幻地娇嗔着，撅起屁股摆好姿势。[say: ……是的，主人，我随时都渴望被操。]她幸福地叹了口气，朝你的方向扭动着屁股，完全不知道是你正挺着胀痛的肉棒向她的屁股逼近");
         if(get_player().balls > 0)
         {
            outputText("以及[ballcount]个装满精液的蛋蛋");
         }
         else
         {
            outputText("以及一肚子憋着的精液");
         }
         outputText("。你觉得没必要纠正她，尤其是在她如此热情地撅起屁股的时候。你抓住她的尾巴，把她拉到合适的位置，将你的[cockHead " + _loc1_ + "]对准她那流着白浆的阴道口。");
         outputText("[pg]艾克塞莉亚呻吟着，[say: 太温柔了，大人！求您了，别让我等了！]");
         outputText("[pg]你粗暴地拽着她的尾巴，将自己埋入她那被填满的阴户中，简直不敢相信这在服侍牛头人国王时居然算得上“温柔”。每一次");
         if(get_player().balls > 0)
         {
            outputText("蛋蛋");
         }
         else
         {
            outputText("屁股");
         }
         outputText("拍打的冲击力都像池塘里的涟漪一样，在这个丰满的牛奴臀部荡漾开来。她呼出幸福的轻声哞叫，以同样的节奏向后迎合着你，始终是一个忠诚的阴茎榨乳器。");
         if(get_player().biggestCockLength() < 18)
         {
            outputText("你不认为她会把你这根不那么起眼的勃起物和她牛头人主人的混淆，但她似乎完全不在乎。也许是塞满她小穴的牛头人精液让她已经无暇顾及，又或者她只是乐于伺候一根肉棒——任何肉棒都行。");
         }
         else if(get_player().biggestCockLength() <= 30)
         {
            outputText("你不认为她会把你的肉棒和她主人的混淆，但她还是开心地挨着操。这大概也能把她的小穴撑得差不多大。");
         }
         else
         {
            outputText("你不认为她会把你这根巨根和她牛头人主人那根较小的混淆，但她似乎完全不在乎。也许是塞满她小穴的牛头人精液让她沉浸在快感中，根本无暇顾及其他。只要是被一根粗大的肉棒劈开，又有什么区别呢？");
         }
         get_images().showImage("minotaurlord-excelia-sex");
         outputText("你算是明白为什么那个体型庞大的兽人要把她留在身边了。[pg]");
         outputText("这只颤抖的母牛荡妇的小穴简直有魔力。感觉她的肌肉随着你的每一次抽插都在把你往更深处拉扯，诱哄着你的[cock " + _loc1_ + "]再长长一寸，只为了能更好地填满她。天哪，你越来越硬了。她感觉太他妈爽了，让你头晕目眩，除了紧紧抓住她的屁股，像抓住救命稻草一样用力揉捏之外，你什么也做不了。在这一刻，除了艾克塞莉亚那过于湿润的小穴发出的罪恶的吧唧声，你感觉自己爱上了她，或者至少爱上了她的小穴。");
         outputText("[pg]操，你现在几乎能爱上任何人。如果周围的人群不是由没有灵魂的怪物组成，你可能也会爱上他们。你又揉了揉她的屁股，看着它在你的手指下凹陷。你的手指几乎要陷进那柔软、适合操弄的屁股蛋里，你满意地咕哝了一声。这太催眠了。当然，你还在操她。就算你想停也停不下来，但你的臀部和你的意识之间似乎有一种奇怪的脱节，就好像快感太多，让你麻木了。");
         outputText("[pg]电流般的快感每秒都在你的[cock]中嗡嗡作响，在你的眼前炸开一团团星光，让你很难把注意力集中在除了眼前摇晃的屁股之外的任何东西上。你像自动驾驶一样蹂躏着艾克塞莉亚，在快感中呻吟着，直到你终于意识到——她体内所有的牛头人精液不知怎么地影响了你。而且量太大了！每当你拔出或插入时，都会有乳白色的粘液溢出，但她体内总是有更多的液体沐浴着你的阴茎，用一层又一层的麻醉催情剂将它包裹起来。");
         outputText("[pg]你的一部分想停下来，但那部分随着每一次抽插都在变小。这太棒了，这种原始的、几乎是野性的感觉，一场不受文明或体面束缚的运动式性爱。艾克塞莉亚的小穴简直就是为了完美包裹你的[cock " + _loc1_ + "]而设计的，用下流的按摩来配合它贪婪的抽插。隐约中，你听到了欢呼声，还有那个贪婪的荡妇乞求更多的声音。她想让你射在里面；你感觉得出来。从她的肢体语言到她那狂乱声音的音调，一切都在乞求你给她那过度活跃的卵巢喂食这一个小时内的第二顿大餐。她的身体对精液如饥似渴，即使她已经被塞得满满的，精液还在不断地流出来。");
         outputText("[pg]你需要发泄的程度超乎你的想象。从逻辑上讲，你希望这一切快点结束，这样你就能去操——去面对莉希丝那赤裸的身体了。你敢打赌，在你打败她之前，你至少能捏一次她的奶子……那些紫色的球体在向你的指尖招手。但随后，肉体天堂中令人狂喜的起伏将你环绕，用个性化的关注抚慰着你的神经，像弹奏竖琴一样弹奏着你的身体。你怎么可能希望这一切结束？在这么短的时间里，你已经对这种快感上瘾了，以至于离开它对你那痴迷于小穴的大脑来说似乎是一个外星概念。你想永远操这个小穴。<i>永远。</i>");
         outputText("[pg]光线在艾克塞莉亚被汗水浸湿的屁股上闪烁，随着你用力的抽插，呈现出催眠般的效果。你拍了它一下，只是为了看它泛起涟漪——感受艾克塞莉亚紧紧夹住你的方式，她的声音变成了一种几乎像音乐一样、充满幸福感的哞哞声。这太迷人了，她的身体对你的抽插做出的反应，她似乎把整个自己都缠绕在你身上的方式。你几乎没有意识到自己在喘气，或者你的[cock]硬得可以切割钻石。");
         if(int(get_player().cocks.length) == 2)
         {
            outputText("你的另一根阴茎也同样享受着在她出汗的大腿之间滑动的快感。");
         }
         else if(int(get_player().cocks.length) > 2)
         {
            outputText("你的其他阴茎也同样享受着在她出汗的大腿之间滑动的快感。");
         }
         outputText("[pg]让你高潮的不是欲望。而是你身体简单的、生物学上的繁殖本能。无论你多么想无休止地在这个生育化身身上发泄，你的身体最终都会达到一个临界点，它产生的精液太多，再也容纳不下了。精液的涌动在你体内引发了令人狂喜的收缩，就像按下了电灯开关一样，你突然高潮了，把你的精液喷射到这个活生生的精液接收器里。");
         outputText("[pg]艾克塞莉亚发出震耳欲聋的哞哞声，在你高潮时紧紧夹住你，将你快速射出的精液封锁在她的体内。");
         if(get_player().hasKnot())
         {
            outputText("这样做没什么意义；你的肉结能做的远不止这些，它能像牛头人国王残留的精液一样有效地将你的精液困在里面。");
         }
         outputText("你的");
         if(get_player().isBiped() || get_player().isTaur())
         {
            outputText("[legs]摇晃着");
         }
         else
         {
            outputText("[leg]摇晃着");
         }
         outputText("无力地支撑着你，在高潮中途将你和你那摇摇晃晃的妾室摔倒在地，但这丝毫没有减缓你射精的速度。你感觉自己可以永远射下去，收缩又释放，一波又一波地喂给这个开心地哞哞叫的母牛诱惑者。");
         outputText("[pg]");
         if(get_player().hasKnot() && get_player().cumQ() >= 5000)
         {
            outputText("艾克塞莉亚的肚子鼓起，呈现出一种极其夸张的怀孕状态，里面塞满了你的精液，看起来像怀孕九个月甚至更久。就在你射完之前，她的肚脐凸了出来，用勇者的种子稀释了那个野兽般粗暴的家伙的迷幻精液。");
         }
         else if(get_player().cumQ() >= 5000 && !get_player().hasKnot())
         {
            outputText("艾克塞莉亚的肌肉控制力根本无法抵挡你那纯粹的雄性力量。她小穴的防线很快就崩溃了，将混杂着勇者精液的牛头人浓精倾泻在地上。她呜咽着，在狂喜中尖叫，随着你的种子不断涌入她的子宫，她一次又一次地被推向高潮的顶峰。");
         }
         outputText("[pg]艾克塞莉亚以你的肉棒为轴心，将她那如天鹅绒般柔软的肉穴在你的阴茎上做了一个令人愉悦的180度旋转，然后爬到你的身上，身体仍在颤抖。她的小穴依然在紧紧挤压和收缩着你的[cock " + _loc1_ + "]，让你的注意力完全集中在双腿之间的瘙痒感上。你那过度刺激的胯部别无选择，只能再次高潮，在这个贪得无厌的荡妇的要求下射精。虽然你已经没有多少存货可以给她了，但这并不能阻止你在狂喜中扭动，或者在狂热的兴奋中揉捏她的乳房。");
         outputText("[pg]你不确定自己又给了她多少次，但当你终于设法从她那放荡的嘴唇中抽身而出时，牛头人国王已经被拖进了人群中。");
         outputText("[pg]莉希丝看起来很无聊，用手指敲击着王座的边缘。是时候对付她了。");
         get_player().orgasm("Dick");
         get_combat().cleanupAfterCombat(get_game().dungeons.resumeFromFight);
      }
      
      public function murderhobo() : void
      {
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1267,1);
         clearOutput();
         outputText("你动作很快，然后站直身子，直视莉希丝的眼睛。你将不择手段地清除这个世界上所有的腐败。");
         get_combat().cleanupAfterCombat(get_game().dungeons.resumeFromFight);
      }
      
      public function mechanicalbullhue() : void
      {
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1268,1);
         clearOutput();
         outputText("好吧，既然一头极品公牛已经被装在银盘里端到了你面前，为什么不好好享用他美味的肉体呢？它就在那里，因渴望而颤抖，被他昔日情人的爱抚打磨得完美无瑕。它能直接滑进去");
         if(get_player().averageVaginalLooseness() <= 3)
         {
            outputText("，大概吧");
         }
         outputText("。");
         if(get_player().averageVaginalLooseness() == 4)
         {
            outputText("拥有天赋异禀的情人的特质之一，就是当你遇到像这样真正的极品时，不必再自我怀疑。");
         }
         else if(get_player().averageVaginalLooseness() < 4)
         {
            outputText("在应付这种天赋异禀的种马方面，你并不是最有经验的，但即使你错了，也没有什么比尝试一下更好的了。");
         }
         else
         {
            outputText("这么大的东西绝对能把你撑得舒舒服服的。你刚咽了口唾沫，口水就忍不住流了下来。");
         }
         outputText("你要做的就是爬上去。艾克塞莉亚看起来并不介意。");
         outputText("[pg]而且国王身上依然散发着透过天使面纱过滤后的性爱气息，就像在原始的花田中进行了无尽的无套耕耘。当你靠近时，你的鼻子抽动了一下，你的小穴");
         if(get_player().wetness() >= 4)
         {
            outputText("喷涌而出，浸湿了你的大腿");
         }
         else if(get_player().wetness() >= 3)
         {
            outputText("顺着大腿流下渴望的溪流");
         }
         else
         {
            outputText("再次湿透了");
         }
         outputText("。你的一部分冲动想要跪倒在");
         if(!get_player().hasTailInsteadOfLegs() && !get_player().isGoo())
         {
            outputText("你的膝盖");
         }
         else
         {
            outputText("地面");
         }
         outputText("并将他含入嘴里，想尝尝他是不是像闻起来一样美味。你可以把他深深吞进喉咙，直到你的鼻子埋进他卷曲的阴毛丛中，完全沉浸在这座男子气概堡垒的味道和气味里。");
         outputText("[pg]仅仅品尝是不够的。你那悸动的花穴空虚难耐，绝不允许你把时间浪费在毫无意义的口交上，更何况一根能让小穴爽翻天的螺纹肉棒就在眼前。当你爬到那座肉山般的巨物上方时，女性的淫液滴落在身后国王毛茸茸的皮毛上。你的阴唇如此肿胀，以至于你发誓，随着臀部的每一次扭动，你都能感觉到它们在阴蒂坚硬的凸起上挤压滑动。");
         if(get_player().hasCock())
         {
            outputText("你的肉棒");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("");
            }
            outputText("抽动");
            if(int(get_player().cocks.length) == 1)
            {
               outputText("es");
            }
            outputText("伴随着你急促的心跳，在软弱的瞬间，你俯下身子，将你的" + get_player().cockHead(get_player().biggestCockIndex()) + "沿着牛头人国王的长度摩擦。这不过是短暂的调情——在你将他放入该去的地方之前的戏水。伴随着一声遗憾的叹息，你停止了摩擦，重新对准了他。");
         }
         if(get_player().averageVaginalLooseness() >= 5)
         {
            outputText("[pg]将他巨大的肉棒缓缓塞进你大张的小穴，感觉就像是世界上最自然的事情。你之前所有的经历都不过是为了将这根野兽般的肉棒深深吞入体内的练习。它还在膨胀，充满了凡人无法承受的欲望，在它挤进你体内时，肿胀着推挤和摩擦你紧绷的肉壁。太完美了。能在离目标如此之近的地方找到一个形状如此完美的爱人……你不可能计划得更好了。[pg]");
         }
         else if(get_player().averageVaginalLooseness() >= 1)
         {
            outputText("[pg]第一次尝试将国王的肉棒引导进你焦急的裂隙几乎失败了。膨胀的平头龟头将你撑开，但还不足以让它滑入你涂满蜜汁的洞穴。你痛苦地咕哝着，轻轻扭动了一下，将这根像马一样的肉棒的左侧滑入，然后再塞入另一侧。你不得不停下来，因为那原始的感觉而喘息不止，努力适应它，然后才能继续你那令人愉悦的下沉。你以前从未被肉棒如此完全地填满过，而你现在才刚刚将自己降下剩余的距离。[pg]");
         }
         else
         {
            outputText("[pg]你第一次尝试将这根肉柱强行塞进你那处女般");
            if(!get_player().hasVirginVagina())
            {
               outputText("外观的");
            }
            outputText("大门，结果正如人们所料。尽管你们生殖器的大小差异几乎到了滑稽的地步，但你决心要吞下它全部。你用双手握住它，压在膨胀的龟头上，用嘴唇在钝圆的冠状沟上旋转摩擦，直到他的先列腺液和你的爱液混合成一种充满性趣的泥浆。然后，你的一片阴唇勾住了他野兽般血肉的边缘，以惊人的弹性被拉开。");
            outputText("[pg]你在另一侧重复这个动作，并高兴地喘息着，因为你的入口像一朵异国情调的花朵一样绽放，向它的伴侣展示其粉红色的内部。不知何故，你的[vagina]张得越来越大，而且一点也不觉得痛。也许是皇家先列腺液的沐浴让它变得松弛，又或者牛头人国王天生就具有某种魔力，让他能够将哪怕是最小的自愿雌性据为己有。不管怎样，这都是最好的结果。");
            outputText("[pg]在大概五秒钟的时间里，你从一个充满感官饥渴的真空状态，变得比圣诞火鸡还要饱满，你简直不能更开心了。空虚、未被填满的小穴的折磨，已经被一种夺走你呼吸、扰乱你理智的诱人快感所取代。你希望自己能以某种方式变得更湿、更热，从你的性爱中榨取更大的狂喜。[pg]");
         }
         get_images().showImage("minotaurlord-vag");
         outputText("三个环是你和完全被刺穿之间面临的下一个挑战。在牛头人国王的肉棒上等距分布的那些中间的环，是你情色之旅中微小但重要的障碍。第一个环实际上撞到了你的[clit]");
         if(get_player().hasCock())
         {
            outputText("，刺激着你突出的雌性肉棒的根部");
         }
         outputText("。你反向向上滑动，空气中充满了抽出肉棒时发出的吧唧声，然后再次落下，利用惯性将你涂满黄油的阴唇撑开，越过第一个障碍。那原始的感觉甚至让你的眼睛翻白。");
         outputText("[pg]温暖的先列腺液飞溅在你的子宫颈上。这个大男孩很喜欢这样。");
         outputText("[pg]现在很难思考太多。无论是他充满信息素的气味将你推入一种人造的发情期");
         if(get_player().get_lust100() >= 80)
         {
            outputText("- 并不是说你需要很多帮助 -");
         }
         outputText("还是他那不可思议的强效体液搅乱了你的心智，你发现自己很难去在意这些了。那股燃烧的燥热");
         if(get_player().isBiped() || get_player().isTaur())
         {
            outputText("在你的双腿之间");
         }
         else
         {
            outputText("在你的下体");
         }
         outputText("太过苛求，太过吞噬一切，让你无暇顾及其他。反正这有什么关系呢？你要在这个领主种马的肉棒上颠簸，直到你的小穴红肿泛滥，沐浴在精液中。");
         outputText("[pg]你听到又一圈肉环进入你小穴时发出的轻微“啵”声。兴奋的淫液顺着他滑落，在呻吟的间隙，你震惊地意识到自己差点就高潮了。你的手向下摸索到你的[clit]，准备完成最后的工作。");
         outputText("[pg]在下方，牛头人国王正发出低沉的呻吟和呼噜声。一只肉感的大手托住你的[butt]");
         if(!get_player().isTaur())
         {
            outputText("的全部");
         }
         outputText("，同时他的臀部向上挺动，迎合你向下的动作。一个圆柱形的凸起撑起了你的肚子。聚集的观众甚至能看到他的阴茎进入你阴道的进度。当你的小穴取悦他时，他们能看到龟头冠状沟变得更宽");
         if(get_player().get_tallness() <= 50 && get_player().thickness <= 4)
         {
            outputText("，把你的皮肤撑得发亮");
         }
         outputText("。");
         outputText("[pg]当放在你[butt]上的手突然握紧并开始把你往下拉时，你彻底失控了。你双眼翻白，背部弓起。淫水从你的小穴喷涌而出，浸透了这野兽包皮的敏感皮肤，正好赶上你颤抖的肉褶亲吻它。你已经吞下了他的第三个肉环，一路滑到底部，而你对此毫无察觉。就像大海捞针一样，想要分辨出在你脑海中跳动的每一个快感音符是不可能的。它就像一道白色的极乐波浪，在你的双耳之间来回激荡，与你[vagina]上下滑动的节奏相呼应。");
         outputText("[pg]你将痉挛的指尖拍在兽人被汗水浸透的胸膛上，需要借力来保持直立。你的肌肉没有像它们应该的那样运作。没有一块肌肉是正常的，那些倾听你小穴塞壬之歌的肌肉也是如此。它们像老虎钳一样工作，沿着令人惊讶的迷人阴茎上下滚动。你的声音在尖叫和喘息，当狂喜变得太过压倒性时，你会气喘吁吁地结巴。");
         outputText("[pg]你疲惫不堪的身体没有得到任何喘息的机会。就在你开始平静下来的时候，你那背叛你的神经又让你陷入了全新的高潮");
         if(get_player().isLactating())
         {
            outputText("，诱骗你饱满的乳头将乳汁喷洒得到处都是");
         }
         else
         {
            outputText("，甚至不给你爬下来的机会");
         }
         outputText("。你的身体已经屈服于这种享乐主义的解脱。只要牛头人的臀部在你湿透的三角区进进出出，你就会不断高潮。");
         outputText("[pg]然后你感觉到了。国王那马形阴茎肿胀的龟头在你体内明显膨胀，阻止了你的动作。不知为何，它没有");
         if(get_player().get_pregnancyIncubation() != 0)
         {
            outputText("强行穿过你的子宫颈");
         }
         else
         {
            outputText("撕裂你的子宫");
         }
         outputText("。你的内脏像橡胶一样被拉伸");
         if(get_player().averageVaginalLooseness() >= 5)
         {
            outputText("，这离真相也不远了，");
         }
         outputText("为了容纳这不断膨胀的入侵物。身下的野兽咆哮着。你能感觉到那低沉的轰鸣在你的骨头里震荡——还有你的[clit]。");
         if(get_player().hasCock())
         {
            outputText("见鬼，你能感觉到它在你的[cocks]中涌动，震动着将你尿道里最后几滴未射出的精液排出");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("");
            }
            outputText("。");
         }
         outputText("[pg]他的精液简直不可思议。它像水管里的水一样喷涌而出，只是在你体内是温暖而粘稠的。你的肚子因为这喷发的野兽精液而膨胀，变成了一个象征着变态生育力的雕像。你的一只手伸过去托住它，感觉你越来越沉重的肚子不断膨胀，直到牛头人龟头冠状沟的边缘不再可见。白色的洪流从你的唇间溢出。他那雪白精液的气味如此浓烈，以至于你感到头晕目眩——或者也许是那些浸透你内脏的、掺杂了麻醉剂的公牛精液在作祟。无论如何，这是一种奇妙的快感，与你因精液灌满而无法动弹的状态完全相反。");
         outputText("[pg]当你的肚子停止膨胀时，牛头人国王的抚摸也随之停止。这个可怜的野兽已经昏过去了，字面意义上被你的挑逗和随后的骑乘干到了失去意识，虽然他的肉棒没有丝毫疲软，但他的龟头冠状沟确实缩小了，让你的身体能够缓慢地排出一股野兽般的精液。一旦你不再被自己的膨胀所阻碍，你便顽强地站起来，以令人痛苦的缓慢速度将你的[vagina]从那根坚硬的破处棒上拔出。");
         outputText("[pg]你差点没能成功。牛头人的精液和多次高潮让你头晕目眩，而跨越三个肉环和一个龟头冠状沟几乎让你再次达到顶峰。当那肥大的龟头终于从你的阴唇中弹出来时，你如释重负地喘了口粗气，然后跌倒在地");
         if(get_player().isBiped())
         {
            outputText("，[legs]叉开");
         }
         outputText("。这给你带来的人造快感让你很难不爬向最近的男魅魔并献上你的身体，但你仍然需要对付莉希丝。也许你可以在打败她之后，让她舔掉你小穴里滴落的精液。");
         outputText("[pg]带着这个坚定的幻想，你站起来整理好你的[armor]。你还能做到这个，对吧？");
         get_player().orgasm("Generic");
         dynStats(DynStat.Lust(5),DynStat.NoScale);
         get_player().createStatusEffect(StatusEffects.MinotaurKingsTouch,0,0,0,0);
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1270,1);
         get_player().minoCumAddiction(20);
         get_player().knockUp(2,384);
         get_combat().cleanupAfterCombat(get_game().dungeons.resumeFromFight);
      }
      
      public function letGo() : void
      {
         clearOutput();
         outputText("你对他们两个都不再感兴趣，于是你把注意力转向莉希丝，直视她的眼睛。");
         get_combat().cleanupAfterCombat(get_game().dungeons.resumeFromFight);
      }
      
      public function leavethem() : void
      {
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1271,1);
         clearOutput();
         outputText("[pg]你摆好架势，面对恶魔女王");
         if(!get_player().get_weapon().isUnarmed())
         {
            outputText("，手里拿着[weapon]");
         }
         else if(get_player().get_weapon().isFist())
         {
            outputText("，举起紧握的双拳");
         }
         else
         {
            outputText("，举起[weapon]");
         }
         outputText("，并断然拒绝了她的提议。");
         if(get_player().hasPerk(PerkLib.BimboBrains))
         {
            outputText("[say: 呃，那个，我没[i: 那么]饥渴。再说，等我把你干掉，我想怎么操就怎么操，小可爱！]");
         }
         else if(get_player().cor >= 66)
         {
            outputText("[say: 拜托。如果你想给我点什么操，至少得是值得我花时间的东西。等我打败你之后，操你的屁股怎么样？]");
         }
         else if(get_player().cor <= 20)
         {
            outputText("[say: 我为什么要像那样在你面前贬低自己？纯洁之人不需要这种放纵。]");
         }
         else
         {
            outputText("[say: 我们可不像你一样，被自己的欲望所奴役。]");
         }
         get_combat().cleanupAfterCombat(get_game().dungeons.resumeFromFight);
      }
      
      public function hailToTheKingBaby(param1:Boolean, param2:Boolean = false) : void
      {
         clearOutput();
         get_images().showImage("monster-minotaurlord");
         var _loc3_:MinotaurKing = get_monster();
         if(!param1)
         {
            outputText("你的决心在欲望的烈火中燃烧殆尽，在烧穿你大脑的炽热需求面前不堪一击。你怎么可能抗拒这头壮丽的野兽？他那雄伟的肉棒是如此巨大……如此坚硬");
            if(_loc3_.get_orgasms() > 0)
            {
               outputText("……被他那荡妇的汁液弄得如此湿润");
            }
            outputText("。它占据了你的视野和思想。为他弯下腰，把你的[butt]翘到半空中，朝着他的方向扭动，直到这个大块头强行进入你，这该是多么容易的事啊。天哪，他能把你塞得满满的。那将是多么完美，他在你体内，他那巨大的怪物肉棒的龟头清晰地勾勒在你的肚子上。");
            outputText("[pg][say:你这么快就屈服了吗？]牛头人国王抓住你的头，他的手掌几乎包住了你的整个头骨。[say:不管他们打得多好，最后都会像你一样。如果你现在能看到自己……你也会想操自己的。]");
         }
         else
         {
            outputText("你被打败了。保持直立已经成为一项几乎不可能完成的任务，而战斗的想法也只不过是白日做梦。你仍然在原地摇晃，抬起头，正好看到那个大块头走过来，开心地笑着。");
            outputText("[pg][say:这就对了。接受它吧。]牛头人国王抓住你的头，他的手掌几乎包住了你的整个头骨。[say:对于一个人类来说，你打得很好，但你不需要再打了。]");
         }
         outputText("他把你拉到他的胯部，将他那沾满汗水和性爱气息的睾丸涂抹在你的脸上。它在你的脸颊上感觉又厚又油，但闻起来就像被无套干到翻白眼、舌头伸出来一样。");
         outputText("[pg]你确信你想反抗。你来这里不是为了靠在他那令人舒适的温暖上，吸入更多他那咸味和刺鼻的麝香。粗壮的静脉在你的额头上凸起，先列腺液滴落到你的[hair]里。现在无处可逃了。无论你做什么，去哪里，那种气味都会紧紧地附着在你身上。那是皇家……强大肉棒的气味。女孩们只要靠近你就会湿透内裤，而你将永远无法思考其他任何事情。你接下来的呼吸被一声呜咽的呻吟所打断。");
         outputText("[pg]当国王把你举得更高时，他的肉棒擦过你的太阳穴，来到你的脸颊。你的嘴唇擦过他那多肉的阴茎边缘，你的舌头不由自主地伸了出来。<i>尝一口就好</i>，你告诉自己。<i>尝一口就好。</i>");
         outputText("[pg]先列腺液、汗水和皮肤混合在一起，变成了一场美味的盛宴。你的味蕾被这种味道淹没了。炽热的、化学辅助的快感洪流似乎冲刷掉了你其他的感官，只留下一条扭动的舌头和一张饥饿、空虚的嘴。如果能含住龟头，那该有多好？你会忘记失败的耻辱吗？你能像这样度过余生，在皇家肉棒的末端快乐地扭动吗？");
         outputText("[pg]只有一个方法可以找出答案。");
         outputText("[pg]你推开那只按住你的手，双手抓住那根渗出液体的肉棒，把那钝圆的龟头拉到你的嘴边。海绵状的龟头冠状沟擦过你的下唇，涂上一层充满精液的口水。你没有把它舔掉，而是把它留在那里，张大嘴巴，让润滑的汁液做它们该做的事：帮助阴茎轻松进入一个太小的洞。仅仅是把龟头塞进去，就让你的下巴酸痛，嘴巴被撑成一个不可思议的放荡的“O”形，但一旦你过了那一关，接下来的事情就变得容易了。");
         outputText("[pg][say:好[boy]，]那个胜利的兽人低声哼唱着。[say:这才是你该待的地方。]");
         outputText("[pg]你很难不同意。有了他的肉棒作为俘虏，就不会浪费任何先列腺液了。那些自由溢出的液滴别无选择，只能顺着你的舌头滑入你的喉咙，在那里被吞下。此时，你的脑袋里可能塞满了厚厚的粉红色棉球，每一次吞咽，每一次急切的吞咽，都会增加更多，抹去担忧和顾虑。那些焦虑的想法没有形成的空间，因为你的脑袋里塞满了肉棒，无论是字面上还是比喻上。光是想想就让你想微笑和咯咯笑，但在一个越来越塞满阳具的嘴里，没有空间容纳这些。");
         outputText("[pg]是你向前倾斜身体让它滑得更深，还是你脑后的那只手温柔但不可阻挡地强奸你的脸，这是一个值得争论的问题。伴随着淫荡的舔舐，你想知道为什么不能两者兼有呢？毕竟，做爱需要两个人。你张得更大，用牛头人那麝香般的粘液冲刷你的扁桃体，当他的龟头把你的小舌压在你的上颚上时，你甚至没有退缩。");
         if(get_player().hasPerk(PerkLib.BimboBrains) || get_player().cor >= 66)
         {
            outputText("你早就过了会有呕吐反射的阶段，并且为此感到高兴。");
         }
         else
         {
            outputText("奇迹般地，你的呕吐反射完全消失了。也许是因为它被他那天堂般的先列腺液浸透了，所以无法抗拒？");
         }
         outputText("[pg]你张大鼻孔，深吸了一大口气，刚好赶在那块巨大的肉棒完全堵住你的肺部之前给自己打气。你向后仰起头，抬起屁股，让食道变直，以便更好地接纳这个野兽那根华丽的肉棒。这也正是时候。他一感觉到有空隙，就直接插了进来，撑开你的喉咙，把比你想象中还要多的肉棒塞满你的身体。");
         outputText("[pg]牛头人那巨大的阴茎在穿过你的身体时，龟头冠状沟膨胀起来，带着痛苦的紧迫感挤压着你。如果不是他几乎把先列腺液直接尿进你的身体里，用更多他那天堂般的粘液冲刷着你喉咙里娇嫩的部位，这可能会很疼。快感取代了痛苦，愉悦的刺痛感从你的肠胃到嘴巴之间的每一个部位向上辐射。当他那膨胀的龟头终于突破你的胃部顶端时，你几乎当场高潮。");
         outputText("[pg]不再感觉到他那膨胀的龟头带来的压力，这是一种巨大的解脱和成就感，你甚至感到一种奇怪的自豪。你的鼻子深深地埋在牛头人包皮那黏糊糊的褶皱里，你的嘴唇上沾满了半干的先列腺液。当这个野蛮的君王在快感中咆哮时，他那肿胀的、极度充满男子气概的睾丸顶部拍打着你的下巴。你闭上眼睛，哼着歌，非常满足地坐在这里，围着他的肉棒震动，直到他把他那惊人的精液直接射进你饥渴的肚子里。");
         outputText("[pg]你并没有等太久。");
         outputText("[pg]牛头人国王猛地向前倾斜");
         if(get_player().biggestTitSize() >= 5)
         {
            outputText("，让你的乳房疯狂地摇晃");
         }
         else if(get_player().hasCock())
         {
            outputText("，让你那渗着液体的、半硬的肉棒");
            if(int(get_player().cocks.length) > 1)
            {
               outputText("");
            }
            outputText("滑稽地甩来甩去，把地板弄得黏糊糊的");
         }
         else
         {
            outputText("，用他激情的力道震撼着你的全身");
         }
         outputText("。他的龟头冠状沟不知怎么变得更粗了，宽到可以透过你肚子上的[skinFurScales]看到，硬到你可以隔着中间的肉抚摸它。");
         outputText("[pg]他的高潮震撼了你的整个世界。仅仅是第一股喷射就填满了你的胃，让你有了一个圆润的精液肚。第二股则把你的肚子撑得像怀孕一样淫秽。你的眼睛翻白，既是因为缺氧，也是因为那超大剂量的、让人迷幻的、摧毁理智的牛头人精液。你几乎没有感觉到他那大炮般的射精把你从他痉挛的肉棒上推开。你绝对不记得自己张大嘴巴，让他把精液像面具一样涂满你的脸和头发。");
         outputText("[pg]一切都太模糊了，无法清晰地拼凑起来，只有记忆的闪光、感觉和一种吞噬一切的极乐。艾克塞莉亚的手在你的[chest]上，抚摸着、挤压着，把她主子那大量的精液按摩进你的[skinFurScales]里，直到你闪闪发光。小恶魔们在高处打飞机，把他们那被污染的精液和你那威严主人的纯洁之爱混合在一起。莉希丝甚至可能操了你的屁股。肯定有人操了。");
         menu();
         addButton(0,"继续",gurglegurgle);
      }
      
      public function gurglegurgle() : void
      {
         clearOutput();
         get_images().showImage("badend-minotaurlord-gurgle");
         outputText("后来，当牛头人国王终于占领你的另一端时，你最终会对那次半被遗忘的肛交心存感激。那一点点额外的扩张和润滑足以帮助他把他那巨大的肉棒深深地插入你的屁眼。就像你的喉咙一样，你发现他比他的尺寸所暗示的更容易应付，但这并不能减少占据你脑海的那种淫秽的饱满感。");
         outputText("[pg]这太棒了。即使他没有操你的屁股，他也是坚硬如石，滴着液体，不断地为你提供你已经爱上的那种液体。你让他那样带着你到处走。至少你是这么告诉自己的。如果你试图挣扎，这个大块头可能会把你按在原地，但你无法想象自己会反抗。");
         outputText("[pg]就算你是个肉棒套子，像某种战利品一样骑在牛头人那野兽般的肉棒上又怎样？谁在乎你有时不得不在被从后面操的同时舔恶魔女王？一切都很棒。你从不担心任何事情，总是有人填满你，用液体的幸福把你操得满满的。");
         outputText("[pg]你微笑着，请求有人操你的嘴。两头各插一根感觉总是更好。");
         get_game().gameOver();
      }
      
      public function encounterMinotaurKing() : void
      {
         clearOutput();
         get_images().showImage("monster-minotaurlord");
         outputText("你刚从被击败的恶魔身边走开，莉希丝集结的大军就像某种长满触手的海洋一样分开，露出了一条直接通向堕落女王的道路，如果不是被一个噩梦般的身影挡住的话。一个你从未见过的牛头人挡住了你的去路——这是在与造成如此多不满的罪魁祸首面对面交锋之前的最后一个障碍。");
         outputText("[pg]即使在牛类兽人中，他也是巨人中的巨人。他宽阔的肩膀似乎随时准备刮掉这个洞穴般大厅的镀金。他那双边缘呈深红色的眼睛像一对低燃的煤块一样向下怒视着。从一端延伸到另一端，一个牛娘几乎无法触及他宽阔双角的两端。如果不是他双腿之间伸出三英尺长、闪闪发光、刚刚操过的雄性器官，他看起来几乎有王者风范。");
         outputText("[pg][say: 你很强，勇者，但你的探索到此为止了，]这个野兽保证道。他哼了一声，向人群伸出一只手。[say: 艾克塞莉亚，我的武器。]");
         outputText("[pg]一个充满曲线和成熟性感的幻影从湿润、蠕动的肉帘中浮现。她至少有一部分是牛，长着向上的角和一条欢快甩动的尾巴——更不用说她那异常丰满的乳房了，上面还滴落着刚被吸吮过或自身过度分泌的乳汁。她手里拿着一把巨大的斧头；它太大了，根本不是人类的手能挥舞的。");
         if(FlagDict_Impl_.arrayReadInt(KFLAGS.flags,369) != 0)
         {
            outputText("即使是伊莎贝拉也很难挥舞这样的武器。");
         }
         else if(get_game().marbleScene.marbleFollower())
         {
            outputText("即使是玛布尔也很难挥舞这样的武器");
         }
         else if(get_game().helFollower.followerHel())
         {
            outputText("即使是赫莉娅也很难挥舞这样的武器。");
         }
         outputText("这个可怜的母牛荡妇，这个“艾克塞莉亚”几乎无法把它带给她的主人，而不向前倾倒在她那过大的奶子上。");
         outputText("[pg]这头骄傲的野兽从他较小的奴隶手中接过闪闪发光的金属斧柄，将斧柄末端重重地砸在加工过的石地板上，仅凭蛮力就砸出了蜘蛛网般的裂纹。");
         outputText("[pg][say: 小心别弄坏了我的财产，哦，牛头人之王。记住你现在待在谁的宴会厅里，]一个冰冷却又女性化的声音喊道。");
         outputText("[pg]这头皇家野兽烦躁地抽动着耳朵，微微低下了头。[say: 你的财产，是的。我不会弄坏你珍贵的地板，但这一个……这个勇者……[he]将是我的。]牛头人的嘴角随着他巨大的勃起而向上翘起。[say: 不要让这变得比必要的更痛苦。]");
         outputText("[pg]在你和这场病态、扭曲的旅程的终点之间，有着成吨的肌肉。你将不得不再次战斗。");
         get_player().createStatusEffect(StatusEffects.MinotaurKingMusk,0,0,0,0);
         startCombat(new MinotaurKing());
      }
      
      public function dockucockuknotu(param1:int) : void
      {
         clearOutput();
         outputText("当你试图拔出时，出现了一个问题：你的肉结。它在你射精时膨胀了，现在你已经结束了，它已经膨胀到把你锁在你不同寻常的伴侣体内。无论你怎么拉或拽，你似乎都无法从这个充满精液的牛人身上脱身，更糟糕的是，他开始呻吟和扭动。被你的精液填满对他来说一定比你想象的更享受。");
         outputText("[pg]牛头人国王在呻吟，他的阴茎在你的手中变得更加坚硬，让你更难挣脱。现在你惊慌失措，徒劳地拉扯，只想在你的精液和一波牛兽精液倒流回你体内之前挣脱。你的[feet]在水坑般的汁液中滑倒，汹涌的公牛的阴茎把你拉倒在他的胸前，你们的胯部仍然连在一起。他接住了你，以一个不会伤害你们任何一个阴茎的角度抱着你，然后你感觉到了：先列腺液混合着你释放的液体推回了你的[cock " + (param1 + 1) + "]。[pg]");
         get_images().showImage("badend-minotaurlord-knot");
         outputText("高潮的压力逆转了液体的流动，当他的臀部离开地板，带着你一起时，压力加倍，把你的尿道变成了牛头人精液的管道。当然，其中混合了一些你自己的精液，但你从未有过雪白的精液如此直接地涂抹在你的身体上。当这个大块头把你变成他个人的奶油夹心蛋糕时，你软绵绵地瘫倒在他的抓握中");
         if(get_player().balls == 0)
         {
            outputText("，充满了公牛的精液。");
         }
         else
         {
            outputText("。你的[sack]肿得越来越大，你意识到你的[balls]正在变成充满精液的气球。");
         }
         outputText("[pg]你本应该感到惊慌或担忧，但你主要感到惊讶的是这感觉有多好。在他有力的臂弯中瘫软的感觉有多棒。他那令人麻醉的精液让你的身体感到多么温暖和满足。你在他的胸前流口水，然后把它舔干净，品尝着它咸咸的、汗水的味道。没有他的阴茎，你的嘴感觉空荡荡的，但随后你意识到你可以吸吮他的乳头，直到他的阴茎自由。");
         outputText("[pg]牛头人太棒了。一些其他欲望的模糊记忆试图显现出来，但你的公牛臀部的另一次挺动让你的头脑发晕，身体高潮。当然，你自己的射精压力与他的相比根本不算什么。你怀疑你是否还能再喷出任何东西。你的内脏一定被你主人的爱撑大了，但只要他再次使用你，那就没关系。你可以做他滴水的小精液套。");
         awardAchievement("孔明的陷阱",174,true,true,false);
         get_game().gameOver();
      }
      
      public function dockucocku(param1:int) : void
      {
         var cockIdx1:int;
         var _g:MinotaurKingScenes;
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1268,1);
         clearOutput();
         get_images().showImage("monster-minotaurlord");
         outputText("有了这么大、这么硬的鸡巴任你摆布……你可以做一些别人认为疯狂的事情，一些充满情色潜力的事情，这让你的[cocks]比空气中的淫靡气味和面前赤裸、丰满的身躯还要硬。");
         outputText("[pg]牛头人国王鸡巴上狂野膨胀的龟头被一个漂亮、巨大的精液缝整齐地装饰着，即使是现在，这个缝也被先列腺液撑得大大的。它大到足以成为一个小穴。你敢打赌，比一些地精的小穴还要大，而且看起来湿润两倍。在包皮和龟头之间点缀着三个中间的环，它们可以成为你双手极好的抓手，让你在真正操这根充满异国情调的牛头人鸡巴时更好地抓住它。你短暂地想知道，这些额外的环是否会让这样的鸡巴骑起来比");
         if(get_player().countCocksOfType(CockTypesEnum.HORSE) > 0)
         {
            outputText("像你这样的马鸡巴");
         }
         else
         {
            outputText("普通的马鸡巴");
         }
         outputText("更爽，但你认为这个想法无关紧要，于是将其抛诸脑后。");
         outputText("[pg]这次你将成为操人的那一方。");
         outputText("[pg]你抓住国王自慰的双手，把它们从你的战利品上拉开，他身体的疲惫让这项任务变得更容易。他虚弱地嘟囔着，但当你的手指接触到他时，他突然安静下来，意识到可能有人会帮他发泄。他一点也不知道你计划了什么。他乌黑的阴茎比你想象的还要光滑，上面覆盖着一层又一层的精液。在短暂的接触后，你的手感觉像黄油一样，就像你把它们浸入了一桶油脂中。");
         outputText("[pg]他凸起的龟头冠状沟和独特的解剖结构帮助你控制住那根叛逆抽搐的勃起，帮助你在将[cock " + (param1 + 1) + "]与滴着液体的缝隙对齐时保持静止。他的肉体在你的手中很热，他自由流动的液体感觉就像在你的[cockHead " + (param1 + 1) + "]上沐浴着温暖的油。你颤抖着，沉浸在想要一次性将其刺入的狂热欲望中，想要在一次巨大的抽插中将这根巨大的野兽鸡巴刺穿在你较短的长度上。");
         outputText("[pg]但你现在忍住了，开始轻轻地将你的[cockHead " + (param1 + 1) + "]插入牛头人国王更大勃起的欢迎拥抱中。他因这种感觉而不适地咕哝着，虚弱地伸长脖子看着你，但一秒钟后，他又瘫倒在地上，呻吟着。他太兴奋了，根本不在乎你把你的阴茎一寸一寸地塞进他的阴茎里；在这一点上，他会接受任何能让他发泄的东西。真是个荡妇。");
         outputText("[pg]你短暂地犹豫了一下，让你的[cock " + (param1 + 1) + "]");
         if(get_player().balls > 0)
         {
            outputText("和[balls]");
         }
         outputText("沐浴在从你阴茎周围漏出的稳定先列腺液流中，品味着这一刻。一旦你打败了莉希丝，你可能就没有机会再做这样的事情了，你希望它是令人难忘的。你抬头对她咧嘴一笑，用口型说，[say:下一个就是你，]然后继续把剩下的自己塞进你圆柱形的操管里。");
         outputText("[pg]里面很紧，紧得令人庆幸，但也非常湿润，你甚至可以把两根鸡巴并排滑进去，而且还能享受其中。你一插到底，手指就紧紧捏住，把压力又提高了一个档次。被击败的兽人国王心脏狂跳，通过他的鸡巴小穴传来一阵阵气动般的快感，用他自己的兴奋按摩着你。");
         outputText("[pg]你感到心情大好，或者至少是被挑逗得无暇顾及其他，你用手接住了一些流出的先列腺液，然后涂抹在这个大块头闪闪发光的肉棒上。像这样温顺的野兽理应得到奖励，所以你开始操他，抚摸他，让他配合你的节奏，从里到外刺激他巨大的阴茎。你发誓，这条闷热的肉管变得越来越热，或者至少越来越湿，就像你的[cock]能融化在一滩狂喜的极乐中一样。");
         outputText("[pg]或者也许那只是这个皇家野兽带有迷幻效果的先列腺液倒流进了你的尿道。很难说。你加快了抽插的速度，因为用力而发出咕哝声，用你自己的肉棒狠狠地耕耘着那根坚硬的马屌，以至于当你意外拔出时，这个精液荡妇的洞口松松垮垮地张开着。你立刻把自己重新塞进去，继续抽插，拼尽全力耕耘这个气味迷人的荡妇。他是如此巨大，如此阳刚，但随着你较小的阴茎插在他体内，他不过是个心甘情愿的婊子，绝望地渴望被操。");
         outputText("[pg]你深深地吸了一口气，让肺部充满了他强烈的费洛蒙，当你越过无法回头的临界点时，你那堕落的欲望在体内蔓延。你打算射在这个兽人的阴茎里，用充满活力的惊喜填满他的蛋蛋。这是无法避免的。高潮的快感淹没了你的理智，要求你的臀部狠狠地拍打在你性玩具钝钝的顶端，催促你让这个湿润且心甘情愿的洞口怀孕。");
         if(get_player().cumQ() <= 500)
         {
            outputText("[pg]你在纯粹、幸福的释放瞬间射精，将每一滴精液直接卸载到牛头人的尿道里。他的脸因为异物液体在体内倒流的感觉而扭曲。你只能想象你的精液流向了哪里，牛头人身体的哪些部位正在受到精子的袭击。你希望有一些能到达他肿胀的蛋蛋。");
         }
         else if(get_player().cumQ() <= 2500)
         {
            outputText("[pg]怀孕对你所做的事情来说是一个温和的词。你用浓稠的、充满活力的精液淹没了这个强大怪物最具男子气概的地方，把它深深地射入他的体内，以至于它无处可流，只能深入他的身体。你发誓你甚至看到他的蛋蛋微微鼓起。你仍然处于极乐状态，向他体内喷射，你举起其中一个肿胀的球体，感觉到它因为新的液体重量的涌入而抽搐。");
         }
         else
         {
            outputText("[pg]你像消防水龙带一样射精，将大量的粘稠精液直接喷射到牛头人的阴茎里。他的身体可能已经准备好排出这样的水流，但从未准备好接收。他发出你认为是由于不适而产生的咕哝声，惊恐地盯着液体鼓包消失在他的包皮里，蔓延到他的身体并聚集在他的蛋蛋里。你实际上可以看到他的蛋蛋因为泵入的精子而肿胀起来，完全被你下半身的果实撑得鼓鼓的。你举起其中一个，感觉到额外的液体在你填满它时晃动，惊叹于你自己的男子气概。");
         }
         if(!get_player().hasKnot(param1) || get_player().cocks[param1].knotMultiplier * get_player().cocks[param1].cockThickness <= 2)
         {
            outputText("[pg]终于满足了，你伴随着可怕的“schliiiick”声拔了出来。一些聚集的恶魔鼓掌并发出嘘声，但最令人惊讶的是国王自己发出的极乐的咆哮，紧接着他有力的臀部离开了地板。被操得很好的马屌像一座休眠已久的火山一样爆发了，从它松弛、被撑开的裂缝中喷射出精液，直到牛头人的精液像雨点一样落在聚集的人群上。许多恶魔立刻开始互相交配，但你很明智地避开了大部分。");
            outputText("[pg]一次又一次，那些有力、毛茸茸的臀部抬起，每一次，都有更多的牛精液在空中爆炸，混合着其他东西。更好的东西。勇者的精液。艾克塞莉亚被色情的季风恢复了活力，并在他结束之前设法爬到了上面，像骑着一匹狂野的野马一样骑着他。");
            outputText("[pg]他们俩都不会在短期内挡你的路了。是时候对付莉希丝了。");
            get_combat().cleanupAfterCombat(get_game().dungeons.resumeFromFight);
         }
         else
         {
            menu();
            _g = this;
            cockIdx1 = param1;
            addButton(0,"继续",function():void
            {
               _g.dockucockuknotu(cockIdx1);
            });
         }
      }
      
      public function buttufucku() : void
      {
         var _loc1_:int = get_player().cockThatFits(200);
         FlagDict_Impl_.arrayWriteInt(KFLAGS.flags,1268,1);
         clearOutput();
         get_images().showImage("monster-minotaurlord");
         outputText("当你有一个如此阳刚、肌肉发达的标本随叫随到时，为什么要操那个被宠坏的荡妇？他正在用疯狂、狂热的抽插泵动他的阴茎，在他充满麝香的蛋蛋和腹部毛发上喷射出子弹大小的先列腺液，但无论他怎么拉扯或挤压，他似乎都没有更接近释放。");
         outputText("[pg]多么完美。你脱下你的[armor]，打算自己也放松一下。通常像这样的大块头可能会对强行占有他的后门感到冒犯。现在，当他扭动和咩咩叫，乞求观众中的恶魔骑上他并提供缓解时？他会接受你给他的任何东西，即使是彻底的前列腺猛击。你的[cocks]肿胀");
         if(int(get_player().cocks.length) == 1)
         {
            outputText("");
         }
         outputText("想到这里，你变得坚硬挺拔，准备冲破这头公牛紧闭的后庭。这一定会很有趣。");
         outputText("[pg]你踢开牛头人国王的双腿，以便更好地进入，然后侧身靠近，一只手漫不经心地套弄着" + get_player().cockDescript() + "，同时你拼命克制自己，不让自己屈服于那诱人的气味。无论沉迷于他的气味的欲望有多么强烈，把脸颊贴在那根阳刚之柱上舔舐会有多么美妙，你都知道你必须抵制它，否则你会忘记让自己高潮和打倒莉希丝的事情。");
         outputText("[pg]她也在看着你。她那饥渴、没有灵魂的眼睛看着你抚摸自己的肉棒，看着你把它对准牛头人国王愤怒的后庭。当你向前推进时，堕落的女王舔了舔嘴唇。你将" + get_player().cockHead(_loc1_) + "在女王最信任的仆人的入口处摩擦，慢慢地撑开他的后庭，将其重塑成你享乐的容器。他很紧，比你想象的这种庞然大物还要紧。他的后庭紧紧抓住你塞进去的每一寸肉棒，几乎就像是想把你榨干，用狂热的热情为你按摩。");
         outputText("[pg]皇家牛头人痛苦的哞哞声却讲述了一个截然不同的故事。他长着角的脸难以置信地低头看着你，但他的肉棒在手指间明显地膨胀起来，展现出一条条凸起的青筋，似乎很高兴你能从后面刺激他。你拍打他的屁股，给他更多他的身体如此毫不掩饰地渴望的东西。你用力挺进");
         if(get_player().biggestCockLength() >= 24)
         {
            outputText("直到他的肚子凸显出你" + get_player().cockDescript(_loc1_) + "的清晰轮廓，向在场的所有人展示他已经被完全占有。你已经征服了这头曾经高贵的野兽，把他的身体变成了你那根巨大肉棒的毛茸茸、散发着好闻气味的避孕套。");
         }
         else if(get_player().biggestCockLength() >= 12)
         {
            outputText("直到你把整根粗壮的肉棒都塞进了他的屁股");
            if(get_player().hasKnot())
            {
               outputText("，连同肉结一起");
            }
            outputText("。这头曾经高贵的野兽的肚子上出现了一个明显的凸起，向所有人宣告你对他的统治。无论他以前是什么，他现在只是你的肉便器。");
         }
         else
         {
            outputText("直到你将整根" + get_player().cockDescript(_loc1_) + "埋入他紧紧挤压的肠道中，将他的消化系统重新用作你个人的阳具游乐场。");
         }
         outputText("[pg]这真是一个顶级的后庭。它有足够的弹性来容纳你提供的任何东西，也有足够的力量来提供完美的摩擦力。每当摩擦力减弱时，你只需拍打他的屁股，他就会立刻收紧。最棒的是，当你将肉棒在他的臀瓣之间抽插时，他不断滴落的先列腺液不可避免地滴落在你的阴茎上，用足够多的粘稠液体润滑你，让操他变得轻而易举。");
         outputText("[pg]真是浪费了这么好的肌肉。一直以来，这只巨大、淫荡的牛头人都可以自由地四处游荡，把他的肉棒塞进其他人的身体里，而他紧致、结实的臀瓣之间却藏着这样的宝藏。你抓住他的大腿，咆哮着更用力地操他的屁股。你的心跳在耳边轰鸣。你的老二硬得像石头一样，你很难看清几英寸外那根摇晃的马屌以外的任何东西。");
         outputText("[pg]国王的肉棒笔直地竖立着，三英尺长的神圣阴茎，龟头冠状沟似乎每秒都在变宽。你享受着钻入他体内的乐趣，向内向上挺动，摩擦他前列腺的边缘。每当你碰到它，他滴落的液体就会变成喷射。有些落在了你的[hair]和鼻子上，但你把它当作荣誉的徽章，证明你让这只曾经骄傲的牛头人成为了你给予他的后庭快感的奴隶。");
         outputText("[pg]他扭动着身体，显然正处于一次令人印象深刻的高潮边缘。你也和他一样。他的屁股简直是肉棒的天堂");
         if(int(get_player().cocks.length) > 1)
         {
            outputText("，而你的另一根阴茎");
            if(int(get_player().cocks.length) > 2)
            {
               outputText("");
            }
            outputText("在他颤抖的睾丸上滑过的感觉当然也不赖");
         }
         outputText("。如果你没有更重要的事情要做，或者他的气味没有在你的脑海中作祟，让你呼吸得越久，你的热情就越高涨，你可以在这里享受几个小时。但你已经被欲望冲昏了头脑，而且时间紧迫。");
         outputText("[pg]决定给自己一点奖励，你身体前倾，将舌头滑过国王那根沾满先列腺液的雄伟肉棒表面，在狂欢的狂喜中颤抖，因为这种味道将你推向了高潮的边缘。");
         if(get_player().hasKnot())
         {
            outputText("你的肉结膨胀起来。");
         }
         else if(get_player().countCocksOfType(CockTypesEnum.HORSE) > 0)
         {
            outputText("你的龟头冠状沟也适时地膨胀起来，与压在你舌头上的那个相匹配。");
         }
         else
         {
            outputText("他的龟头冠状沟像蘑菇云一样绽放，几乎把你的舌头推回了嘴里。");
         }
         outputText("你比他早一瞬间爆发，将浓稠的精液射入他不断吸吮的后庭。紧接着他也射了，一股精液如洪流般喷向二十英尺的高空。长角的地精们在这场精液雨中手舞足蹈，伸出舌头、双手捧起，尽可能多地接住这些液体。");
         outputText("[pg]在你呻吟着高潮时，一些滚烫新鲜的精液落入了你的嘴里，不知怎的让你的高潮变得更加火热，那种多汁的感觉超乎你的想象。");
         if(get_player().cumQ() > 2500)
         {
            outputText("国王的肚子隆起");
            if(get_player().biggestCockLength() >= 18)
            {
               outputText("变得更大了");
            }
            if(get_player().cumQ() > 5000)
            {
               outputText("，但你还远未结束。你给他的整个消化系统施加了压力。最后几股精液反向喷发，溅到了");
               if(get_player().balls > 0)
               {
                  outputText("你的蛋蛋上");
               }
               else
               {
                  outputText("你的胯部");
               }
               outputText("，在地板上形成了一滩黏糊糊、咸湿的水洼");
            }
            outputText("。");
         }
         outputText("[pg]在你们双双高潮结束很久之后，这个被击败的野兽依然在扭动挣扎，沉浸在难以理解的快感中。你在他过于急切的动作把你带偏之前拔了出来，吧唧着嘴舔掉唇上的残留物，准备继续你的正事。这味道或许能让你保持勃起，但你感觉已经足够满足，足以去对付一位恶魔女王了。");
         get_player().orgasm("Dick");
         dynStats(DynStat.Lust(10));
         get_combat().cleanupAfterCombat(get_game().dungeons.resumeFromFight);
      }
   }
}

